[{"title":"JBoss@JavaOne 2014: Develop Modern Java Web Applications w/ Java EE7 - Grant Shipley","description":"<p>In this mini-session, Grant Shipley would showcase how easily you can develop Java EE 7 applications with OpenShift. This would be a live coding session in which he would build a Java EE 7 from scratch using the WildFly application server and MongoDB database.</p>","video_url":"https://www.youtube.com/watch?v=4nUl3Ke2LSE","speakers":"Red Hat Developers","views":"834","likes":"3","video_thumb":"https://i.ytimg.com/vi/4nUl3Ke2LSE/mqdefault.jpg","hours":"0","minutes":"24","seconds":"3","tags":[],"publish_date":"2014-09-29T18:59:28","path":"/video/youtube/4nUl3Ke2LSE/"},{"title":"JBoss@JavaOne 2014: Scaling Your Database With Infinispan - Mircea Markus","description":"<p>Mircea Markus will talk about ways of scaling out database systems using the Infinispan data grid.</p>","video_url":"https://www.youtube.com/watch?v=7kA375d7S2w","speakers":"Red Hat Developers","views":"673","likes":"0","video_thumb":"https://i.ytimg.com/vi/7kA375d7S2w/mqdefault.jpg","hours":"0","minutes":"21","seconds":"31","tags":["936"],"publish_date":"2014-09-29T18:27:52","path":"/video/youtube/7kA375d7S2w/"},{"title":"JBoss@JavaOne 2014: The Path to CDI 2.0 - Antoine Sabot-Durand","description":"<p>CDI has proven itself to be a great asset for Java. The many features it provides (dependency injection, contextual lifecycle, configuration, interception, event notification, and more) and the innovative way it provides them (through the use of meta-annotations) explain its rapid adoption. This session reviews the features introduced in CDI 1.1 and 1.2 and discusses improvements planned for CDI 2.0.</p>","video_url":"https://www.youtube.com/watch?v=RynnZPsQdxM","speakers":"Red Hat Developers","views":"363","likes":"0","video_thumb":"https://i.ytimg.com/vi/RynnZPsQdxM/mqdefault.jpg","hours":"0","minutes":"28","seconds":"53","tags":["824","205"],"publish_date":"2014-09-30T22:03:14","path":"/video/youtube/RynnZPsQdxM/"},{"title":"JBoss@JavaOne 2014: Automatically scaling Java applications in the cloud - Steve Pousty","description":"<p>In this mini-session, Steve Pousty will showcase how to automatically scale Java EE applications on a PaaS environment using JBoss EAP and OpenShift. This will be a live demo where he will deploy an application to the cloud and then turn up the heat by running a load test with thousands of users.</p>","video_url":"https://www.youtube.com/watch?v=LhHkWoSqfow","speakers":"Red Hat Developers","views":"267","likes":"1","video_thumb":"https://i.ytimg.com/vi/LhHkWoSqfow/mqdefault.jpg","hours":"0","minutes":"25","seconds":"6","tags":["59","934"],"publish_date":"2014-09-30T20:58:50","path":"/video/youtube/LhHkWoSqfow/"},{"title":"JBoss@JavaOne 2014: Building Java EE Applications FAST - George Gastaldi & Lincoln Baxter","description":"<p>George and Lincoln will demonstrate the power of JBoss Forge, while creating an end-to-end Java EE application in mere minutes.</p>","video_url":"https://www.youtube.com/watch?v=kZB1KM4P0cs","speakers":"Red Hat Developers","views":"718","likes":"5","video_thumb":"https://i.ytimg.com/vi/kZB1KM4P0cs/mqdefault.jpg","hours":"0","minutes":"17","seconds":"52","tags":["1080"],"publish_date":"2014-09-30T20:23:06","path":"/video/youtube/kZB1KM4P0cs/"},{"title":"JBoss@JavaOne 2014: Test ride of the Arquillian Universe - A. Knutsen & B. Majsak","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=h6weeWXLYhk","speakers":"Red Hat Developers","views":"469","likes":"5","video_thumb":"https://i.ytimg.com/vi/h6weeWXLYhk/mqdefault.jpg","hours":"0","minutes":"19","seconds":"9","tags":["755"],"publish_date":"2014-10-01T22:28:18","path":"/video/youtube/h6weeWXLYhk/"},{"title":"JBoss@JavaOne 2014: Ceylon's fast-growing ecosystem - Stephane Epardaud","description":"<p>In this mini-session we will present Ceylon's fast growing ecosystem. Ceylon is a new modern JVM and JSVM language with a nice blend of functional and object, modularity and great tooling, designed first and foremost for team work.</p>","video_url":"https://www.youtube.com/watch?v=DbykbtG4Ick","speakers":"Red Hat Developers","views":"269","likes":"5","video_thumb":"https://i.ytimg.com/vi/DbykbtG4Ick/mqdefault.jpg","hours":"0","minutes":"32","seconds":"10","tags":["828"],"publish_date":"2014-10-01T21:52:52","path":"/video/youtube/DbykbtG4Ick/"},{"title":"JBoss@JavaOne 2014: Going Native: Bringing FFI to the JVM - Charles Nutter","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=ctyKu9siFJE","speakers":"Red Hat Developers","views":"372","likes":"3","video_thumb":"https://i.ytimg.com/vi/ctyKu9siFJE/mqdefault.jpg","hours":"0","minutes":"29","seconds":"58","tags":[],"publish_date":"2014-10-01T19:36:45","path":"/video/youtube/ctyKu9siFJE/"},{"title":"JBoss@JavaOne 2014: Java and Mongo for a fun mapping experience - Steve Citron-Pousty","description":"<p>You have a great idea for quick and interesting mapping application with pins on a map with some basic search. Then you lose interest because of all the pieces to install. NOT ANYMORE! In this workshop we are going to use 1 command to spin up all our infrastructure (EAP and MongoDB). Then write some quick and easy Java EE code to build a REST service on MongoDB. To wrap it up we will use a simple Leaflet application to display the results. You will witness the transformation from idea to cool pinny map in this quick session.</p>","video_url":"https://www.youtube.com/watch?v=WCb1z4tKU7E","speakers":"Red Hat Developers","views":"247","likes":"1","video_thumb":"https://i.ytimg.com/vi/WCb1z4tKU7E/mqdefault.jpg","hours":"0","minutes":"35","seconds":"6","tags":[],"publish_date":"2014-10-01T20:56:10","path":"/video/youtube/WCb1z4tKU7E/"},{"title":"fabric8 - Java developer tools for Kubernetes and OpenShift by Roland Huß","description":"<p>Fabric8 is an integration and management platform adding to the Java developer's perspective of Kubernetes and OpenShift. It consists of multiple parts.\n\nFabric8 tooling helps tremendously in deploying Java applications on Kubernetes and OpenShift by creating all the complex deployment descriptors directly from a Java build.\n\nIn addition, fabric8 contains a rich set of DevOps Microservices which provides a flexible and automatedsetup for a Continous Integration and Delivery pipeline on a per project basis.\n\nIt also includes an integration-Platform-as-a-Service (iPaaS) centered around Camel and ActiveMQ with rich visualisations and one click installations.\n\nBut the queen of fabric8 is its web console which allows for a rich user experience for managing Kubernetes services, pods and more. With this in place even complex setups can be easily managed.\n\nThis talk provides an overview over all these components and shows how the pieces fit together.</p>","video_url":"https://www.youtube.com/watch?v=DCQ9SEdteHs","speakers":"Red Hat Developers","views":"2653","likes":"19","video_thumb":"https://i.ytimg.com/vi/DCQ9SEdteHs/mqdefault.jpg","hours":"0","minutes":"31","seconds":"37","tags":["906","909","908"],"publish_date":"2015-11-11T08:28:09","path":"/video/youtube/DCQ9SEdteHs/"},{"title":"Docker Tooling for JavaEE Developers by Xavier Coulon","description":"<p>Docker is awesome, but how to use it well when doing Java development ?\n\nIn this talk you will get a quick introduction on how to use Docker effectively, especially for Java EE development. We will show how the recent release of Eclipse Mars supports Docker to make it even more integrated into your day-to-day work from within your IDE. In particular, you'll see how you can pull and run an image for a database, build a custom image for an application server, run it and deploy a JavaEE application using data volume, exposed ports and container links. And more !</p>","video_url":"https://www.youtube.com/watch?v=tq58w0DYmgc","speakers":"Red Hat Developers","views":"1474","likes":"8","video_thumb":"https://i.ytimg.com/vi/tq58w0DYmgc/mqdefault.jpg","hours":"0","minutes":"29","seconds":"54","tags":["906","909","908"],"publish_date":"2015-11-11T08:28:08","path":"/video/youtube/tq58w0DYmgc/"},{"title":"Hit the plumber - develop a realtime web application with vert.x 3 by Clement Escoffier/Paulo Lopes","description":"<p>This session presents how you can develop a realtime web application with vert.x web. In this context, a small game is going to be developed on stage demonstrating how easy it is to build such kind of applications with Vert.x 3. Of course attendees can play the game.</p>","video_url":"https://www.youtube.com/watch?v=vC1EdeBZl7M","speakers":"Red Hat Developers","views":"3736","likes":"28","video_thumb":"https://i.ytimg.com/vi/vC1EdeBZl7M/mqdefault.jpg","hours":"0","minutes":"30","seconds":"11","tags":["906","909","908"],"publish_date":"2015-11-11T08:19:35","path":"/video/youtube/vC1EdeBZl7M/"},{"title":"Doing Open Source (The Right Way) by Charles Nutter","description":"<p>Have you ever used an open source project? Of course you have, but have you made any contributions yourself? Filed a bug report? Submitted a patch? Have you ever started your own OSS project, or taken a closed/private project public? What licenses should you use? How do you manage contributions? How do you support contributors and still get work done? What do you do with difficult community members? In this talk we'll go over the basics of OSS: how to get involved, how to start a project, how to manage contributions. We'll discuss project lifecycles, legal CYA tips, and how to keep projects moving. You'll see the inner workings of real OSS projects, and learn how to be a better OSS user and producer.</p>","video_url":"https://www.youtube.com/watch?v=wDMO8Gsg1Ow","speakers":"Red Hat Developers","views":"358","likes":"6","video_thumb":"https://i.ytimg.com/vi/wDMO8Gsg1Ow/mqdefault.jpg","hours":"0","minutes":"51","seconds":"10","tags":["906","909","908"],"publish_date":"2015-11-12T06:00:40","path":"/video/youtube/wDMO8Gsg1Ow/"},{"title":"Process-driven applications: let BPM do (some of) your work by Kris Verlaenen","description":"<p>Even the simplest application ideas always end up requiring more development than you hoped for: maintaining long-lived state, interaction with other services or human actors performing some of the work, showing current status of ongoing requests, management and reporting, etc. Business processes and rules allow you to externalize some of that logic and dynamically update it, but you don't want your business process management (BPM) system to get in your way either. And every application is different, so you want to be able to fully control every bit of it. Using process-driven application development, you define your application logic in a (flexible) business process, but you also expect your BPM system to help you out with much more than that. In this session we will show you live how to quickly get new web applications up and running by relying on jBPM to provide some of the UI (should you want to), or even to generate parts of your application for you (that you can customize later), so you can focus on what makes your application different. jBPM uses the power of open source and it's flexible architecture to let you decide what you need: nothing more, nothing less.</p>","video_url":"https://www.youtube.com/watch?v=oW4__q2iaJs","speakers":"Red Hat Developers","views":"1555","likes":"11","video_thumb":"https://i.ytimg.com/vi/oW4__q2iaJs/mqdefault.jpg","hours":"1","minutes":"1","seconds":"53","tags":["909","906","908"],"publish_date":"2015-11-13T09:08:52","path":"/video/youtube/oW4__q2iaJs/"},{"title":"CDI 2.0 is coming by Antoine Sabot-Durand/José Paumard","description":"<p>The work on JSR 365 (Context and Dependency Injection for Java) started one year ago. Expert group already added interesting features like asynchronous events or Java SE bootstrap. Thanks to early draft and alpha version of CDI 2.0 implementation we can already experiment the future CDI 2.0.\n\nIn this talk we will show the top new features in CDI 2.0 thru code examples (when possible) and presents expert group serious leads for the end of this first totally open source Java EE specification.</p>","video_url":"https://www.youtube.com/watch?v=PGlNHfS9e9g","speakers":"Red Hat Developers","views":"326","likes":"4","video_thumb":"https://i.ytimg.com/vi/PGlNHfS9e9g/mqdefault.jpg","hours":"1","minutes":"0","seconds":"22","tags":["906","909","908"],"publish_date":"2015-11-13T09:08:50","path":"/video/youtube/PGlNHfS9e9g/"},{"title":"vert.x 3 - be reactive on the JVM but not only in Java by Clement Escoffier/Paulo Lopes","description":"<p>Join us in March 21-23 for Devoxx US 2017, details @ https://devoxx.us \n\nVert.x 3 is a toolkit to create reactive applications on the Java Virtual Machine. Vert.x 3 takes the JVM to new levels of reactive awesomeness: it lets you build scalable applications transparently distributed in Java, JavaScript, Ruby and Groovy. And, you don’t have to choose a single language, but mix them!\n\nThis talk presents the key concepts of Vert.x and how you can use it to build your next application. This session explains how the simple model promoted by Vert.x enables the construction of concurrent, scalable and efficient micro-service based applications.\n\nSeveral examples are developed during the talk and demonstrates Vert.x features such as the distributed event bus, the high availability, the polyglot aspect and vert.x web.</p>","video_url":"https://www.youtube.com/watch?v=qL5BGHPXrac","speakers":"Red Hat Developers","views":"7684","likes":"61","video_thumb":"https://i.ytimg.com/vi/qL5BGHPXrac/mqdefault.jpg","hours":"0","minutes":"55","seconds":"11","tags":["909","906","908","225"],"publish_date":"2015-11-13T09:08:51","path":"/video/youtube/qL5BGHPXrac/"},{"title":"From object oriented to functional domain modeling by Mario Fusco","description":"<p>Join us in March 21-23 for Devoxx US 2017, details @ https://devoxx.us \n\nThe main consequence of the introduction of lambda expressions in Java 8 is the possibility of conveniently mixing the object oriented and the functional paradigms. Nevertheless the biggest part of Java developers is not used yet to employ functional idioms and then they are not ready to fully leverage the new functional capabilities of Java. In particular it is still uncommon to see functions used together with data in business domain model. The purpose of this talk is not doing a comparison between object oriented and functional programming, but showing how these two styles can be combined in order to take advantage of the good parts of both. For example it's usual to pass a list of data to a function that processes them, but there are cases when you may want to create a list of functions and pass a single data through all of them. Immutable objects leads to a inherently thread-safe domain model. Functions often compose better than objects. Side-effect free code allows better reusability. This talk will demonstrate the validity of these statements with practical examples till to distil the essence of functional programming: data and behaviours are two aspects of the same thing.</p>","video_url":"https://www.youtube.com/watch?v=K6BmGBzIqW0","speakers":"Red Hat Developers","views":"7972","likes":"89","video_thumb":"https://i.ytimg.com/vi/K6BmGBzIqW0/mqdefault.jpg","hours":"0","minutes":"55","seconds":"57","tags":["909","906","908"],"publish_date":"2015-11-13T09:08:51","path":"/video/youtube/K6BmGBzIqW0/"},{"title":"JRuby 9000 by Charles Nutter","description":"<p>Ruby has come a long way since JRuby first ran Rails in 2006. Frameworks like Rails have grown up with the modern web, now supporting web sockets, microservices, and integration with Javascript client libraries like Ember. Concurrency utilities modeled after the JDK are helping Ruby scale horizontally. Applications can be built with Rake - or with JRuby plugins for Gradle and Maven. Maven poms can be written in a beautiful Ruby DSL. Swing, JavaFX, and other graphics libraries become easy and fun with JRuby. Sass and Asciidoctor are already being used in Java apps thanks to JRuby. And you can bundle up the whole thing in an executable jar or war file; your devops will never know it's Ruby. Come see what JRuby 9000 can do for you in 2015.</p>","video_url":"https://www.youtube.com/watch?v=1t4iu7tefi4","speakers":"Red Hat Developers","views":"734","likes":"8","video_thumb":"https://i.ytimg.com/vi/1t4iu7tefi4/mqdefault.jpg","hours":"0","minutes":"58","seconds":"38","tags":["906","909","908"],"publish_date":"2015-11-12T06:00:43","path":"/video/youtube/1t4iu7tefi4/"},{"title":"Red Hat Booth at Devoxx Belgium 2015","description":"<p>A short and entertaining interview with Markus Eisele at the Red Hat booth.</p>","video_url":"https://www.youtube.com/watch?v=VS3G6-v_qwc","speakers":"Red Hat Developers","views":"52","likes":"0","video_thumb":"https://i.ytimg.com/vi/VS3G6-v_qwc/mqdefault.jpg","hours":"0","minutes":"1","seconds":"5","tags":["425","906"],"publish_date":"2015-11-18T09:30:29","path":"/video/youtube/VS3G6-v_qwc/"},{"title":"Behind-the-scenes of .NET on Red Hat Enterprise Linux","description":"<p>You may have heard Microsoft hearts Linux.  And soon you will be able to use .NET on Red Hat Enterprise Linux. While the pieces are still being finalized we are excited to share a behind-the-scenes sneak peek at how this will work for you.\n\nIn this 2-hour webinar and demo, see:\nHow .NET on Red Hat Enterprise Linux is coming together \nWhat you can expect from the development experience \n.NET on Red Hat Enterprise Linux in action</p>","video_url":"https://www.youtube.com/watch?v=pIURFD15WJ0","speakers":"Red Hat Developers","views":"2925","likes":"23","video_thumb":"https://i.ytimg.com/vi/pIURFD15WJ0/mqdefault.jpg","hours":"1","minutes":"7","seconds":"36","tags":["155","915","425"],"publish_date":"2016-04-13T13:01:25","path":"/video/youtube/pIURFD15WJ0/"},{"title":"OpenShift Origin Community Hangout: Sneak Peak at OpenShift Orign Index Project","description":"<p>The OO-Index project needs you! This a sneak preview of a community project to build & host a place to find and browse OpenShift Community-sourced QuickStarts and Cartridges in GitHub.  This package is a general-purpose stand-alone index of quickstarts and cartridges for the OpenShift hosting platform and can easily be deployed on an Origin-based Platform as a Service. The project is written in Python using Flask and could use some more community love so if you have some band-width, take a look at the code & make a few commits! CSS/HTML stylists wanted!</p>","video_url":"https://www.youtube.com/watch?v=efSuUbCGcOE","speakers":"Red Hat Developers","views":"123","likes":"1","video_thumb":"https://i.ytimg.com/vi/efSuUbCGcOE/mqdefault.jpg","hours":"0","minutes":"23","seconds":"53","tags":["696","1000","698","1264","1229","69","838","815"],"publish_date":"2014-03-10T21:10:38","path":"/video/youtube/efSuUbCGcOE/"},{"title":"OpenShift Origin Community Hangout: SCLs and OpenShift","description":"<p>Software Collection Libraries and OpenShift Origin</p>","video_url":"https://www.youtube.com/watch?v=j7vU0KWndWs","speakers":"Red Hat Developers","views":"25","likes":"1","video_thumb":"https://i.ytimg.com/vi/j7vU0KWndWs/mqdefault.jpg","hours":"0","minutes":"31","seconds":"37","tags":["696","1000","698"],"publish_date":"2014-02-14T19:00:16","path":"/video/youtube/j7vU0KWndWs/"},{"title":"OpenShift Origin Community Hangout: Theming the Console with Steve Goodwin","description":"<p>OpenShift Origin Community Hangout: Theming the Console with Steve Goodwin and a discussion about building custom \"App Stores\" with Ryan J & Corey Daley</p>","video_url":"https://www.youtube.com/watch?v=kz1-D4GkE60","speakers":"Red Hat Developers","views":"193","likes":"3","video_thumb":"https://i.ytimg.com/vi/kz1-D4GkE60/mqdefault.jpg","hours":"0","minutes":"30","seconds":"47","tags":["696","1000","698","838","69","850","1229"],"publish_date":"2013-12-13T18:39:20","path":"/video/youtube/kz1-D4GkE60/"},{"title":"OpenShift Origin Community Hangout: A Conversation with the OpenShift UX Design team","description":"<p>Demos of new Admin Console and a conversation about UX & UI design on the OpenShift project with the</p>","video_url":"https://www.youtube.com/watch?v=a-iw3NKeRco","speakers":"Red Hat Developers","views":"61","likes":"1","video_thumb":"https://i.ytimg.com/vi/a-iw3NKeRco/mqdefault.jpg","hours":"0","minutes":"39","seconds":"46","tags":["59","1229","69","425","850"],"publish_date":"2013-12-10T01:29:16","path":"/video/youtube/a-iw3NKeRco/"},{"title":"OpenShift Origin Community Hangout: Solum Update with Clayton Coleman & Chris Alfonso","description":"<p>Coming off the heels of a 2-day session on Solum at Rackspace's SF offices, where parties interested in Solum, the OpenStack-related initiative for application lifecycle management that leverages both Heat & Docker - Red Hat OpenShift Team members who attended (Clayton Coleman, Chris Alfonso & Krishna Raman) bring us up to speed on the project & Red Hat's involvement.</p>","video_url":"https://www.youtube.com/watch?v=S5Gap1Ugjuo","speakers":"Red Hat Developers","views":"198","likes":"0","video_thumb":"https://i.ytimg.com/vi/S5Gap1Ugjuo/mqdefault.jpg","hours":"0","minutes":"33","seconds":"36","tags":["59","1229","851","1363","105","69"],"publish_date":"2013-11-25T20:28:41","path":"/video/youtube/S5Gap1Ugjuo/"},{"title":"OpenShift Origin Weekly Community Hangout: Identity Mgmt with Dmitri Pal","description":"<p>OpenShift Origin Weekly Community Hangout: Identity Mgmt with Dmitri Pal</p>","video_url":"https://www.youtube.com/watch?v=DPshCVcERQY","speakers":"Red Hat Developers","views":"88","likes":"0","video_thumb":"https://i.ytimg.com/vi/DPshCVcERQY/mqdefault.jpg","hours":"0","minutes":"33","seconds":"10","tags":["696","1000","698"],"publish_date":"2013-10-11T16:50:26","path":"/video/youtube/DPshCVcERQY/"},{"title":"OpenShift Origin Weekly Community Hangout: The Heat is On!","description":"<p>OpenShift Origin Weekly Community Hangout: The Heat is On! Deploying & AutoScaling OpenShift with Heat on OpenStack - a talk with Chris Alfonso & Steven Dake & Diane Mueller</p>","video_url":"https://www.youtube.com/watch?v=AVD0S0NJboA","speakers":"Red Hat Developers","views":"123","likes":"0","video_thumb":"https://i.ytimg.com/vi/AVD0S0NJboA/mqdefault.jpg","hours":"0","minutes":"40","seconds":"28","tags":["696","1000","698","1229","59","1008","1421","69","838"],"publish_date":"2013-08-16T16:59:39","path":"/video/youtube/AVD0S0NJboA/"},{"title":"OpenShift Origin Weekly Hangout: OpenShift Origin at GetUpCloud","description":"<p>OpenShift Origin & GetUpCloud</p>","video_url":"https://www.youtube.com/watch?v=P3GaAUjpNvg","speakers":"Red Hat Developers","views":"38","likes":"1","video_thumb":"https://i.ytimg.com/vi/P3GaAUjpNvg/mqdefault.jpg","hours":"0","minutes":"45","seconds":"32","tags":["696","1000","698"],"publish_date":"2013-05-15T20:17:12","path":"/video/youtube/P3GaAUjpNvg/"},{"title":"OpenShift Origin Community Hangout: DotNet on OpenShift","description":"<p>OpenShift Community Hangout with @uhurusoftware</p>","video_url":"https://www.youtube.com/watch?v=k5ffh4pZ3PA","speakers":"Red Hat Developers","views":"119","likes":"3","video_thumb":"https://i.ytimg.com/vi/k5ffh4pZ3PA/mqdefault.jpg","hours":"0","minutes":"31","seconds":"12","tags":["69","915","59","1229"],"publish_date":"2014-03-31T17:41:03","path":"/video/youtube/k5ffh4pZ3PA/"},{"title":"OpenShift and Microsoft .NET in Action","description":"<p>We are collaborating with Uhuru Software to bring Microsoft .NET and SQL Server capabilities to OpenShift, as an open source community-driven effort in OpenShift Origin. The demo will show the work done to date and how easy it is to deploy a .NET application with OpenShift.</p>","video_url":"https://www.youtube.com/watch?v=rtubl2QyqKQ","speakers":"Red Hat Developers","views":"4138","likes":"16","video_thumb":"https://i.ytimg.com/vi/rtubl2QyqKQ/mqdefault.jpg","hours":"0","minutes":"7","seconds":"9","tags":["69","59","425","575","155","1362","1328","838"],"publish_date":"2014-03-12T14:47:15","path":"/video/youtube/rtubl2QyqKQ/"},{"title":"Drupal in the Cloud with OpenShift NYCCampDrupal 2014-04-10 Part 1","description":"<p>Part One of a 4 hour workshop held at the UN 2014-04-10 as part of Drupal NYCCamp event with OpenShift's Diane Mueller and Phase2's Steven Merrill.</p>","video_url":"https://www.youtube.com/watch?v=ei5u7GooF7g","speakers":"Red Hat Developers","views":"95","likes":"0","video_thumb":"https://i.ytimg.com/vi/ei5u7GooF7g/mqdefault.jpg","hours":"0","minutes":"46","seconds":"49","tags":["918","838","59","1229","1378","911"],"publish_date":"2014-04-22T16:15:22","path":"/video/youtube/ei5u7GooF7g/"},{"title":"Part 2: Drupal in the Cloud with OpenShift NYCCampDrupal 2014-04-10 Part 2","description":"<p>Part One of a 4 hour workshop held at the UN 2014-04-10 as part of Drupal NYCCamp event with OpenShift's Diane Mueller and Phase2's Steven Merrill.</p>","video_url":"https://www.youtube.com/watch?v=pyrJ5TsMtgw","speakers":"Red Hat Developers","views":"124","likes":"2","video_thumb":"https://i.ytimg.com/vi/pyrJ5TsMtgw/mqdefault.jpg","hours":"1","minutes":"12","seconds":"53","tags":["918","59","1229","838","1244"],"publish_date":"2014-04-22T18:27:42","path":"/video/youtube/pyrJ5TsMtgw/"},{"title":"OpenShift Origin Community Hour: Using OpenShift Cartridges at Jelastic","description":"<p>Get a deep dive into the world of OpenShift Cartridges from Jelastic's Ruslan Sinitskiy's perspective. Learn how to leverage OpenShift Cartridges on Jelastic's PaaS .  Find out more about Jelastic's PaaS offering and see OpenShift Cartridges in action. Q&A will be on the irc channel #openshift-dev on freenode</p>","video_url":"https://www.youtube.com/watch?v=ppkdGmh9FMQ","speakers":"Red Hat Developers","views":"435","likes":"3","video_thumb":"https://i.ytimg.com/vi/ppkdGmh9FMQ/mqdefault.jpg","hours":"0","minutes":"34","seconds":"5","tags":["696","1000","698"],"publish_date":"2014-04-25T17:42:21","path":"/video/youtube/ppkdGmh9FMQ/"},{"title":"The GetUpCloud Story: OpenShift Origin PaaS in Action FISL15 May 2014 Porto Alegre Brasil","description":"<p>The GetUpCloud Story: OpenShift Origin PaaS in Action FISL15 May 2014 Porto Alegre Brasil</p>","video_url":"https://www.youtube.com/watch?v=zlKrN2tepoQ","speakers":"Red Hat Developers","views":"92","likes":"1","video_thumb":"https://i.ytimg.com/vi/zlKrN2tepoQ/mqdefault.jpg","hours":"0","minutes":"56","seconds":"28","tags":["963","59","1229","838","792","982"],"publish_date":"2014-05-22T20:59:54","path":"/video/youtube/zlKrN2tepoQ/"},{"title":"Building OpenShift Cartridges in Spanish w/ English Slides by Alex Oviedo FISL15 May 2014","description":"<p>Alex Irmel Oviedo Building OpenShift Cartridges presentation given at FISL15 May 2014 in Porto Alegre, Brazil\n\nAlex's Tech Blog: http://www.alexove.mallkudev.com/en/2014/05/13/report-fisl-15-porto-alegre/\n\nFollow Alex on twitter @alleinerwolf</p>","video_url":"https://www.youtube.com/watch?v=0EN7fj7FpZk","speakers":"Red Hat Developers","views":"51","likes":"2","video_thumb":"https://i.ytimg.com/vi/0EN7fj7FpZk/mqdefault.jpg","hours":"0","minutes":"25","seconds":"20","tags":["59","963"],"publish_date":"2014-05-22T22:27:52","path":"/video/youtube/0EN7fj7FpZk/"},{"title":"Zero To Cloud: Revolutionize your Application Lifecycle with OpenShift FISL15  May 2014","description":"<p>Zero To Cloud: How to Revolutionize your Application Lifecycle with PaaS\n\n\nPresentation by Diane Mueller, OpenShift Community Manager at Red Hat\nOpenShift \nFISL15 \nPorto Alegre, Brasil May 2014</p>","video_url":"https://www.youtube.com/watch?v=5jZu37eWDas","speakers":"Red Hat Developers","views":"124","likes":"1","video_thumb":"https://i.ytimg.com/vi/5jZu37eWDas/mqdefault.jpg","hours":"0","minutes":"42","seconds":"45","tags":["963","792","69","425"],"publish_date":"2014-05-22T23:49:37","path":"/video/youtube/5jZu37eWDas/"},{"title":"OpenShift Origin Community Hangout: HA Puppet Modules explained","description":"<p>This week's session covers the basics of OpenShift Origin's Installation tools & then goes into a Master Class on HA & Puppet with Harrison Ripps (OpenShift) & Daneyon Hansen (Cisco) giving an update on the new HA puppet scripts for installing OpenShift Origin. \nHosted by Diane Mueller (OpenShift)\nGuest include Jason Ford (BlackMesh) & Steven Merrill (Phase2)</p>","video_url":"https://www.youtube.com/watch?v=ZUv8YkLoKnc","speakers":"Red Hat Developers","views":"218","likes":"3","video_thumb":"https://i.ytimg.com/vi/ZUv8YkLoKnc/mqdefault.jpg","hours":"0","minutes":"59","seconds":"41","tags":["696","1000","698","59","69","1017","425","1229","850"],"publish_date":"2014-06-16T18:49:29","path":"/video/youtube/ZUv8YkLoKnc/"},{"title":"OpenShift Origin Community Hangout: Sync Diff Project & Persistence","description":"<p>That Persistent Conversation:  Hosted by Diane Mueller with guests: John Hawley of Intel & David Strauss of Pantheon - an intro into the SyncDiff project and the problem of persistence in the cloud. Great insights from Pantheon on how they've solved it for Drupal and tips for future collaboration efforts.</p>","video_url":"https://www.youtube.com/watch?v=DWYYgQsKbQE","speakers":"Red Hat Developers","views":"44","likes":"3","video_thumb":"https://i.ytimg.com/vi/DWYYgQsKbQE/mqdefault.jpg","hours":"0","minutes":"38","seconds":"39","tags":["696","1000","698","59","1393","918","1234","838","69"],"publish_date":"2014-06-27T18:50:43","path":"/video/youtube/DWYYgQsKbQE/"},{"title":"OpenShift Origin Community Hangout: Getting Started with ElasticSearch on OpenShift","description":"<p>This week, your host, Red Hat's Diane Mueller will be covering \"Getting Started with ElasticSearch on OpenShif\"t with an Introduction to ElasticSearch from Kurt Hurtado of Elasticsearch.com and a demonstration of how to use the 2 ElasticSearch Community Cartridges built by GetUpCloud.com's Mateus Caruccio.\n\nKurt Hurtado is a core Logstash developer based out of  Los Altos California. He has been working with Elasticsearch (as well as Logstash) for several years. \n\nMateus Caruccio is the Founder and CTO of GetUpCloud, the Brazilian Public PaaS based on OpenShift Origin and a frequent contributor to the OpenShift Origin Open Source project.</p>","video_url":"https://www.youtube.com/watch?v=Qb3hysXm3aA","speakers":"Red Hat Developers","views":"648","likes":"4","video_thumb":"https://i.ytimg.com/vi/Qb3hysXm3aA/mqdefault.jpg","hours":"0","minutes":"35","seconds":"6","tags":["696","1000","698"],"publish_date":"2014-07-21T18:30:41","path":"/video/youtube/Qb3hysXm3aA/"},{"title":"WebSphere Application Server on Red Hat OpenShift Enterprise","description":"<p>This video shows how IBM WebSphere Application Server can be provisioned in Red Hat's PaaS platform OpenShift Enterprise.\n\nAt this point in time the underlying technology cartridge can be considered rather as a Proof of Concept cartridge, as its sole purpose is to show that an integration is indeed possible.\n\nThe cartridge currently supports the following features:\n\n- Provisioning of new IBM WebSphere Application Server instance in minutes\n- Full build & Deploy life cycle (as with EAP cartridge)\n- Hot Deployment\n- Jenkins Integration\n- Integration into JBoss Developer Studio\n\nThe source code can be found here: https://github.com/juhoffma/openshift-origin-websphere-cartridge</p>","video_url":"https://www.youtube.com/watch?v=P4vh9_x2LvE","speakers":"Red Hat Developers","views":"487","likes":"3","video_thumb":"https://i.ytimg.com/vi/P4vh9_x2LvE/mqdefault.jpg","hours":"0","minutes":"10","seconds":"58","tags":["425"],"publish_date":"2014-11-14T13:52:52","path":"/video/youtube/P4vh9_x2LvE/"},{"title":"OpenShift Commons Briefing on Operations @OpenShift Online with Adam Miller","description":"<p>OpenShift Commons Briefing on Operations @OpenShift Online with Adam Miller</p>","video_url":"https://www.youtube.com/watch?v=yQoYBS0daeM","speakers":"Red Hat Developers","views":"263","likes":"0","video_thumb":"https://i.ytimg.com/vi/yQoYBS0daeM/mqdefault.jpg","hours":"0","minutes":"25","seconds":"27","tags":["59","1084","848"],"publish_date":"2015-03-05T20:50:44","path":"/video/youtube/yQoYBS0daeM/"},{"title":"OpenShift Commons Briefing: Networking and OpenShift V3 with Clayton Coleman","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=HMiuJdY3Hbg","speakers":"Red Hat Developers","views":"2636","likes":"7","video_thumb":"https://i.ytimg.com/vi/HMiuJdY3Hbg/mqdefault.jpg","hours":"0","minutes":"52","seconds":"14","tags":["59","105","125","69"],"publish_date":"2015-03-05T20:50:44","path":"/video/youtube/HMiuJdY3Hbg/"},{"title":"OpenShift Commons Briefing: OpenShift V3 And Storage (Mark Turansky)","description":"<p>30 minutes overview on OpenShift V3 and Storage presented by Mark Turansky, Red Hat engineer and moderated by Mike Barrett Red Hat OpenShift Product Manager</p>","video_url":"https://www.youtube.com/watch?v=RfiWPYg9unY","speakers":"Red Hat Developers","views":"584","likes":"0","video_thumb":"https://i.ytimg.com/vi/RfiWPYg9unY/mqdefault.jpg","hours":"0","minutes":"30","seconds":"3","tags":["69","1380"],"publish_date":"2015-03-05T20:50:44","path":"/video/youtube/RfiWPYg9unY/"},{"title":"OpenShift Commons Briefing  with Mike Barrett V3 Update","description":"<p>OpenShift Commons Briefing on V3 Release by Mike Barrett of Red Hat</p>","video_url":"https://www.youtube.com/watch?v=N4lu2DhSI5Q","speakers":"Red Hat Developers","views":"529","likes":"7","video_thumb":"https://i.ytimg.com/vi/N4lu2DhSI5Q/mqdefault.jpg","hours":"0","minutes":"39","seconds":"9","tags":["848","798","59"],"publish_date":"2015-03-05T20:50:14","path":"/video/youtube/N4lu2DhSI5Q/"},{"title":"OpenShift Commons Briefing: OpenShift V3 Features Update with Joe Fernandes","description":"<p>OpenShift Commons Briefing: OpenShift V3 Features Update with Joe Fernandes</p>","video_url":"https://www.youtube.com/watch?v=wjWgVApNbQA","speakers":"Red Hat Developers","views":"2426","likes":"17","video_thumb":"https://i.ytimg.com/vi/wjWgVApNbQA/mqdefault.jpg","hours":"0","minutes":"47","seconds":"8","tags":["69","59","425"],"publish_date":"2015-03-13T17:56:14","path":"/video/youtube/wjWgVApNbQA/"},{"title":"OpenShift Commons Briefing: OpenShift and Monitoring with Thomas Wiest (Red Hat)","description":"<p>Lesson Learned at OpenShift Online (http://openshift.com); insights into Operational Monitoring at OpenShift.com, use of Zabbix, Puppet, Ansible. Nagios and even collectd! A great presentation by Red Hat's Thomas Wiest.</p>","video_url":"https://www.youtube.com/watch?v=-I0hzuZc1jQ","speakers":"Red Hat Developers","views":"980","likes":"7","video_thumb":"https://i.ytimg.com/vi/-I0hzuZc1jQ/mqdefault.jpg","hours":"1","minutes":"0","seconds":"56","tags":["59","69","798","1084","49","731","1267","847"],"publish_date":"2015-03-20T16:23:22","path":"/video/youtube/-I0hzuZc1jQ/"},{"title":"OpenShift Commons Briefing: Scheduling Pods for High Availability with Abhishek Gupta (Red Hat)","description":"<p>OpenShift Commons Briefing: Scheduling Pods for High Availability with Abhishek Gupta (Red Hat</p>","video_url":"https://www.youtube.com/watch?v=R5eHPk9YcRA","speakers":"Red Hat Developers","views":"460","likes":"1","video_thumb":"https://i.ytimg.com/vi/R5eHPk9YcRA/mqdefault.jpg","hours":"0","minutes":"48","seconds":"9","tags":["69","125"],"publish_date":"2015-04-09T19:30:03","path":"/video/youtube/R5eHPk9YcRA/"},{"title":"OpenShift Commons Briefing: Continuous Development with JRebel on OpenShift","description":"<p>OpenShift Commons Briefing: Continuous Development with JRebel on OpenShift with Adam Koblentz (ZeroTurnAround) & Arun Gupta (Red Hat)</p>","video_url":"https://www.youtube.com/watch?v=NufEwYn1t8c","speakers":"Red Hat Developers","views":"121","likes":"0","video_thumb":"https://i.ytimg.com/vi/NufEwYn1t8c/mqdefault.jpg","hours":"1","minutes":"58","seconds":"43","tags":["69","1149","49"],"publish_date":"2015-04-20T20:16:17","path":"/video/youtube/NufEwYn1t8c/"},{"title":"OpenShift Commons Briefing: OpenShift V3 Beta 3 Training Session with Erik Jacobs (Red Hat)","description":"<p>Part 1: Developer Workflows \nOpenShift V3 Beta 3 Training Session with Erik Jacobs (Red Hat) from Apr 30 2015</p>","video_url":"https://www.youtube.com/watch?v=WYUsuHHDn2w","speakers":"Red Hat Developers","views":"303","likes":"2","video_thumb":"https://i.ytimg.com/vi/WYUsuHHDn2w/mqdefault.jpg","hours":"0","minutes":"59","seconds":"34","tags":["69","59","105","125","49"],"publish_date":"2015-04-30T18:19:25","path":"/video/youtube/WYUsuHHDn2w/"},{"title":"OpenShift Commons Briefings: Metering MicroServices on OpenShift with 6Fusion's Delano Seymour","description":"<p>OpenShift Commons Briefings: Metering MicroService on OpenShift with 6Fusion's Delano Seymour</p>","video_url":"https://www.youtube.com/watch?v=aTO4-OYme-Y","speakers":"Red Hat Developers","views":"227","likes":"1","video_thumb":"https://i.ytimg.com/vi/aTO4-OYme-Y/mqdefault.jpg","hours":"0","minutes":"29","seconds":"58","tags":["59","79","69","710","887"],"publish_date":"2015-05-15T16:21:43","path":"/video/youtube/aTO4-OYme-Y/"}]