[{"title":"JavaOne 2012: The Arquillian Universe","description":"<p>Arquillian is a revolutionary testing platform for Java and the JVM that enables developers to easily create and execute integration and functional tests for Java middleware, from Java EE and beyond.\n\nOne of Arquillian's strong points is its extensibility. Arquillian was built with the ability to change its default behavior via its powerful extension model as well as to grow past its original programming to take on the challenges of tomorrow.\n\nPresenter: Aslak Knutsen\n\nBio: Aslak Knutsen, the project lead of Arquillian, is a Senior Software Engineer at Red Hat JBoss Middleware. He's involved in projects such as Arquillian, ShrinkWrap, Weld and Seam 3, one of the founders of the JBoss Testing initiative and a speaker at major industry conferences including Devoxx, JavaOne, Jazoon, JFokus, and Geecon.</p>","video_url":"https://www.youtube.com/watch?v=h37Edg6O7MI","speakers":"Red Hat Developers","views":"2348","likes":"15","video_thumb":"https://i.ytimg.com/vi/h37Edg6O7MI/mqdefault.jpg","hours":"0","minutes":"24","seconds":"41","tags":["760","1292","756","205","1161","1066"],"publish_date":"2013-02-27T16:49:30","path":"/video/youtube/h37Edg6O7MI/"},{"title":"JavaOne 2012: OSGi in AS7","description":"<p>AS7 fully supports the OSGi 4.2 core specification which means that you can deploy your OSGi bundles straight into it!\n\nIn this slot David will talk about how you can use OSGi in AS7 and will show a demo of OSGi bundles running in the appserver.\n\nPresenter: David Bosschaert\n\nBio: David Bosschaert, Principal Software Engineer at Red Hat JBoss Middleware, spends the majority of his time on the JBoss OSGi framework, JBoss AS7 and other open source projects. He is also co-chair of the OSGi Enterprise Expert Group.</p>","video_url":"https://www.youtube.com/watch?v=iGTLMjGpstQ","speakers":"Red Hat Developers","views":"649","likes":"4","video_thumb":"https://i.ytimg.com/vi/iGTLMjGpstQ/mqdefault.jpg","hours":"0","minutes":"18","seconds":"41","tags":["884","1110","757","1066"],"publish_date":"2013-02-27T16:47:47","path":"/video/youtube/iGTLMjGpstQ/"},{"title":"Red Hat JBoss xPaaS services for OpenShift","description":"<p>Red Hat announces its vision for xPaaS -- platform as a service for the enterprise. For more information: http://red.ht/xpaas</p>","video_url":"https://www.youtube.com/watch?v=IkU_PQ_AnPc","speakers":"Red Hat Developers","views":"5802","likes":"17","video_thumb":"https://i.ytimg.com/vi/IkU_PQ_AnPc/mqdefault.jpg","hours":"0","minutes":"6","seconds":"22","tags":["425","1082","575","1251","69","1457"],"publish_date":"2013-09-24T14:01:07","path":"/video/youtube/IkU_PQ_AnPc/"},{"title":"JavaOne 2012: Mobile JSF with RichFaces","description":"<p>The mobile web is a hot topic; many developers are curious about how they can tap into this market while leveraging their existing skillset and technology investments.  The good news is that as a JSF developer, you can make your application mobile by taking advantage of the mobile compatible components and other framework improvements introduced in RichFaces 4.1.\n\nThe RichFaces \"Kitchensink\" quickstart will be used as a case study to demonstrate best practices in making RichFaces applications mobile compatible.  We will explain how to overcome obstacles of existing desktop-based frameworks (like JSF) by using capabilities available with HTML5.  Attendees will also learn about the mobile web's \"single page\" programming model and how they can convert any existing web app to work on mobile devices.\n\nThis presentation will leave you equipped to bring both new and existing RichFaces applications, to a mobile audience.  You'll have a firm understanding of the concerns to be addressed when developing for the mobile platform, and how Richfaces is equipping you to deal with those concerns.\n\nPresenter: Brian Leathem\n\nBio: Brian Leathem is a Senior Software Engineer at Red Hat JBoss Middleware, leading the RichFaces project. An early adopter of JavaEE 6 and the CDI programming model, Brian also is the Lead of the Seam Faces Module. Having been involved with Seam 3 from its early stages, Brian helped the project bridge framework gaps with CDI/JSF integration. A firm believer in the power of open standards, Brian is keen to help shape the evolution of the JSF standard, to be the tool developers need it to be.</p>","video_url":"https://www.youtube.com/watch?v=iPNTb_vEgs0","speakers":"Red Hat Developers","views":"2248","likes":"2","video_thumb":"https://i.ytimg.com/vi/iPNTb_vEgs0/mqdefault.jpg","hours":"0","minutes":"23","seconds":"23","tags":["795","1218","1312","1292","1066"],"publish_date":"2013-02-27T16:50:06","path":"/video/youtube/iPNTb_vEgs0/"},{"title":"JavaOne 2012: Zero to app in 30 minutes","description":"<p>In this session Pete will show you how to build a simple app, get it running on your mobile and deployed to the cloud, all in 30 minutes. He'll use JBoss AS, JBoss Developer Studio and Forge to create the application, and Arquillian to test it.\n\nPresenter: Pete Muir\n\nSince 2007, Pete Muir has been employed by Red Hat as a Principal Software Engineer, working on JBoss open source projects and representing Red Hat on JCP projects. He is the Spec Lead of JSR 346, Contexts and Dependency Injection for Java EE 1.1. He also works on Infinispan, an extremely scalable datastore and data grid, and serves as an Expert for the related specifications, JSR 107, JCACHE - Java Temporary Caching API, and JSR 347, Data Grids for the Java Platform. He is also a member of the Expert Group for JSR 346, Java EE 6; JSR 345, EJB 3.2; JSR 330, Dependency Injection for Java; and JSR 314, JavaServer Faces 2.0. Previously, he was the project lead for Seam and Weld, the Reference Implementation and TCK for JSR 299, Contexts and D ependency Injection for Java EE. Pete co-founded Arquillian, a test harness for Java application servers.</p>","video_url":"https://www.youtube.com/watch?v=ivSYnis_e1w","speakers":"Red Hat Developers","views":"8049","likes":"20","video_thumb":"https://i.ytimg.com/vi/ivSYnis_e1w/mqdefault.jpg","hours":"0","minutes":"24","seconds":"34","tags":["1242","1292","1066"],"publish_date":"2013-02-27T16:46:51","path":"/video/youtube/ivSYnis_e1w/"},{"title":"JavaOne 2012: Introduction to JBoss Developer Framework","description":"<p>You've heard about the JBoss Way, and you like what you see. The JBoss Developer Framework provides you with the toolkit to follow the JBoss Way and build your applications quickly, productively, and easily.\n\nBased on the Apache Deltaspike project, the industry standard for portable Java EE 6 extensions, the JBoss Developer Framework provides an excellent platform for building modern, mobile ready, cloud friendly applications. You can use JBoss Forge to create projects in a matter of minutes, and JBoss Developer Studio to craft your changes.\n\nPete and Jason will show you how to get started with Java EE using the JBoss Developer Framework, and then provide a deep dive into selected components.\n\nPresenter: Pete Muir\n\nBio: Since 2007, Pete Muir has been employed by Red Hat, Inc. as a Principal Software Engineer, working on JBoss open source projects and representing Red Hat on JCP projects. He is the Spec Lead of JSR 346, Contexts and Dependency Injection for Java EE 1.1. He also works on Infinispan, an extremely scalable datastore and data grid, and serves as an Expert for the related specifications, JSR 107, JCACHE - Java Temporary Caching API, and JSR 347, Data Grids for the Java Platform. He is also a member of the Expert Group for JSR 346, Java EE 6; JSR 345, EJB 3.2; JSR 330, Dependency Injection for Java; and JSR 314, JavaServer Faces 2.0. Previously, he was the project lead for Seam and Weld, the Reference Implementation and TCK for JSR 299, Contexts and Dependency Injection for Java EE. Pete co-founded Arquillian, a test harness for Java application servers.</p>","video_url":"https://www.youtube.com/watch?v=kEZ4rcUunxA","speakers":"Red Hat Developers","views":"4196","likes":"9","video_thumb":"https://i.ytimg.com/vi/kEZ4rcUunxA/mqdefault.jpg","hours":"0","minutes":"22","seconds":"11","tags":["1242","1292","894","1066"],"publish_date":"2013-02-27T16:48:06","path":"/video/youtube/kEZ4rcUunxA/"},{"title":"JavaOne 2012: Native Mobile Development with AeroGear, and Apache Cordova","description":"<p>There are some amazing mobile web applications out there, but what if your app needs to be in one of the appstores, or access the devices camera, or calendar? I guess your going to need to make a jump to full native development, and all the bagage that brings with it.\n\nOr do you?\n\nThis is where AeroGear, and hybrid application frameworks like Apache Cordova (formally PhoneGap) come in and really save the day! With Cordova you can leverage your existing web based skills, embracing all the latest JavaScript and HTML5 functionality, and turn it into a functional and beautiful native application.\n\nWe're going to take a quick tour of the AeroGear project and Cordova, creating a hybrid application based on some of our quickstarts. We'll be using JBoss Tools as we talk about accessing native features, considerations for cross device projects, and how to access external services.\n\nPresenter: Jay Balunas\n\nBio: Jay Balunas, principal software engineer at Red Hat, works as a Red Hat JBoss Middleware core developer and heads up their mobile development efforts as the AeroGear project lead. He is passionate about standards and is one of Red Hat's W3C representatives, and have been active in the Java Community Process (JCP) as a JavaServer Faces expert group member.\n\nHe was previously the RichFaces project lead, and has been involved with many other open source projects including jQuery, Forge, Seam, and Weld. Jay has been architecting and developing enterprise applications and projects for over fourteen years, specializing in mobile device integration, web tier frameworks, UI design, and integration.</p>","video_url":"https://www.youtube.com/watch?v=PyUR9zPIDig","speakers":"Red Hat Developers","views":"1034","likes":"5","video_thumb":"https://i.ytimg.com/vi/PyUR9zPIDig/mqdefault.jpg","hours":"0","minutes":"19","seconds":"28","tags":["1071","1292","719","736","1216","1066"],"publish_date":"2013-02-27T16:49:48","path":"/video/youtube/PyUR9zPIDig/"},{"title":"JavaOne 2012: CDI in the browser. Wait! What?","description":"<p>Starting with a working in-browser application, members of the Errai Development Team make short work of extending it to do more with CDI. In this live coding demo, see how easily you can take advantage of CDI in the browser. If you're already using CDI on the server side, don't miss this walkthrough of how to make the same code work for you in the browser. Not familiar with CDI yet? No problem! This quick session offers a ground-up tour of the fundamental building blocks of CDI, equally applicable to both client and server.\n\nPresenters: Jonathan Fuerth &Christian Sadilek\n\nBios: Jonathan Fuerth is a Senior Engineer at Red Hat JBoss Middleware and a core member of the Errai team. In his spare time, you will find Jonathan co-leading the Toronto Java Users Group (tjug.ca) and playing with the latest and greatest stuff in the Java ecosystem.\n\nChristian Sadilek is a Senior Software Engineer at Red Hat JBoss Middleware, and a core developer of the Errai framework. As a long-time Java EE developer, Christian's focus is on developer productivity, in particular for web application development.</p>","video_url":"https://www.youtube.com/watch?v=r3sbgCfP4AE","speakers":"Red Hat Developers","views":"462","likes":"2","video_thumb":"https://i.ytimg.com/vi/r3sbgCfP4AE/mqdefault.jpg","hours":"0","minutes":"14","seconds":"41","tags":["835","1143","821","1292","1066"],"publish_date":"2013-02-27T16:45:32","path":"/video/youtube/r3sbgCfP4AE/"},{"title":"JavaOne 2012: Today's Rapid Java EE Development: Live Coding from Scratch to Deployment","description":"<p>The myth of Java EE as a cumbersome platform is easily dispelled in this session, which aims to create a working application, from a blank repository to a live cloud deployment, in real time. It:\n\nCovers tools that bootstrap project creation, freeing you from mucking around with Maven POM boilerplate\nGenerates a domain model and reverse-engineers JPA entities from it\nAutomatically creates the scaffolding for tests that run in a real Java EE container, launched from the IDE\nPushes it all to production on a public site\nUsing a variety of projects from the JBoss Community adhering to and building upon open standards, this presentation can create real enterprise apps in the time it takes other sessions to click through some slides. Let's get building!\n\nPresenter: Andrew Rubinger\n\nBio: Andrew Rubinger is an advocate for and speaker on Testable Enterprise Java development, author of upcoming \"Continuous Enterprise Development in Java\" and \"Enterprise JavaBeans 3.1\" from O'Reilly Media. JBoss Core Developer and Technical Lead of the ShrinkWrap project. Proudly employed by JBoss / Red Hat.</p>","video_url":"https://www.youtube.com/watch?v=sg39ET_zoxM","speakers":"Red Hat Developers","views":"3533","likes":"13","video_thumb":"https://i.ytimg.com/vi/sg39ET_zoxM/mqdefault.jpg","hours":"0","minutes":"32","seconds":"21","tags":["726","205","1292","1057","1186","1066"],"publish_date":"2013-02-27T16:46:13","path":"/video/youtube/sg39ET_zoxM/"},{"title":"JavaOne 2012: The JBoss Data Grid, or Enterprise-grade Infinispan","description":"<p>In an increasing number of disciplines and industries, data volume and complexity has become both a challenge and an opportunity. Application developers are tasked with bridging the gap between challenge and opportunity and one tool in a developer's belt to help build that bridge is a data grid.\n\nRed Hat JBoss Data Grid - the supportable version of the Infinispan open source project - is a manageable, scalable, highly available, distributed, in-memory data store that lets you scale horizontally, based on memory and distribution across commodity hardware rather than relational database management system (RDBMS) licenses, database expertise or specialist hardware.\n\nManik Surtani will provide a high-level overview of Red Hat JBoss Data Grid, discussing its benefits, common use-cases, and specific features meant to address today's data challenges and opportunities.\n\nPresenter: Manik Surtani\n\nBio: Manik Surtani is a core R&D engineer at Red Hat JBoss Middleware. He is the founder of the Infinispan project, which he currently leads. He is also the spec lead of JSR 347 (Data Grids for the Java Platform), and represents Red Hat on the Expert Group of JSR 107 (Temporary caching for Java). His interests lie in cloud and distributed computing, big data and NoSQL, autonomous systems and highly available computing. He has a background in artificial intelligence and neural networks, highly available e-commerce systems and enterprise Java. Surtani is a strong proponent of open source development methodologies, ethos, and collaborative processes, and has been involved in open source since his first forays into computing.</p>","video_url":"https://www.youtube.com/watch?v=T1tsma_EL8g","speakers":"Red Hat Developers","views":"1958","likes":"14","video_thumb":"https://i.ytimg.com/vi/T1tsma_EL8g/mqdefault.jpg","hours":"0","minutes":"29","seconds":"0","tags":["1196","1074","936","1292","1066"],"publish_date":"2013-02-27T16:47:30","path":"/video/youtube/T1tsma_EL8g/"},{"title":"JavaOne 2012: Leveraging jQuery plugins to create JSF Components","description":"<p>JavaServer Faces provides application developers with a visual component model for building web applications, standardized as part of the Java EE specification. Component libraries such as RichFaces abstract away the javascript, allowing one to focus on building applications with a rich user experience without fiddling with complex javascript.\n\nHowever, if you want to provide your user with a rich web experience, and the functionality you need isn't provided by an existing JSF component library, you can quite easily leverage existing javascript libraries to create your own JSF components. jQuery plugins exist providing functionality in a number of areas. By wrapping these plugins as JSF components, you maintain the benefits of abstracting away the javascript in your application and encapsulating the behavior within the component.\n\nTogether, we'll take a look at creating custom JSF components using both the JSF 2 composite component approach, as well as with the RichFaces CDK, and demonstrate how to take advantage of the many existing jQuery plugins available, providing a rich experience in your web applications.\n\nPresenter: Brian Leathem\n\nBio: Brian Leathem is a Senior Software Engineer at Red Hat JBoss Middleware, leading the RichFaces project. An early adopter of JavaEE 6 and the CDI programming model, Brian also is the Lead of the Seam Faces Module. Having been involved with Seam 3 from its early stages, Brian helped the project bridge framework gaps with CDI/JSF integration. A firm believer in the power of open standards, Brian is keen to help shape the evolution of the JSF standard, to be the tool developers need it to be.</p>","video_url":"https://www.youtube.com/watch?v=ubxFMm0h4ws","speakers":"Red Hat Developers","views":"1115","likes":"3","video_thumb":"https://i.ytimg.com/vi/ubxFMm0h4ws/mqdefault.jpg","hours":"0","minutes":"22","seconds":"27","tags":["795","1146","1151","1292","1066"],"publish_date":"2013-02-27T16:49:05","path":"/video/youtube/ubxFMm0h4ws/"},{"title":"JavaOne 2012: Ike Eating Ice Cream Sandwich","description":"<p>In this session Karel will show you how to automate tests in cloud and mobile using application Pete has created. He'll use Arquillian, Arquillian Drone and Arquillian Android, together with Android SDK, real Android device and OpenShift.\n\nPresenter: Karel Piwko\n\nBio: Karel Piwko is a software engineer at Red Hat, Inc. since 2009, currently leading JBoss Web Framework Kit testing effort. He is actively participating in improving Java Enterprise applications testability, being involved in Arquillian testing platform, leading numerous extensions like Arquillian Drone and Arquillian Android. He is also leading ShrinkWrap Resolver effort, allowing users to easily access Maven world from Java code. He focuses on AJAX, Web User Interface and mobile testing. Before joining web interface world, he was working with XML databases.</p>","video_url":"https://www.youtube.com/watch?v=ya2RFeY6OVk","speakers":"Red Hat Developers","views":"79","likes":"0","video_thumb":"https://i.ytimg.com/vi/ya2RFeY6OVk/mqdefault.jpg","hours":"0","minutes":"24","seconds":"42","tags":["1164","1292","1031","755","838","1066"],"publish_date":"2013-02-27T16:45:14","path":"/video/youtube/ya2RFeY6OVk/"},{"title":"JavaOne 2012: Polyglot Something Something","description":"<p>JBoss is more than Java these days. The JVM is an excellent target for many languages, including Ruby, Clojure, Scala and Javascript.\n\nLearn about TorqueBox, Immutant, Escalante and other languages on JBoss.\n\nPresenter: Bob McWhirter\n\nBio: Bob McWhirter is Director of Polyglot and a JBoss Fellow. He founded Drools (with Mark Proctor) and TorqueBox. He oversees the efforts of everything-but-Java on within JBoss.</p>","video_url":"https://www.youtube.com/watch?v=ymmngl5y3Ww","speakers":"Red Hat Developers","views":"115","likes":"3","video_thumb":"https://i.ytimg.com/vi/ymmngl5y3Ww/mqdefault.jpg","hours":"0","minutes":"15","seconds":"21","tags":["782","1292","1161","1066"],"publish_date":"2013-02-27T16:46:01","path":"/video/youtube/ymmngl5y3Ww/"},{"title":"Intro to OpenShift Express (Mac)","description":"<p>This video demonstrates how to install the OpenShift Express client utilities on a Mac. Furthermore, it provides a walk through of signing up for an RHN account using the OpenShift website and details steps to allow a user to create their first express domain.\n\nPlease go to openshift.redhat.com for more details.</p>","video_url":"https://www.youtube.com/watch?v=YolOvuIehI0","speakers":"Red Hat Developers","views":"606","likes":"2","video_thumb":"https://i.ytimg.com/vi/YolOvuIehI0/mqdefault.jpg","hours":"0","minutes":"3","seconds":"8","tags":["979","19","1451","59","948","39","1059"],"publish_date":"2011-10-21T17:45:21","path":"/video/youtube/YolOvuIehI0/"},{"title":"Inna Kuznetsova keynote (2011 Red Hat Summit & JBoss World)","description":"<p>Inna Kuznetsova, vice president of marketing and sales enablement of systems software at IBM, speaks at the 2011 Red Hat Summit and JBossWorld.\n\nKuznetsova talks extensively about the 100 year anniversary of IBM, and the ten-year anniversary of their partnership with Red Hat. From Watson Scientific Computing Lab (established at Columbia University in 1944) to the open source contributions made in more recent decades, IBM encourages the growth of communities of innovation.\n\nShe emphasizes that IBM's longevity is not just because of profitable technology, but also their concern for fairness to employees and interest in developing technologies that are beneficial for society--including their support of open source and Linux.\n\nShe also talks about the Watson AI, IBM's involvement in the Apache Foundation, and the first IBM hypervisor (for system 360, built in 1967). That early hypervisor was just the beginning. \n\nKuznetsova discusses at length the evolution of open virtualization, the use of virtualization (like KVM), and the importance of openness in maintaining virtualization's low cost, robust behavior, and rapid rate of innovation.  She explores the market need for virtualization today, and the expectations for the technology industry of the future.\n\nSee more videos from the 2011 Red Hat Summit and JBossWorld:\nhttp://www.youtube.com/user/RedHatVideos#g/c/995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=-dguWDSbrhk","speakers":"Red Hat Developers","views":"2641","likes":"6","video_thumb":"https://i.ytimg.com/vi/-dguWDSbrhk/mqdefault.jpg","hours":"0","minutes":"25","seconds":"34","tags":["425","425","699","1122","859","868","155","1079","1171","1367","805","932","1039","1433","1202","1320","1028","1438","39","59","808","849","876","838"],"publish_date":"2011-08-02T20:29:31","path":"/video/youtube/-dguWDSbrhk/"},{"title":"Simplifying JBoss administration","description":"<p>JBoss ON experts Chris Morgan (senior product marketing manager) and Greg Hinkel (engineering team lead) discuss the value of management tools and features from Red Hat and JBoss.  Screenshots further demonstrate the options and impact of technologies like Jopr and other open source applications, projects, and toolkits. \n\n\"At the end of the day, you still have Red Hat behind the name, and you have a fully supported platform that can integrate all these different parts... in a way that gives you overall added value that's greater than the sum of its parts.\"\n-- Greg Hinkel\n\nSee more Red Hat videos:\nhttp://www.redhat.com/videos/</p>","video_url":"https://www.youtube.com/watch?v=0IEoFgExOYk","speakers":"Red Hat Developers","views":"1886","likes":"3","video_thumb":"https://i.ytimg.com/vi/0IEoFgExOYk/mqdefault.jpg","hours":"0","minutes":"3","seconds":"25","tags":["89","425","155","59","808","1144","625","1079","990","834","993","1329","890","728","1386","79"],"publish_date":"2009-03-27T15:30:07","path":"/video/youtube/0IEoFgExOYk/"},{"title":"General Hugh Shelton keynote (2011 Red Hat Summit & JBoss World)","description":"<p>In this opening keynote for Red Hat Summit and JBoss World 2011, hear General Hugh Shelton (retired), Chairman of the Board of Red Hat, speak about the role of open source and his introduction to open source--and his involvement in the technology industry through the Red Hat board.\n\nGen Shelton gives a delightful talk, peppered with stories about the role of open source in the military, and in the world--sometimes in ways you might never expect.\n\n\"I'd like to join the army that is developing --the open source army, if you will--that is going to mark across a very fierce battlefield and fight and WIN because it's the right thing to do. That's Red Hat. That's open source.\"\n-- General Hugh Shelton\n\nSee more videos from the 2011 Red Hat Summit and JBossWorld:\nhttp://www.youtube.com/user/RedHatVideos#g/c/995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=1uSACosUaFw","speakers":"Red Hat Developers","views":"1369","likes":"11","video_thumb":"https://i.ytimg.com/vi/1uSACosUaFw/mqdefault.jpg","hours":"0","minutes":"8","seconds":"12","tags":["425","425","699","1122","859","868","1171","1367","805","838","970","155","59","808","1344","1025","830","977","1141","832","635","1375"],"publish_date":"2011-08-01T18:52:08","path":"/video/youtube/1uSACosUaFw/"},{"title":"Brian Stevens keynote (2011 Red Hat Summit & JBoss World)","description":"<p>Red Hat Chief Technical Officer and Vice President Brian Stevens gives a keynote at the 2011 Red Hat Summit and JBossWorld.\n\nStevens discusses his ten-year tenure at Red Hat and the inspiration he finds in today's work--as much or more than he did when he joined the company. He begins with a look at the proprietary architectures of the past--expensive hardware that was difficult and expensive to manage and maintain, and hard to move away from when technologies improved.\n\nToday's technology outlook is very different. Flexible, open stacks that allow for vendor choice are replacing sunset old hardware and giving enterprise users the ability to take advantage of the newest developments.  \n\nStevens discusses the implementation of cloud technology and the open source infrastructure that runs many of the major deployments in business use today. He talks about the benefits of foundational change that are creeping in to even the most proprietary companies, and reviews some of the technical tools we use today, including Linux Torvalds' git and new Red Hat offerings like OpenShift.  Video presentations allow him to share the experiences of expert Red Hat developers and product line managers, as well as partners and customers who have built their business on Red Hat. \n\nSee more videos from the 2011 Red Hat Summit and JBossWorld:\nhttp://www.youtube.com/user/RedHatVideos#g/c/995CD1141C3330D5\n\nFind out more about OpenShift:\nhttp://www.openshift.com</p>","video_url":"https://www.youtube.com/watch?v=3_ob3Pq7pyw","speakers":"Red Hat Developers","views":"852","likes":"8","video_thumb":"https://i.ytimg.com/vi/3_ob3Pq7pyw/mqdefault.jpg","hours":"0","minutes":"35","seconds":"31","tags":["425","425","699","1122","1171","1367","805","932","868","859","155","1079","59","838","876","796","873","79","1260"],"publish_date":"2011-08-02T20:54:55","path":"/video/youtube/3_ob3Pq7pyw/"},{"title":"2012 Summit Promo","description":"<p>Transform with Red Hat this June in Boston at the 2012 Red Hat Summit and JBoss World. Hear all about the value of learning, networking and experiencing the full potential of open source in the enterprise from past attendees and participants.\n\nLearn more: www.redhat.com/summit</p>","video_url":"https://www.youtube.com/watch?v=34pbnnJcpOU","speakers":"Red Hat Developers","views":"634","likes":"4","video_thumb":"https://i.ytimg.com/vi/34pbnnJcpOU/mqdefault.jpg","hours":"0","minutes":"1","seconds":"11","tags":["425","89","699"],"publish_date":"2012-06-12T14:09:19","path":"/video/youtube/34pbnnJcpOU/"},{"title":"Affordable - JBoss Enterprise SOA Platform 5","description":"<p>With JBoss, your SOA solution is delivered via the subscription model, providing predictable costs that you can budget for. So you can put your resources into the things that make your business special. And that means you're in control.\n\nFind out more about JBoss SOA:\nhttp://www.jboss.com/resources/soa/\nhttp://www.jboss.com/products/platforms/soa/</p>","video_url":"https://www.youtube.com/watch?v=4D1hXlI99k8","speakers":"Red Hat Developers","views":"1348","likes":"6","video_thumb":"https://i.ytimg.com/vi/4D1hXlI99k8/mqdefault.jpg","hours":"0","minutes":"0","seconds":"51","tags":["1117","1337","89","425","59","808","1089","155","575","941","405","1079"],"publish_date":"2010-03-22T15:21:52","path":"/video/youtube/4D1hXlI99k8/"},{"title":"John Newton keynote: Content - A Story (2011 Red Hat Summit & JBoss World)","description":"<p>John Newton, chief technology officer and chairman of Alfresco, speaks at the 2011 Red Hat Summit and JBossWorld.\n\nNewton talks about the user's perspective on modern technologies, including cloud and virtualization. He begins by discussing the old methods of control and development in technology, controlled by large IT firms that gave customers what they needed, but not what they wanted. Though it was functional, user interfaces were often clumsy and hard to understand, and offerings were limited and expensive.\n\nAdvances in hardware and changing user demands have changed this landscape dramatically. Use of the Internet, mobile computing, and social media  has democratized and expanded, while the cost of providing these services has gone down. And people grew accustomed to these tools, and needed to bring them into the workplace.\n\nNewton describes how these emerging systems of engagement have changed the workplace IT strategy.  He touches on the benefits and dangers of these tools, and the widening audiences that can now participate in IT--even if they don't know that's what they're doing.\n\nSee more videos from the 2011 Red Hat Summit and JBossWorld:\nhttp://www.youtube.com/user/RedHatVideos#g/c/995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=4jYChbK9pxA","speakers":"Red Hat Developers","views":"223","likes":"1","video_thumb":"https://i.ytimg.com/vi/4jYChbK9pxA/mqdefault.jpg","hours":"0","minutes":"27","seconds":"22","tags":["425","425","699","1122","859","868","155","1079","59","808","1171","1367","805","932","1140","723","838","876","405"],"publish_date":"2011-08-02T20:34:01","path":"/video/youtube/4jYChbK9pxA/"},{"title":"JBoss Enterprise Middleware overview","description":"<p>In this video from the Red Hat Stories Technologies series,  Craig Muzilla, vice president of the Middleware Business, discusses the growth and development of the JBoss Enterprise Middleware suites and technologies.  He explains how Red Hat solutions extend from the middleware layer and further allow hardware flexibility and great application choice, with excellent long-term value.\n\n\"You can configure JBoss technology to the needs that you have in an organization. You're not constrained and restricted.\"\n- Craig Muzilla\n\nSee more of the Red Hat Stories:\nhttp://www.redhat.com/stories/</p>","video_url":"https://www.youtube.com/watch?v=65BrI_US7SI","speakers":"Red Hat Developers","views":"1812","likes":"2","video_thumb":"https://i.ytimg.com/vi/65BrI_US7SI/mqdefault.jpg","hours":"0","minutes":"2","seconds":"40","tags":["425","425","59","808","876","155","1079","635","967","89","870","79","1260","1011","941","749","1001"],"publish_date":"2009-08-12T19:59:14","path":"/video/youtube/65BrI_US7SI/"},{"title":"2012 Red Hat Summit: Tuning & Benchmarking JBoss Enterprise Application Platform Session Clustering","description":"<p>In this interactive, hands-on session led by Red Hat's Bela Ban, we will look at session clustering in JBoss Enterprise Application Platform and demonstrate how to tune it to get maximum performance and scalability.\n\nTo compare the effects of the various tuning steps on performance, we will present a typical high-volume, web-based application that uses Apache and mod_cluster to connect to a cluster of JBoss Enterprise Application Platform instances.\n\nFirst, we will look at the Apache and JBoss Enterprise Application Platform configurations. We will discuss how to tune connection pools and other parameters, and then tune the HTTP session clustering configuration in JBoss Enterprise Application Platform (e.g., replication versus distribution).\n\nIn the next step, we will take a look at how Infinispan, which handles session clustering, can be configured to increase performance and scalability. We will then step into the basement (JGroups) and show what tuning possibilities are lurking there.\n\nAttendees will walk away with useful tips and tricks to make their JBoss Enterprise Application Platform clusters faster. (Cursory knowledge of the JBoss Enterprise Application Platform is beneficial but not required.)</p>","video_url":"https://www.youtube.com/watch?v=6ZwL2sgKR3w","speakers":"Red Hat Developers","views":"2223","likes":"9","video_thumb":"https://i.ytimg.com/vi/6ZwL2sgKR3w/mqdefault.jpg","hours":"1","minutes":"0","seconds":"12","tags":["772","425","1385","842","1127","936"],"publish_date":"2012-07-20T16:03:45","path":"/video/youtube/6ZwL2sgKR3w/"},{"title":"American Psychological Association: A Red Hat Customer Success Story","description":"<p>http://www.youtube.com/watch?v=7M7HrnRKs2M\r\nBeverly Jamison, Senior director of IT, architecture, and publishing solutions for the American Psychological Association (APA), discusses the technology that powers the internationally known PsycINFO databse--supporting 1.5 million hits a day. Uptime requirements are high, and supported Red Hat Enterprise Linux and JBoss Enterprise Middleware systems replaced old UNIX architectures to keep the APA up and running.\r\n\r\nAbroo Shah, Director of applications for the APA, and Joe Dickman, Senior vice president of Vizuri, discuss the implementation of the a service-oriented architecture, where legacy systems and siloed software needed to be integrated with a robust middleware technology. \r\n\r\n\"The use of JBoss within the APA would increase as we introduce more services and as more services are utilized by more applications.\"\r\n-- Abroo Shah, APA\r\n\r\nJBoss was also used to provide messaging and clustering. Vizuri, a Red Hat partner, helped the APA design and implement the JBoss portal, and mentored the existing IT team. \r\n\r\n\"What Red Hat provides to my customers is sustainability.\"\r\n-- Joe Dickman, Vizuri\r\n\r\nSee more Red Hat customer success stories:\r\nhttp://www.youtube.com/playlist?list=PLF466E1F42D1ADABC&feature=plcp</p>","video_url":"https://www.youtube.com/watch?v=7M7HrnRKs2M","speakers":"Red Hat Developers","views":"583","likes":"4","video_thumb":"https://i.ytimg.com/vi/7M7HrnRKs2M/mqdefault.jpg","hours":"0","minutes":"3","seconds":"54","tags":["732","425","425","929","155","89","1079","1338","1117","255","840","1426","776","713","1383","820","1436","1237","1139","863"],"publish_date":"2012-02-17T16:24:16","path":"/video/youtube/7M7HrnRKs2M/"},{"title":"Steve Dietch keynote: Build and manage clouds (2011 Red Hat Summit & JBoss World)","description":"<p>Steve Dietch, vice president of marketing for cloud solutions and infrastructure at HP, gives a talk at the 2011 Red Hat Summit and JBossWorld.\n\nDietch speaks in-depth about today's popular technology--cloud. He talks about how cloud adoption has grown faster than IT departments have expected, what issues this creates, and what methods can help customers adapt.\n\nHe discusses the ways in which cloud technology can be applied--today and going forward--and how public, private, and hybrid approaches can be combined to deliver unified services that allow for a wide range of customer choice--in applications, in hypervisor, and in hardware. \n\nHe also addresses some of the concerns surrounding this rapid adoption, and how a complete, open, and integrated system can help enterprises avoid cloud sprawl and vendor lock-in, while gaining value, improving cost, and increasing performance and flexibility. \n\nDietch also talks extensively about the partnership between Red Hat and HP and the enterprise offerings they develop and support collaboratively and completely.\n \nSee more videos from the 2011 Red Hat Summit and JBossWorld:\nhttp://www.youtube.com/user/RedHatVideos#g/c/995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=8HRMGEi-s4A","speakers":"Red Hat Developers","views":"474","likes":"2","video_thumb":"https://i.ytimg.com/vi/8HRMGEi-s4A/mqdefault.jpg","hours":"0","minutes":"20","seconds":"24","tags":["425","425","699","1122","859","868","155","59","808","1079","1171","1367","805","932","1377","1010","465","838"],"publish_date":"2011-08-02T16:06:11","path":"/video/youtube/8HRMGEi-s4A/"},{"title":"Lew Tucker keynote: Cloud computing with Red Hat & Cisco (2011 Red Hat Summit & JBoss World)","description":"<p>Lew Tucker, chief technology officer for cloud at Cisco, speaks at the 2011 Red Hat Summit and JBossWorld.\n\nTucker speaks about the partnership between Cisco and Red Hat, and the growing applications of software-as-a-service (SaaS) that come from this collaborative relationship.\n\nThe movement of technology to a service-oriented approach is a major shift in the industry, particularly for start-ups and smaller enterprises, who take a pay-as-you-go approach to more efficiently use their capital. But it's not just new and small companies that need the ability to flexibly and quickly handle gigantic amounts of information--every enterprise must be able to provide customers with the tools and service they now expect.  Thus, the cloud.\n\nTucker explains that cloud technologies allow customers to flexibly retain control of their software resources through economies of scale, multi-tenancy, and reliable cost reduction. He touches on Moore's Law--the idea that hardware technology will continue to advance--and discusses how this will allow us to continue to scale to meet growing demand for these services.\n\nTucker touches on the needs of specific industries, including healthcare, services, banking, and gaming, and how the new architectural models can meet and exceed these demands.</p>","video_url":"https://www.youtube.com/watch?v=8mlXKzBF2qA","speakers":"Red Hat Developers","views":"168","likes":"1","video_thumb":"https://i.ytimg.com/vi/8mlXKzBF2qA/mqdefault.jpg","hours":"0","minutes":"20","seconds":"22","tags":["425","425","699","1122","155","1079","838","1319","1171","1367","805","932","1182","837","873","1319","69","1027"],"publish_date":"2011-08-02T20:44:22","path":"/video/youtube/8mlXKzBF2qA/"},{"title":"Craig Muzilla keynote - JBoss Everywhere: Better for the Enterprise. Ready for the Cloud.","description":"<p>The next generation computing platform will be driven by the rapidly growing proliferation of multi-core computing mobile devices, where everything is connected and where the elastic capabilities of the cloud are pervasive and required.\n\nOur live demonstration includes multiple servers, workstations and mobile devices.  We setup a network using equipment you can purchase at your local electronics store and built a mini-datacenter for the stage.   We required WIFI connectivity, internet access, a live Twitter stream, audience participation and even managed to avoid system failure while \"pulling the plug\" on one of our servers.   In short, we pulled off something miraculous, a maximum risk, live demonstration and lived to tell (actually tweet) about it!</p>","video_url":"https://www.youtube.com/watch?v=9c-g7UxT0nk","speakers":"Red Hat Developers","views":"432","likes":"0","video_thumb":"https://i.ytimg.com/vi/9c-g7UxT0nk/mqdefault.jpg","hours":"0","minutes":"58","seconds":"49","tags":["425","425","59","808","89","595","705","838","839"],"publish_date":"2011-08-31T19:01:37","path":"/video/youtube/9c-g7UxT0nk/"},{"title":"JUDCon 2012 - Pages from the Bad Day at Work Diary (Tattletale)","description":"<p>A JUDCon 2012 session presented by Jesper Pedersen\n\nA pile of JARs (eh, what ?) files, strange XML files, .WARs (must be a tribute to Edwin Starr), and a ton of other stuff thrown together inside a so-called EAR file. What does van Gogh have to do with pushing a button in a web ui ?\n\nOh, great - and it didn't even work, sigh, why is it only 9.05 am?\"\n\nSound familiar? Or are your co-workers unable to assemble an enterprise application in the right way or even understand the difference between API and implementation?\nOr is it that you - if you really admit it - want to become better at getting an overview of entire applications or even complex servers?\n\nCome and learn what Tattletale can do for you, how you quicker get your enterprise application up and running on JBoss Application Server 7, and an idea of the cool features to come.</p>","video_url":"https://www.youtube.com/watch?v=9GdNN5VrmG0","speakers":"Red Hat Developers","views":"401","likes":"3","video_thumb":"https://i.ytimg.com/vi/9GdNN5VrmG0/mqdefault.jpg","hours":"0","minutes":"36","seconds":"19","tags":["425","1157","706","1131","1396","89","747"],"publish_date":"2012-10-12T21:12:25","path":"/video/youtube/9GdNN5VrmG0/"},{"title":"Infosys Finacle Lite powered by Red Hat Enterprise Linux and Jboss Middleware","description":"<p>Leading Core Banking Solution from Infosys featuring in Gartner Magic Quadrant - Finacle Lite is now powered by Red Hat Enterprise Linux and JBoss Enterprise Middleware.\n\nFinacle Lite offers a core banking solution specifically designed for Tier 2 Banks, Cooperative Banks & Credit Unions worldwide. The solution is a fully integrated, pre-configured \"Bank-in-a-Box\" powered by Red Hat Enterprise Linux and JBoss Enterprise Middleware designed for extremely quick deployment automating business processes across retail,wholesale, payments and services modules.\n\nFinacle Lite is available either as software as service (SaaS) or for on-premise deployments deployed universally on Red Hat Enterprise Linux and JBoss Enterprise Middleware. \n\nThis video helps in understanding why Infosys chose open source based Red Hat Enterprise Linux and JBoss Enterprise Middleware Platforms for their state-of-the-art core banking solution offering, Finacle Lite, to address the business and technology challenges faced by banks worldwide. This also address the overall benefits of running Finacle Lite on Red Hat Enterprise Linux and JBoss Middleware Platforms from various dimensions including TCO, scalability and performance.</p>","video_url":"https://www.youtube.com/watch?v=9lb89mYoy9A","speakers":"Red Hat Developers","views":"1902","likes":"5","video_thumb":"https://i.ytimg.com/vi/9lb89mYoy9A/mqdefault.jpg","hours":"0","minutes":"3","seconds":"0","tags":["960","961","1038","1037","575","1079","770","1319"],"publish_date":"2013-01-10T21:10:49","path":"/video/youtube/9lb89mYoy9A/"},{"title":"Enabling JBoss for operations","description":"<p>Chris Morgan, senior product marketing manager at JBoss, explains how JBoss Operations Network (JBoss ON) makes managing applications simpler.\n\nLike a modern car dashboard, JBoss ON provides an integrated, easy-to-use collection of functional tools. \n\nAnd it's open source. Like Red Hat Enterprise Linux and Fedora, JBoss ON has a community version, Jopr, that provides bleeding-edge technology and the breeding ground for tomorrow's JBoss ON technologies.\n\n\"Operations Network brings to life what's going on with JBoss.\"\n-- Chris Morgan\n\nSee more Red Hat videos:\nhttp://www.redhat.com/videos/</p>","video_url":"https://www.youtube.com/watch?v=c8XzDZD-RG8","speakers":"Red Hat Developers","views":"1301","likes":"3","video_thumb":"https://i.ytimg.com/vi/c8XzDZD-RG8/mqdefault.jpg","hours":"0","minutes":"3","seconds":"9","tags":["89","425","155","59","808","39","1142","9","575","955","745","1386","1084","1084","862","834"],"publish_date":"2009-03-27T15:25:06","path":"/video/youtube/c8XzDZD-RG8/"},{"title":"2012 Red Hat Summit: Brian Stevens, Red Hat keynote","description":"<p>In this keynote from the 2012 Red Hat Summit and JBoss World, Brian Stevens, chief technology officer and vice president of engineering at Red Hat, shares our technology roadmap and clarifies the commitment to fueling our customers' enterprises and helping everyone innovate to meet our cumulative goals and challenges.\n\nIn a talk studded with supporting video--from Facebook, Rackspace, Nicera, and 10gen--Stevens discusses the growth of data and resource needs, and the changing systems and standards that must continue to develop to support it. \n\nStandard, open operating systems like Red Hat Enterprise Linux on commodity hardware deployed as nodes create the foundation for flexible computing. Projects like Hadoop and OpenStack create technology and standards that make it possible to move workloads and consume data where and when its needed.\n\nThe evolution of software-defined networking creates a common set of tools and templates that can apply to any system, whether it's in a public, private, or hybrid cloud. Open standards allow applications to be shared, and common tools, interfaces, and management mean that systems can work together.\n\nA best-of-breed toolset is available in OpenShift, the  cloud platform-as-a-service (PaaS) offering from Red Hat that includes cutting-edge resources like MongoDB and more.\n\nSystems like this--and standards like those created in projects like OpenShift--make it possible for all of us to do more with less, and use the reclaimed resources to power the next generation of innovation.\n\nWatch more 2012 Red Hat Summit and JBoss World videos:\nhttp://www.youtube.com/playlist?list=PL995CD1141C3330D5&feature=plcp</p>","video_url":"https://www.youtube.com/watch?v=DDdiS6pvYJg","speakers":"Red Hat Developers","views":"2097","likes":"10","video_thumb":"https://i.ytimg.com/vi/DDdiS6pvYJg/mqdefault.jpg","hours":"0","minutes":"35","seconds":"30","tags":["706","425","425","699","793","796","873","1171","838","777","1380","738","953","1271","704","1223","1233","1459","59","575"],"publish_date":"2012-06-28T17:30:28","path":"/video/youtube/DDdiS6pvYJg/"},{"title":"The Intelligent, Integrated Shipping Company: JBoss Enterprise Business Rules Management System","description":"<p>Shipping companies around the world are challenged to optimize their processes in a rapidly changing business environment.\n\nThis fun, easy-to-understand video illustrates how the combined business rules, business process and complex event processing capabilities of JBoss Enterprise BRMS can help shipping companies become intelligent, integrated enterprises.</p>","video_url":"https://www.youtube.com/watch?v=dkL_ltHeJ5s","speakers":"Red Hat Developers","views":"3906","likes":"27","video_thumb":"https://i.ytimg.com/vi/dkL_ltHeJ5s/mqdefault.jpg","hours":"0","minutes":"2","seconds":"55","tags":["89","799","315","813","807","810","855","425","1347"],"publish_date":"2012-06-25T21:35:34","path":"/video/youtube/dkL_ltHeJ5s/"},{"title":"What's on Brian's mind? - Opening the cloud","description":"<p>Red Hat CTO Brian Stevens discusses the barriers and choices that exist for enterprise customers investing in cloud. He discusses Red Hat aims and industry standards, and why open source will greatly affect the way cloud technology matures.\n\nVideo was shot at the 2009 Red Hat Summit and JBoss World in Chicago, Illinois.\n\nFind out more about Red Hat cloud technologies:\nhttp://www.redhat.com/solutions/cloud/\n\nFind out more about the Red Hat Summit and JBoss World:\nhttp://www.redhat.com/summit/</p>","video_url":"https://www.youtube.com/watch?v=DnUCYkW5OMs","speakers":"Red Hat Developers","views":"381","likes":"1","video_thumb":"https://i.ytimg.com/vi/DnUCYkW5OMs/mqdefault.jpg","hours":"0","minutes":"1","seconds":"55","tags":["796","425","839","838","876","155","1297","1086","859","966","873"],"publish_date":"2009-10-16T20:09:42","path":"/video/youtube/DnUCYkW5OMs/"},{"title":"2012 Red Hat Summit: Jim Whitehurst, Red Hat Keynote","description":"<p>CEO of Red Hat Jim Whitehurst gives the opening keynote at the 2012 Red Hat Summit and JBoss World.\n\nWhitehurst welcomed the crowd warmly, noting that the community of contributors, users, partners, and technologists are the backbone behind Red Hat and Linux and open source success.\n\nHe continued on to talk about the economy and information evolutions of today, comparing them to the revolutions in industries and ages past--agriculture, industrialization, banking.\n\nWhitehurst emphasized the transition from physical to informational assets for these institutions--and compared this to the changes in IT infrastructure and the datacenter. \n\nAs our need for data storage and manipulation grows, as the tools with which to handle this data get more and more complex. Improving our technology foundations and eliminating transaction costs means we can do more, and leaves admins and developers free to innovate instead of manage. \n\nEliminating transaction costs has also allowed for a boom in development--rapid iteration without the need for external investment (or approval). You no longer have to wait to debut the next big idea--it's as simple as logging into the cloud or offering your new app in the app store.\n\nThe role that standards and standards-sharing companies will play in this new information economy is critical. Open source is now mainstream, and Red Hat--a now billion-dollar company in this space--is positioned to connect communities and drive innovation for the next generation of technology. \n\nThere is no time to rest. The paradigms shift beneath our feet and we're on to the next adventure. Big data, cloud, and virtualization bring moreradical change, and the beyond-slow pace of proprietary competitors leaves Linux and open source standardization at the forefront of technology today. And Whitehurst, a self-confessed geek among other geeks at Red Hat, finds that exciting.  \n\nSee more speaker and session videos from the 2012 Red Hat Summit and JBoss World:\nhttp://www.youtube.com/playlist?list=PL995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=Edd5YfIWjAk","speakers":"Red Hat Developers","views":"2661","likes":"29","video_thumb":"https://i.ytimg.com/vi/Edd5YfIWjAk/mqdefault.jpg","hours":"0","minutes":"34","seconds":"45","tags":["1297","425","1086","1133","1135","846","1171","706","838","876","852","850","881","777","738"],"publish_date":"2012-06-27T11:47:00","path":"/video/youtube/Edd5YfIWjAk/"},{"title":"2012 Red Hat Summit: New & More Effective Management for JBoss Enterprise Middleware","description":"<p>Have unplanned configuration changes ever caused problems for your production servers? Would you like to automate a response to unexpected performance or availability changes? Do you want to simplify the lifecycle management of JBoss Enterprise Middleware applications and services deployed across large-scale datacenters?\n\nUp to 75% of an application's total cost of ownership (TCO) occurs post development, once in production. Independent studies have shown that JBoss Managed offerings (a JBoss product managed by JBoss Operations Network) significantly reduce the maintenance costs and support burden traditionally associated with middleware management.\n\nThis session, Red Hat's Alan Santos and Charles Crouch will provide technical, in-depth coverage of new automation, deployment, and configuration features available for all JBoss Managed products that further reduce ongoing management costs.</p>","video_url":"https://www.youtube.com/watch?v=F5njXNm48Ws","speakers":"Red Hat Developers","views":"888","likes":"4","video_thumb":"https://i.ytimg.com/vi/F5njXNm48Ws/mqdefault.jpg","hours":"0","minutes":"57","seconds":"35","tags":["703","773","711"],"publish_date":"2012-07-13T16:29:24","path":"/video/youtube/F5njXNm48Ws/"},{"title":"tw telecom: How to increase productivity & performance with Red Hat JBoss Middleware","description":"<p>tw telecom has been able to significantly reduce the time it takes to provision new services for its customers, has improved the productivity of internal developers and reduced costs by unifying on a platform for all activation domain systems.</p>","video_url":"https://www.youtube.com/watch?v=fnEJaH9XGys","speakers":"Red Hat Developers","views":"876","likes":"1","video_thumb":"https://i.ytimg.com/vi/fnEJaH9XGys/mqdefault.jpg","hours":"0","minutes":"1","seconds":"39","tags":["1399","1281","1422","1293","89","1079","425"],"publish_date":"2013-11-25T14:13:51","path":"/video/youtube/fnEJaH9XGys/"},{"title":"Roche relies on Red Hat","description":"<p>2013 Red Hat Innovation Award Winner: Superior Alternatives\n\nThe European research-based healthcare company needed to revamp its middleware platform infrastructure for shared environments worldwide. Roche looked to open source technology as the foundation for its migration. Red Hat JBoss Enterprise Application Platform, Red Hat JBoss Data Services, and Red Hat JBoss Operations Network has provided the framework for Roche to drastically improve its application delivery time from three weeks to three days.An annual award competition, the Red Hat Innovation Awards celebrate the innovations powering the future of technology for organizations globally.\n\nLearn more at http://www.redhat.com/innovationconnection</p>","video_url":"https://www.youtube.com/watch?v=gjRGHarnCL0","speakers":"Red Hat Developers","views":"1712","likes":"5","video_thumb":"https://i.ytimg.com/vi/gjRGHarnCL0/mqdefault.jpg","hours":"0","minutes":"1","seconds":"52","tags":["425","699","707","852","1315"],"publish_date":"2013-07-12T15:33:54","path":"/video/youtube/gjRGHarnCL0/"},{"title":"2012 Red Hat Summit: Part 2, Red Hat Enterprise Linux Roadmap","description":"<p>This is part 2 of a 'Best of' session with Tim Burke, vice president of Linux Engineering from Red Hat, at the 2012 Red Hat Summit and JBoss World. You can see part 1 here: http://www.youtube.com/watch?v=yhQIVXrCd68&list=PL995CD1141C3330D5&index=16&feature=plpp_video\n\nTim Burke, vice president of Linux Engineering at Red Hat, briefly summarizes the first half's content, then has a team of engineering development managers highlight their technology area and key initiatives. They also discuss emerging technologies targeted for delivery in future releases. \n\nAreas they discuss in this part include:\n\n- filesystem\n- base OS commands and util\n- security\n- desktop features\n- developer tool features\n\nWatch part 1 of this session video:\nhttp://www.youtube.com/watch?v=yhQIVXrCd68&list=PL995CD1141C3330D5&index=16&feature=plpp_video\n\nWatch more 2012 Red Hat Summit and JBoss World videos:\nhttp://www.youtube.com/playlist?list=PL995CD1141C3330D5&feature=plcp</p>","video_url":"https://www.youtube.com/watch?v=H-cDorXHO5U","speakers":"Red Hat Developers","views":"5160","likes":"15","video_thumb":"https://i.ytimg.com/vi/H-cDorXHO5U/mqdefault.jpg","hours":"0","minutes":"55","seconds":"42","tags":["1404","803","425","425","699","706","575","155","1314","1308","1307","876","1168","1380","959","984"],"publish_date":"2012-06-28T19:39:37","path":"/video/youtube/H-cDorXHO5U/"},{"title":"INTTRA relies on Red Hat","description":"<p>INTTRA powers business processes with JBoss Middleware Solutions.\n\nINTTRA utilizes several solutions from the Red Hat JBoss Middleware portfolio to enhance and speed the delivery of business solutions for the shipping industry.\n\nWith JBoss Enterprise Middleware, the organization can easily control and manage each of its application components, resulting in faster software delivery, greater application flexibility and reduced management costs.</p>","video_url":"https://www.youtube.com/watch?v=huiYvQ0I8U0","speakers":"Red Hat Developers","views":"449","likes":"3","video_thumb":"https://i.ytimg.com/vi/huiYvQ0I8U0/mqdefault.jpg","hours":"0","minutes":"1","seconds":"55","tags":["1079","1078","1084"],"publish_date":"2012-10-23T19:56:12","path":"/video/youtube/huiYvQ0I8U0/"},{"title":"2012 Red Hat Summit: Building Your Next Generation IT Infrastructure with Red Hat","description":"<p>In this Transform session at the 2012 Red Hat Summit and JBoss World, Jan Mark Holzer from Red Hat helps customers understand how to best deploy, architect, and integrate this range of solutions into their IT environments, and how many of these building blocks integrate with each other.\n\nOver the past decade, Red Hat has grown far beyond Linux capabilities and today offers a wide variety of solutions throughout the entire stack. \n\nJan Mark provides an overview on where the various capabilities fit in next-generation IT architectures and how they can integrate with each other and into existing IT infrastructures. He also provides examples of deployments and architectures that can both solve today's IT challenges and accommodate next-generation IT infrastructure needs.\n\nWatch more 2012 Red Hat Summit and JBoss World videos:\nhttp://www.youtube.com/playlist?list=PL995CD1141C3330D5&feature=plcp</p>","video_url":"https://www.youtube.com/watch?v=I14e09qNAPo","speakers":"Red Hat Developers","views":"697","likes":"2","video_thumb":"https://i.ytimg.com/vi/I14e09qNAPo/mqdefault.jpg","hours":"0","minutes":"56","seconds":"16","tags":["425","425","706","699","1053","1199","1018","1372","978","405","405","752","1418"],"publish_date":"2012-06-28T06:25:13","path":"/video/youtube/I14e09qNAPo/"},{"title":"Sprint Relies on Red Hat","description":"<p>Sprint Replaces Costly Proprietary Middleware with JBoss Solutions\n\nTired of paying exorbitant licensing and maintenance fees for proprietary middleware, Sprint embarked on an open source initiative with JBoss Enterprise Application Platform that significantly cut costs while delivering enhanced flexibility and agility to the company's mission-critical business applications.\n\nhttp://www.redhat.com/resourcelibrary/case-studies/sprint-makes-right-call-by-replacing-proprietary-with-jboss-middleware</p>","video_url":"https://www.youtube.com/watch?v=i75Zd3Y_Y8o","speakers":"Red Hat Developers","views":"1246","likes":"8","video_thumb":"https://i.ytimg.com/vi/i75Zd3Y_Y8o/mqdefault.jpg","hours":"0","minutes":"2","seconds":"45","tags":["1281","1299","1084","1399","1372"],"publish_date":"2012-07-11T20:31:58","path":"/video/youtube/i75Zd3Y_Y8o/"},{"title":"The Intelligent, Integrated Healthcare System","description":"<p>Healthcare systems around the world are challenged by rapidly growing data and new automation and government regulations. This fun, easy-to-understand video illustrates how JBoss Enterprise SOA and Data Services Platforms can help healthcare companies such as providers, payers and other players become intelligent, integrated enterprises.</p>","video_url":"https://www.youtube.com/watch?v=iKBhT0UnnMs","speakers":"Red Hat Developers","views":"5876","likes":"19","video_thumb":"https://i.ytimg.com/vi/iKBhT0UnnMs/mqdefault.jpg","hours":"0","minutes":"1","seconds":"32","tags":["1117","941","1180","809","425","425","89","305","799","325","777","880","1006","1007","806","1034","992","932","959","745"],"publish_date":"2012-02-21T19:21:25","path":"/video/youtube/iKBhT0UnnMs/"},{"title":"Travel Channel: A Red Hat Customer Success Story","description":"<p>http://www.youtube.com/watch?v=IKk_g3hfvmI\r\nRichard Hood, Senior Manager of IT Operations, and Chuck Payne, Systems Administratior, both from Travel Channel, talk about the evolution and challenges of content and technology on their website and television programs--and their use of Red Hat Enterprise Linux 5.2, data storage (SAN), application containers, and JBoss Enterprise Middleware.\r\n\r\nTravel Channel uses these tools to provide exceptional Emmy-winning customer experiences to 95 million subscribers, available 24x7. \r\n\r\n\"The middleware in between--which is, I would say, the glue to the entire environment--is JBoss.\"\r\n-- Richard Hood\r\n\r\nJBoss Operations Network provides monitoring with alerts to keep their systems up and running under normal and heavy loads. Consulting services helped Travel Channel learn how to roadmap and execute on improvements to their infrastructure.\r\n\r\n\"The mentality of understanding the client seeps all the way through Red Hat. All the way down to the young lady (or young man) who takes your support call. We're the number one item on their list at that time.\"\r\n-- Richard Hood\r\n\r\nSee more Red Hat success stories:\r\nhttp://www.youtube.com/playlist?list=PLF466E1F42D1ADABC&feature=plcp</p>","video_url":"https://www.youtube.com/watch?v=IKk_g3hfvmI","speakers":"Red Hat Developers","views":"653","likes":"1","video_thumb":"https://i.ytimg.com/vi/IKk_g3hfvmI/mqdefault.jpg","hours":"0","minutes":"5","seconds":"37","tags":["1419","1311","405","425","425","575","155","820","836","89","1079","1187","1084","1084","1083","1224"],"publish_date":"2012-02-13T22:29:59","path":"/video/youtube/IKk_g3hfvmI/"},{"title":"Home mortgage origination demo with JBoss Enterprise Middleware","description":"<p>A short demo of how JBoss enterprise middleware integrates your IT assets leading to a more agile, responsive, and intelligent organization.\r\n\r\nFor more info: http://www.jboss.com/products/platforms/soa/</p>","video_url":"https://www.youtube.com/watch?v=JZlpp5jqhP0","speakers":"Red Hat Developers","views":"2073","likes":"6","video_thumb":"https://i.ytimg.com/vi/JZlpp5jqhP0/mqdefault.jpg","hours":"0","minutes":"6","seconds":"38","tags":["89","1079","1117","799","880"],"publish_date":"2011-11-21T14:53:51","path":"/video/youtube/JZlpp5jqhP0/"},{"title":"JUDCon 2012 - Enterprise Services Made Easy with SwitchYard","description":"<p>A JUDCon 2012 session presented by Keith Babo.\n\nIn the not too distant past, application integration was widely considered to be a post-deployment consideration.  Development teams implemented business logic and packaged their application for deployment, while system integrators came in after the fact to tie applications together.  With the introduction of Service Oriented Architecture, we began to see a shift where the design and implementation of a service was guided by a desire for application logic to be be used in multiple contexts and to take advantage of services offered by other applications without tightly coupling the implementations.  One of the biggest challenges for developers, however, was how to realize the tangible benefits of SOA without getting swallowed by the tools and frameworks designed to get them there.\n\nThis session provides an in-depth tour of how SwitchYard, the next generation Enterprise Service Bus from JBoss, gets you to SOA, easy.  There's something for everyone in this talk.  Java EE developers will see how a small set of annotations can be used to turn CDI beans into providers and consumers of enterprise services.  Inject references to enterprise services directly into your Java EE web applications!  Application integrators will witness the wonder of declarative transformation, the flexibility of policy-based service constrains, and the power of an Apache Camel-based routing engine with tons of EIP.  Business savvy folks will find multiple options for service orchestration including BPMN 2.0 and BPEL.  In the end, everyone wins when these features are tied together with rapid application development tooling, a consistent, standards-based configuration model, a top-notch testing framework, and deployment options ranging from embedded to cloud.</p>","video_url":"https://www.youtube.com/watch?v=k1V0N4juBqA","speakers":"Red Hat Developers","views":"2235","likes":"9","video_thumb":"https://i.ytimg.com/vi/k1V0N4juBqA/mqdefault.jpg","hours":"0","minutes":"49","seconds":"42","tags":["1157","706","1117","1166","205","1117","89","1079"],"publish_date":"2012-10-12T21:01:34","path":"/video/youtube/k1V0N4juBqA/"},{"title":"Jim Whitehurst keynote (2011 Red Hat Summit & JBoss World)","description":"<p>Red Hat President and CEO Jim Whitehurst gives the feature keynote at the 2011 Red Hat Summit and JBossWorld.\n\nHear Whitehurst speak about the principles and ideologies of openness and user-driven innovation, in technology and in life. From the business value inherent in today's virtualization and cloud technologies to the political changes possible in the world when people are willing to set aside the idea of complete and total ownership and work together, the principles are one and the same.\n\nWhitehurst details how collaboration, openness, and choice are the cornerstones of a truly free and innovative world. He discusses the growth of cloud and the changes within the data we use and the datacenter we store our information in. He gives an broad view of the future Red Hat believes in and the way our technologies and ideals can shape the next generation of technology into something that benefits us all.\n\nSee more videos from the 2011 Red Hat Summit and JBossWorld:\nhttp://www.youtube.com/user/RedHatVideos#g/c/995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=k7F3TBDD_kQ","speakers":"Red Hat Developers","views":"1245","likes":"10","video_thumb":"https://i.ytimg.com/vi/k7F3TBDD_kQ/mqdefault.jpg","hours":"0","minutes":"25","seconds":"36","tags":["425","425","699","89","595","859","868","1171","1367","805","838","970","1135","825","1260","932","876"],"publish_date":"2011-08-01T19:16:38","path":"/video/youtube/k7F3TBDD_kQ/"},{"title":"JUDCon 2012 - Deep Dive into Your Business Processes using jBPM","description":"<p>A JUDCon 2012 session presented by Kris Verlaenen\n\nImplementing a standards based Health Information Exchange in a large Healthcare System is a difficult task. Many healthcare software systems do not natively interoperate with modern standards based exchanges. The Health Information Exchange at Hartford Healthcare is based on specifications and standards defined by Integrating the Healthcare Enterprise (www.ihe.net). This group aims to improve the way computer systems in healthcare exchange information. One of the major difficulties encountered during this project was the lack of native interoperability between various source data systems and the Health Information Exchange implementation. \n\nTo address this need the Interoperability group implemented key functionality which facilitated the easy exchange of data between hospital based systems and the exchange. The functionality was developed as native JBoss ESB services. Along with these services a JBoss ESB native gateway was developed to facilitate the exchange of HL7 messages between various parts of the system. Beside serving as a critical part of the internal health information exchange between Hartford Healthcare entities the platform was also deployed during a statewide pilot project at 3 other hospitals. The software assets from this project are freely available at the Open Health Tools forge (www.openhealthtools.org) under an Apache license.</p>","video_url":"https://www.youtube.com/watch?v=KdYmwGqeo_A","speakers":"Red Hat Developers","views":"1656","likes":"6","video_thumb":"https://i.ytimg.com/vi/KdYmwGqeo_A/mqdefault.jpg","hours":"0","minutes":"48","seconds":"58","tags":["425","1157","89","706","1175","1096"],"publish_date":"2012-10-12T21:03:30","path":"/video/youtube/KdYmwGqeo_A/"},{"title":"Paul Cormier keynote: We've changed the world (2011 Red Hat Summit & JBoss World)","description":"<p>Red Hat President of Products and Technologies Paul Cormier gives a keynote at the Red Hat Summit and JBoss World 2011.\n\nCormier reviews the last decade of Linux and open source development, both in and outside of Red Hat. He talks about the movement of enterprise open source software from minor servers to major mission-critical deployments throughout the industry, and the role of open development in today's cutting edge technologies.\n\nRather than the locked-in horizontal stacks of the 80s and 90s, open source gives choice to developers, to CIOs, to partners and to users. Cormier warns that Red Hat competitors would love to end that choice and return to the days of proprietary control--and shows in quotes pulled from their own presentations the conflicting messages from others in the market.\n\nCormier also discusses the role of open source in today's cloud technologies, and shows how Red Hat's technical development philosophies and business model have helped create that change in infrastructure and the datacenter. \n\nSee more videos from the 2011 Red Hat Summit and JBossWorld:\nhttp://www.youtube.com/user/RedHatVideos#g/c/995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=kk3AEqMD7zY","speakers":"Red Hat Developers","views":"601","likes":"2","video_thumb":"https://i.ytimg.com/vi/kk3AEqMD7zY/mqdefault.jpg","hours":"0","minutes":"17","seconds":"45","tags":[],"publish_date":"2011-08-01T21:13:54","path":"/video/youtube/kk3AEqMD7zY/"},{"title":"JBoss Enterprise Portal Platform 5.0 demo","description":"<p>JBoss Enterprise Portal Platform 5.0--part of the comprehensive middleware portfolio from Red Hat--is designed to reduce the time and cost associated with creating, deploying, and managing dynamic web presences. \nA Red Hat Senior Solutions Architect directly demonstrates the way this release gives enterprises a flexible, open source alternative for building, deploying, integrating, and managing on-premise and cloud-based applications.</p>","video_url":"https://www.youtube.com/watch?v=ldMujFgzSqU","speakers":"Red Hat Developers","views":"4682","likes":"4","video_thumb":"https://i.ytimg.com/vi/ldMujFgzSqU/mqdefault.jpg","hours":"0","minutes":"3","seconds":"7","tags":["89","1114","697","1130","932","857","205","1445","805","819","1357","1356","425","155","425","425","575","699","1297","1086","890"],"publish_date":"2010-07-01T19:07:01","path":"/video/youtube/ldMujFgzSqU/"},{"title":"JBoss ON: Management simplified","description":"<p>Learn more about JBoss Operations Network management solution in this quick demo.  \n\nSee how application servers and resources are deployed and handled through a robust web-based interface. View screenshots of context menus, statistical reports, and management in progress.\n\nReduce risk, make management easier, and improve your bottom line by turning JBoss ON.\n\nSee more Red Hat videos:\nhttp://www.redhat.com/videos/</p>","video_url":"https://www.youtube.com/watch?v=lIfA6AKatD8","speakers":"Red Hat Developers","views":"2111","likes":"4","video_thumb":"https://i.ytimg.com/vi/lIfA6AKatD8/mqdefault.jpg","hours":"0","minutes":"2","seconds":"44","tags":["425","425","89","59","808","745","1364","1084","1084","39","1309","891"],"publish_date":"2009-06-15T13:23:46","path":"/video/youtube/lIfA6AKatD8/"}]