[{"title":"DevNation 2015 - Christian Posta & Charles Moulliard - Continuous delivery with Fuse on Openshift","description":"<p>Come see how a practical, out-of-box-reusable deployment of a continuous delivery tool delivers complex integration deployments using tools like Docker, Jenkins, OpenShift Enterprise by Red Hat, and Red Hat JBoss Fuse.\n\nAs we’ve worked with clients to complete complex integrations with JBoss Fuse, we’ve learned best practices doing continuous delivery. We’ve taken what we’ve learned and created a working, modular example hosted on github.\n\nIn this session, we'll use this example to discuss continuous delivery, DevOps, and how Red Hat’s technology brings a practical approach to making the theory a reality.</p>","video_url":"https://www.youtube.com/watch?v=XmpeadWdU3E","speakers":"Red Hat Developers","views":"189","likes":"0","video_thumb":"https://i.ytimg.com/vi/XmpeadWdU3E/mqdefault.jpg","hours":"0","minutes":"49","seconds":"19","tags":["903","1291","59","105","195"],"publish_date":"2015-08-06T21:35:55","path":"/video/youtube/XmpeadWdU3E/"},{"title":"DevNation 2015 - Mark Proctor - Practical rules & working with drools","description":"<p>Want to build a diagnostic question-and-answer system with Drools? Interested in creating a classical computer game? Then this session is for you.\n\nIn this session, we will show you examples of Drools-based projects, demonstrate how we built them, and show you how they work. We will cover best practices, pitfalls, and general rules-based programming theory.\n\nThis mid-level session is for people who have basic Drools experience.</p>","video_url":"https://www.youtube.com/watch?v=rgH7-BEXkjc","speakers":"Red Hat Developers","views":"675","likes":"3","video_thumb":"https://i.ytimg.com/vi/rgH7-BEXkjc/mqdefault.jpg","hours":"0","minutes":"58","seconds":"48","tags":["903","917","205"],"publish_date":"2015-08-07T02:44:10","path":"/video/youtube/rgH7-BEXkjc/"},{"title":"DevNation 2015 - Ryan King - Devops in a container world: panel discussion","description":"<p>DevOps is changing at a fast pace as containers are rapidly going mainstream. In this panel, leading startup companies and Red Hat's platform group will discuss their insights and predictions for the how DevOps will change going forward.\n\nOur industry experts will discuss:\n\nDevOps\nDocker technology\nSource-to-image STI\nCI/CD\nImmutable infrastructure\nPanel members\n\nKrish Subramanian (moderator), OpenShift director of strategy, Red Hat\nAvi Cavale, CEO Shippable.com\nSteven Sheinfield, Sr. business development manager, NewRelic\nAndrew Phillips, VP of product management, XebiaLabs\nLangdon White, Developer evangelist, Red Hat\nRyan King (introduction), Red Hat Innovate</p>","video_url":"https://www.youtube.com/watch?v=mKFsXH53ZqU","speakers":"Red Hat Developers","views":"56","likes":"0","video_thumb":"https://i.ytimg.com/vi/mKFsXH53ZqU/mqdefault.jpg","hours":"0","minutes":"53","seconds":"29","tags":["903","49","105"],"publish_date":"2015-08-10T21:58:52","path":"/video/youtube/mKFsXH53ZqU/"},{"title":"DevNation 2015 - Jay Balunas - Push the future with Webpush, the IoT, embedded, & industry standards","description":"<p>Push notifications are a key feature of every mobile operating system. They help you engage your mobile users, which is critical for your success. But push notifications aren’t just limited to mobile. Developers are finding new ways to use push notifications--including web push capabilities to browsers and connected objects that can receive these notifications (think: the Internet of Things). The AeroGear UnifiedPush Server is at the forefront of many of these capabilities.\n\nIn this session, we’ll take a close look at browser-based web push, Mozilla's SimplePush protocol, and see how to develop various clients for them (like the RaspBerry Pi or Lego Mindstorms). Then we’ll use the AeroGear Unified Push server to target, trigger, and manage the notifications.</p>","video_url":"https://www.youtube.com/watch?v=ynJ7nA5OXnk","speakers":"Red Hat Developers","views":"52","likes":"1","video_thumb":"https://i.ytimg.com/vi/ynJ7nA5OXnk/mqdefault.jpg","hours":"0","minutes":"49","seconds":"24","tags":["903","719","255"],"publish_date":"2015-08-10T22:42:08","path":"/video/youtube/ynJ7nA5OXnk/"},{"title":"DevNation 2015 - Scott Stark & Burr Sutter - Developing for the Internet of Things","description":"<p>This session will be a deep dive into the world of open source software, open hardware, and the open standards that are fueling the IoT’s momentum. We will explore how to design hardware & software for connecting the physical world (the world of things) into your traditional enterprise IT infrastructure by walking through a real production IoT system. We will demonstrate connectivity technologies like Bluetooth Low Energy and MQTT as well as developer prototyping platforms like Raspberry Pi, Arduino, Intel Edison, Spark.io microcontrollers, and more.</p>","video_url":"https://www.youtube.com/watch?v=oc9FfO6Itkg","speakers":"Red Hat Developers","views":"173","likes":"1","video_thumb":"https://i.ytimg.com/vi/oc9FfO6Itkg/mqdefault.jpg","hours":"0","minutes":"55","seconds":"45","tags":["903","780","1148"],"publish_date":"2015-08-10T22:49:42","path":"/video/youtube/oc9FfO6Itkg/"},{"title":"DevNation 2015 - Görn, Pavlín & Weitekamp - From the Nulecule Nest to an Atomic App","description":"<p>Project Atomic’s evolving Nulecule [pronounced: noo-le-kyul] specification is an attempt to move beyond the current limitations of the container model. Docker introduced the concept of portability with aggregate application packaging to the container space.\n\nThe Docker packaging format stops at the individual container. And even the ‘pods’ concept introduced by Kubernetes and picked up by rkt does not address multi-container applications in their entirety.\n\nNulecule defines a pattern for packaging multi-container applications with all their dependencies and orchestration metadata in a container image. This enables the in-band transport of this application-level information using the same transport mechanism used for the component containers. It also defines an interaction model allowing parameter management of  standard software for deployment as well as the aggregation of multiple, complex, container-based applications into higher-level applications.\n\nThe Atomic App is an implementation of that spec for the Red Hat product  universe using Docker and Kubernetes to implement the packaging format,  transport, application description, and orchestration interface.\n\nThis talk will take you through the creation (structure, build) and deployment (transport and configuration) of an Atomic App.</p>","video_url":"https://www.youtube.com/watch?v=in2Y4HcDp-s","speakers":"Red Hat Developers","views":"173","likes":"4","video_thumb":"https://i.ytimg.com/vi/in2Y4HcDp-s/mqdefault.jpg","hours":"0","minutes":"48","seconds":"11","tags":["903","761","105","125"],"publish_date":"2015-08-10T23:03:04","path":"/video/youtube/in2Y4HcDp-s/"},{"title":"DevNation 2015 - Ethan Gafford - Integrating elastic data analysis with Openstack Sahara","description":"<p>Big data analysis platforms are rapidly becoming a core tool in mainstream applications development. However, while the power of these technologies is undeniable, the promise of elasticity through wide cluster scaling is often elusive. This talk will demonstrate the use of Openstack Sahara's cluster provisioning and elastic data processing features to create development, research, test, and production clusters and integrate them into a larger application. We will then discuss what sorts of production workflows are currently appropriate for Sahara, as well as the timeline for upcoming features (including baremetal provisioning) which will give the operational flexibility and performance to make Sahara a universally appropriate analytics platform.</p>","video_url":"https://www.youtube.com/watch?v=pAb_FyCqrV0","speakers":"Red Hat Developers","views":"38","likes":"0","video_thumb":"https://i.ytimg.com/vi/pAb_FyCqrV0/mqdefault.jpg","hours":"0","minutes":"38","seconds":"7","tags":["903","777"],"publish_date":"2015-08-10T23:07:02","path":"/video/youtube/pAb_FyCqrV0/"},{"title":"DevNation 2015 - Bruno Oliveira da Silva - Securing mobile applications","description":"<p>In the early ages of mobile development, developers didn't have to worry about security. The chance of having a malware scanning users device was highly unlikely.\n\nToday, that's all changed. We have more risk and more confusion. Android, iOS, and hybrid applications can be powerful and flexible, but they must be developed with security in mind.\nWhat are the alternatives to prevent future attacks? Why should I care about mobile security? How would my applications be affected by a breach? This technical session will explore these topics and explain why data security is your problem and how to prepare for the worst.\n\nWe'll walk through mobile security and explore common vulnerabilities, including:\n\nPhishing\nDNS poisoning\nSession hijacking\nLeaked data on local storage\nCryptography\nOther web server-related vulnerabilities like Heartbleed</p>","video_url":"https://www.youtube.com/watch?v=xp2ix99AqWc","speakers":"Red Hat Developers","views":"27","likes":"0","video_thumb":"https://i.ytimg.com/vi/xp2ix99AqWc/mqdefault.jpg","hours":"0","minutes":"37","seconds":"27","tags":["903","445","1215","1245","872","913"],"publish_date":"2015-08-10T23:10:12","path":"/video/youtube/xp2ix99AqWc/"},{"title":"DevNation 2015 - Christine Flood - Shenandoah: An ultra-low pause time garbage collector for OpenJDK","description":"<p>Shenandoah is the next step in OpenJDK garbage collection innovation. This long-overdue garbage collector pushes more of the work into concurrent threads, which substantially decreases pause times for your Java applications. As a result, you’re able to make better quality-of-service guarantees.\n\nIn this session, we will take a thorough look at how Shenandoah works and the performance benefits you can anticipate from this new garbage collector.</p>","video_url":"https://www.youtube.com/watch?v=OP6sQOpvN3E","speakers":"Red Hat Developers","views":"269","likes":"1","video_thumb":"https://i.ytimg.com/vi/OP6sQOpvN3E/mqdefault.jpg","hours":"0","minutes":"23","seconds":"3","tags":["903","585","973","205"],"publish_date":"2015-08-10T23:13:30","path":"/video/youtube/OP6sQOpvN3E/"},{"title":"DevNation 2015 - Matt Newsome - Red Hat Enterprise Linux C++ Toolchains","description":"<p>As a C/C++ developer you want to be able to easily access and use supported versions of the latest and greatest tools, and you want to be able to get the most from those tools.\nIn this session, we’ll look at the new features made available through the GCC compiler and friends in Red Hat Enterprise Linux 7 and Red Hat Developer Toolset (which puts the same tools in the hands of RHEL6 Developers). We'll look at new language standard support, optimizations, and other toolchain features in terms of both what they offer, and practical how-to guidance so that your development teams can get real world value from them.\n\nYou’ll learn:\n\n- How Red Hat Developer Toolset offers newer releases of the GNU Compiler Collection (GCC) for development on RHEL6 or RHEL7, optionally using the Eclipse Integrated Development Environment.\n- About the base GCC toolchain provided as part of RHEL7, its language standard support, key optimizations and other major new features- Practical guidance on how to use these features in real world application development to get high value for your customers\n- How your applications can be run and their performance analyzed on multiple releases without modification, carrying special libraries or changing the operating system runtime.\n- Where you can find more information on all these topics\n\nThis solution-focused session will appeal to all C and C++ software developers and their managers. Content will include both high-level overviews and some deeper dives into feature specifics, and will include hands-on demonstrations of features in real world use. There will also be opportunities to ask questions about your specific concerns, with experts both in the room and available after the event.</p>","video_url":"https://www.youtube.com/watch?v=UsVEquEVMO4","speakers":"Red Hat Developers","views":"69","likes":"0","video_thumb":"https://i.ytimg.com/vi/UsVEquEVMO4/mqdefault.jpg","hours":"0","minutes":"33","seconds":"42","tags":["903"],"publish_date":"2015-08-10T23:16:53","path":"/video/youtube/UsVEquEVMO4/"},{"title":"DevNation 2015 - Jennifer Krieger - So you want to be a DevOps engineer?","description":"<p>You've worked hard and mastered every coding language on the planet, including COBOL. You know jenkins, travis, go, puppet, chef, CFengine, nagios, github, graphite, logstash, ansible, aws, gce, vagrant, cms, cvs, abc, 123, and even a little bit of TFS. Your resume is up to date, and you are ready for your next job.\n\nBut you might be missing a key skill. Industry trends in engineering show a growing desire in companies to hire people who have proven soft skills, are good at collaborating with others, and can regularly solve the most complex problem we face today: effectively talking to our fellow humans.\n\nJoin Jen for a conversation about the journey of becoming more comfortable with collaboration and open communication.\n\nTopics will include:\n\nCollaborate-or-die survival skills.\nDreaded soft skills and how to become comfortable with them.\nWhat to do in common situations that all engineers face.\nHow to convince others that your idea is the right idea.\nHow to get the time you need to get your work done.</p>","video_url":"https://www.youtube.com/watch?v=iLUs6AqQkro","speakers":"Red Hat Developers","views":"1103","likes":"9","video_thumb":"https://i.ytimg.com/vi/iLUs6AqQkro/mqdefault.jpg","hours":"0","minutes":"54","seconds":"29","tags":["903","49"],"publish_date":"2015-08-10T23:20:30","path":"/video/youtube/iLUs6AqQkro/"},{"title":"DevNation 2015 - Peter Muir & Paul Robinson - Continuous delivery, with a side order of DevOps","description":"<p>Creating a large website that's written in multiple programming languages can be tricky. Enabling it to run continuously is even harder.\n\nJoin us as we outline how we brought continuous delivery to JBoss Developer (jboss.org), a thousand-page website that's served up as a mix of HTML, JavaScript and CSS and that communicates with a variety of back-end services.\n\nWe'll talk about challenges we faced and our solutions, including:\n\nSizing a converged infrastructure.\nOrganizational challenges.\nTesting websites and creating good test environments .\nIntroducing Docker.</p>","video_url":"https://www.youtube.com/watch?v=W9BziuUCyh4","speakers":"Red Hat Developers","views":"47","likes":"0","video_thumb":"https://i.ytimg.com/vi/W9BziuUCyh4/mqdefault.jpg","hours":"0","minutes":"49","seconds":"26","tags":["903","49","866"],"publish_date":"2015-08-10T23:24:03","path":"/video/youtube/W9BziuUCyh4/"},{"title":"DevNation 2015 - Christina Lin - Get to know Camel in 40 minutes","description":"<p>In this session, we take a look at an integration problem and how Camel solves it by using the latest Data Mapper Tool for data transformation and implementing various Enterprise Integration patterns.\n\nWe will demo how to create the project from beginning and how to set up and configure message broker to implement a total asynchronized architecture. You'll see it running on Fabric8 v1 and also learn about some possible deployment architectures.</p>","video_url":"https://www.youtube.com/watch?v=WDQU5oMvpoc","speakers":"Red Hat Developers","views":"146","likes":"1","video_thumb":"https://i.ytimg.com/vi/WDQU5oMvpoc/mqdefault.jpg","hours":"0","minutes":"47","seconds":"32","tags":["903","735","952"],"publish_date":"2015-08-10T23:35:23","path":"/video/youtube/WDQU5oMvpoc/"},{"title":"DevNation 2015 - Adam Koblentz - Develop anywhere--even the cloud","description":"<p>When developing software, you typically have 2 options. Either you use black-box testing and run code against mock objects, hoping that numerous unit tests catch any problems. Or, you don't run your code at all until you can hit a test or QA back-end service and hope everything works. Either way, there's a lot of hoping and not a lot of productive functional testing.\n\nIt’s becoming more reasonable to have an instance of your application in a shared environment with other services hosted inside a modern cloud platform. Historically, developers didn’t write code against these cloud instances because of the time increase in the already slow Java tooling. But OpenShift and JRebel are changing that.\n\nIn this session, we'll show you how to write Java EE applications on the OpenShift platform and we’ll use JRebel to instantly push our code changes into OpenShift.</p>","video_url":"https://www.youtube.com/watch?v=pH40Zwie6vE","speakers":"Red Hat Developers","views":"25","likes":"0","video_thumb":"https://i.ytimg.com/vi/pH40Zwie6vE/mqdefault.jpg","hours":"0","minutes":"38","seconds":"42","tags":["903","838","1149","59"],"publish_date":"2015-08-10T23:51:32","path":"/video/youtube/pH40Zwie6vE/"},{"title":"DevNation 2015 - Jason Hibbets - Community building the open source way","description":"<p>Over the past 5 years, Jason Hibbets has been the community manager behind Opensource.com, an online publication focused on highlighting the use of open source methodologies in areas outside of technology.\n\nIn this session, he’ll provide a case study of the content strategy and community-building effort for the Opensource.com publication. You’ll go behind the scenes and see the tools, metrics, and strategy that’s helped this project grow to over 600,000 page views a month.\n\nThis session will:\nGive in-depth insight about how to build a great team.\nProvide details on social media and SEO strategies.\nOutline our community moderator program.\nShow metrics and results from the Opensource.com team.</p>","video_url":"https://www.youtube.com/watch?v=EvBz6MYJg-8","speakers":"Red Hat Developers","views":"32","likes":"0","video_thumb":"https://i.ytimg.com/vi/EvBz6MYJg-8/mqdefault.jpg","hours":"0","minutes":"45","seconds":"20","tags":["903"],"publish_date":"2015-08-11T00:01:04","path":"/video/youtube/EvBz6MYJg-8/"},{"title":"DevNation 2015 - Honza Horak - How to deliver multiple versions of application stacks","description":"<p>You need a stable platform that also offers the most innovative features. With Software Collections (SCL), you can build and concurrently install multiple versions of the same software components on your system, without affecting the underlying system.\n\nIn this session, see how to develop a simple application using SCL and the latest stable versions of Python 3.4 and MongoDB 2.6. The application can be deployed on Red Hat Enterprise Linux 6 and Red Hat Enterprise Linux 7.\n\nWe'll also talk about:\n\nThe most recent changes in SCL usage.\nBest practices when working with SCLs.\nHow to extend and use the most recent collections delivered by Red Hat.</p>","video_url":"https://www.youtube.com/watch?v=lvtYlKUjfHQ","speakers":"Red Hat Developers","views":"40","likes":"0","video_thumb":"https://i.ytimg.com/vi/lvtYlKUjfHQ/mqdefault.jpg","hours":"0","minutes":"50","seconds":"5","tags":["903","475","1223"],"publish_date":"2015-08-11T00:16:15","path":"/video/youtube/lvtYlKUjfHQ/"},{"title":"DevNation 2015 - Arun Gupta, Thomas Qvarnström - DevOps with java ee","description":"<p>Techniques such as automated builds and testing, continuous integration and continuous deployment allow software to be developed to a high standard and easily packaged and deployed to test environments, resulting in the ability to rapidly, reliably and repeatedly push out enhancements and bug fixes to customers at low risk and with minimal manual overhead. What container-agnostic tools are available for testing, continuous integration and deployment of a Java EE application ?\n\nThis talk will start with how to package Java EE application “operating environment” such as Operating System, JVM, Database, dependencies, and other configuration in a reusable format, such as Docker. It explains how to replicate the environment for development, testing, staging, and production minimizing the impedance mismatch between them. A quick overview of Arquillian and how it helps in a automated testing across multiple Java EE containers is shown. How functional testing, code coverage, performance and other aspects for going in to production will be discussed. Using Arquillian against Docker containers will be explained as well. Finally, configuring Jenkins for Continuous Integration and setting up deployment pipelines will show how to take an application from push-to-production and achieve almost 100% automation.</p>","video_url":"https://www.youtube.com/watch?v=m9nJPS0sZnk","speakers":"Red Hat Developers","views":"118","likes":"0","video_thumb":"https://i.ytimg.com/vi/m9nJPS0sZnk/mqdefault.jpg","hours":"1","minutes":"2","seconds":"22","tags":["904"],"publish_date":"2015-08-11T00:54:09","path":"/video/youtube/m9nJPS0sZnk/"},{"title":"DevNation 2015 - Leathem - Transform your web applications with reactive functional programming","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=dfy1pGlU8Jk","speakers":"Red Hat Developers","views":"144","likes":"0","video_thumb":"https://i.ytimg.com/vi/dfy1pGlU8Jk/mqdefault.jpg","hours":"0","minutes":"57","seconds":"50","tags":["903","1278","1318"],"publish_date":"2015-08-11T15:39:50","path":"/video/youtube/dfy1pGlU8Jk/"},{"title":"DevNation 2015 - Xavier Coulon - Productive Java EE and HTML5 developement","description":"<p>During this session, we'll demonstrate how you can be productive when building Java EE+ HTML5 applications in Eclipse with JBoss Developer Studio.\n\nWe'll show you how to:\n\nUse the tools to scaffold from from an existing database using JPA.\nExpose the entities via JAX-RS with the integrated JBoss Forge tooling.\nDisplay the content in the browser using HTML5 + AngularJS.\nAutomatically refresh the page templates thanks to the LiveReload integration.\nIf time and our network allows, we'll deploy the application on OpenShift, without leaving the IDE. You should expect (almost) no slides, with an emphasis on coding and talking.</p>","video_url":"https://www.youtube.com/watch?v=q1N3gqXxygo","speakers":"Red Hat Developers","views":"97","likes":"0","video_thumb":"https://i.ytimg.com/vi/q1N3gqXxygo/mqdefault.jpg","hours":"1","minutes":"2","seconds":"51","tags":["905"],"publish_date":"2015-08-11T16:02:40","path":"/video/youtube/q1N3gqXxygo/"},{"title":"DevNation 2015 - Steven Pousty, Grant Shipley - Microservices & you: Practical introduction","description":"<p>Curious about microservices? Want to hear what happens when you actually use them in your environments? This session introduces the basic ideas behind microservices and goes on to discuss some pros and cons of using them.\n\nWe’ll discuss the process I went through in constructing http://wwww.flatfluffy.com, a multi-device application for gamified recording of roadkill. We’ll review the code and tools used to run the whole application, with a focus on how a microservices architecture was used to produce the mapping experience in FlatFluffy.\n\nJoin this informal, interactive session where you’ll have the opportunity to ask your implementation questions. Come in curious, and leave with a solid understanding of how to get started on your first microservice-architected application.</p>","video_url":"https://www.youtube.com/watch?v=hy9aVrTNufQ","speakers":"Red Hat Developers","views":"610","likes":"4","video_thumb":"https://i.ytimg.com/vi/hy9aVrTNufQ/mqdefault.jpg","hours":"1","minutes":"0","seconds":"24","tags":["903","79"],"publish_date":"2015-08-11T16:06:59","path":"/video/youtube/hy9aVrTNufQ/"},{"title":"DevNation 2015 - Knutsen, Majsak - Taming microservices testing with Docker & Arquillian Cube","description":"<p>With microservices, polyglot, and DevOps on the rise, what's happening with testing? Do they increase complexity and make our testing efforts harder? Or do they actually make it easier to write better tests?\n\nIn this session, we will explore how we can do our testing in this new world, and how the new world can help us test better.\n\nOther topics we'll discuss include:\n\nNodeJS, DynJS, VertX, Ceylon, or Ruby-orchestrated microservices.\nSystem scale testing with different configurations.\nDatabase migration and regression testing.</p>","video_url":"https://www.youtube.com/watch?v=4zqO-Wtnq8o","speakers":"Red Hat Developers","views":"339","likes":"0","video_thumb":"https://i.ytimg.com/vi/4zqO-Wtnq8o/mqdefault.jpg","hours":"0","minutes":"48","seconds":"52","tags":["903","79","755","105"],"publish_date":"2015-08-11T16:10:55","path":"/video/youtube/4zqO-Wtnq8o/"},{"title":"DevNation 2015 - Jeremy Davis - Modern Javascript for Java developers","description":"<p>Did your last web application use JSP? JSF? Wondering what the terms SPA, npm, Yeoman, Grunt, Gulp, Bower, and CoffeScript are? Haven’t had a chance to get your hands dirty with AngularJS, Ember, or Backbone? Feeling a bit behind the web development curve?\n\nHTML 5 and JavaScript have completely changed the web development game. Get up to speed in this 60-minute crash course on modern JavaScript development. We’ll give you everything you need to know to navigate the current JavaScript landscape.</p>","video_url":"https://www.youtube.com/watch?v=dN_B_Qxn9gg","speakers":"Red Hat Developers","views":"422","likes":"2","video_thumb":"https://i.ytimg.com/vi/dN_B_Qxn9gg/mqdefault.jpg","hours":"0","minutes":"46","seconds":"28","tags":["903","235","1461","994","995","785","844"],"publish_date":"2015-08-11T16:45:11","path":"/video/youtube/dN_B_Qxn9gg/"},{"title":"DevNation 2015 - Steve Pousty - Introduction to PaaS for application developers","description":"<p>Tired of waiting weeks to get a server spinning up and configuring your virtual servers? Come see how Platform-as-a-Service (PaaS) can make you a happier and more productive coder.\n\nYou'll leave this hands-on session comfortable with deploying your own apps. You'll learn:\n\nThe meaning behind confusing acronyms like IaaS, PaaS, and SaaS.\nWhy PaaS is a developers dream come true.\nHow easy it is to get started with a Python (or Node or Java) web application on a PaaS.\nHow you can complete all development life-cycle tasks from the command line.\nBring your laptop and skepticism, and leave with a smile and working code.</p>","video_url":"https://www.youtube.com/watch?v=nkqvZwSWSCI","speakers":"Red Hat Developers","views":"68","likes":"1","video_thumb":"https://i.ytimg.com/vi/nkqvZwSWSCI/mqdefault.jpg","hours":"1","minutes":"0","seconds":"0","tags":["903","59"],"publish_date":"2015-08-11T16:53:03","path":"/video/youtube/nkqvZwSWSCI/"},{"title":"DevNation 2015 - Lincoln Baxter & George Gastaldi - Automate development with JBoss Forge","description":"<p>Automating tedious user tasks can increase productivity and save you money. While there are numerous tools for the continuous integration of software, many developers still rely on hand-made shell scripts, clumsy integrated development environment (IDE) wizards, or endless Google searches for generating companion project artifacts like dependency-management settings, database and ORM configuration, simple CRUD services, test-environment setup, or deploying into the cloud.\n\nJBoss Forge fills that niche in the software-development life cycle. JBoss Forge offers:\n\nA simple, modular, easy-to-grasp model for developing pluggable components that can fit in any phase of a programmer's daily life.\nThe ability to use any programming language, database, or server you choose.\nAn easy, testable way to define your own tools, wizards, and extensions.\nIn this session, you will learn about JBoss Forge 2, how to extend it, and how to make commands that run on the native Shell and your favorite IDE without any code changes.</p>","video_url":"https://www.youtube.com/watch?v=YIkSGGNxF0A","speakers":"Red Hat Developers","views":"260","likes":"3","video_thumb":"https://i.ytimg.com/vi/YIkSGGNxF0A/mqdefault.jpg","hours":"0","minutes":"50","seconds":"42","tags":["903","1080","185","205"],"publish_date":"2015-08-11T16:57:48","path":"/video/youtube/YIkSGGNxF0A/"},{"title":"DevNation 2015 - Vincent Batts - Golang: The good, the bad, & the ugly","description":"<p>With projects like Openshift 3, Google Kubernetes, and Docker written in the go programming language (golang), it's important to understand what that entails.\n\nIn this session, we'll talk about what it's like to work with the golang every day.\n\nWe'll share:\n\nLessons we've learned.\nBenefits and drawbacks of the language.\nThe challenges and rewards of using golang.\nFundamental and advanced uses of the language.\nDevelopment and operational uses of golang.</p>","video_url":"https://www.youtube.com/watch?v=cMYhGNofHA4","speakers":"Red Hat Developers","views":"23684","likes":"119","video_thumb":"https://i.ytimg.com/vi/cMYhGNofHA4/mqdefault.jpg","hours":"0","minutes":"48","seconds":"32","tags":["903","986","105","125"],"publish_date":"2015-08-11T17:01:25","path":"/video/youtube/cMYhGNofHA4/"},{"title":"DevNation 2015 - Xavier Coulon - Using lambda expressions to query a data store","description":"<p>Want to take advantage of the type-safety and expressiveness of Java 8 lambda expressions to write queries that would be executed on a data store? It’s not as simple as it sounds.\n\nDuring this session, we’ll talk about the challenges behind using such expressions (spoiler: this includes reading bytecode). We’ll show you how to integrate lambda expressions with the latest MongoDB Java driver to submit queries in the native BSON format on the data store.</p>","video_url":"https://www.youtube.com/watch?v=waPrzllv2uQ","speakers":"Red Hat Developers","views":"82","likes":"0","video_thumb":"https://i.ytimg.com/vi/waPrzllv2uQ/mqdefault.jpg","hours":"0","minutes":"42","seconds":"43","tags":["903","730","1178"],"publish_date":"2015-08-11T17:08:30","path":"/video/youtube/waPrzllv2uQ/"},{"title":"DevNation 2015 - Duncan Doyle, Tristan Tarrant - Cross-region cloud deployments with Infinispan","description":"<p>Infinispan is an extremely scalable, highly available, key-value datastore and data grid. The platform is highly flexible and can be deployed in environments ranging from on-premise physical hardware to elastic cloud environments.\n\nIn this session, we'll demo how to deploy a cross-region Infinispan (JBoss Data Grid) cluster in the Amazon cloud (AWS). We'll cover the challenges faced when deploying a data grid in a single cloud region, as well as how to set up Infinispan x-site replication spanning multiple regions in the Amazon Elastic Compute Cloud (EC2).\n\nTopics discussed will include:\n\nThe discovery of Infinispan nodes in a cloud environment.\nx-site replication across AWS EC2 regions.\nThe new x-site state transfer feature in Infinispan 7.\nThe remote listeners over the HotRod protocol.\nWe'll also review the challenges imposed by the CAP theorem in a single grid in a single region and discuss data consistency challenges and possible solutions in a x-site, cross-region setup.</p>","video_url":"https://www.youtube.com/watch?v=x4eH6EtZDUA","speakers":"Red Hat Developers","views":"126","likes":"2","video_thumb":"https://i.ytimg.com/vi/x4eH6EtZDUA/mqdefault.jpg","hours":"0","minutes":"55","seconds":"47","tags":["903","936"],"publish_date":"2015-08-11T17:11:19","path":"/video/youtube/x4eH6EtZDUA/"},{"title":"DevNation 2015 - Paul Bakker - Pulse Session on OSGi","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=nhYR5MOe7RY","speakers":"Red Hat Developers","views":"104","likes":"1","video_thumb":"https://i.ytimg.com/vi/nhYR5MOe7RY/mqdefault.jpg","hours":"0","minutes":"48","seconds":"50","tags":["903"],"publish_date":"2015-08-14T15:21:40","path":"/video/youtube/nhYR5MOe7RY/"},{"title":"DevNation 2015 - Pulse session on all things IoT","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=OJT_BZmXTdM","speakers":"Red Hat Developers","views":"124","likes":"0","video_thumb":"https://i.ytimg.com/vi/OJT_BZmXTdM/mqdefault.jpg","hours":"0","minutes":"45","seconds":"49","tags":["903"],"publish_date":"2015-08-14T15:31:49","path":"/video/youtube/OJT_BZmXTdM/"},{"title":"DevNation 2014 - Neal Ford - Opening Keynote: Agile Architecture and Design","description":"<p>Morning Keynote Session from DevNation 2014.\n\nDonald Rumsfeld was right: it's the unknown unknowns that are the real killers in software development. Design decisions made too early are just speculations without facts. But you must have architecture in place before you can do anything. This session talks about the tension between architecture & design in agile projects, discussing two key elements of emergent design (utilizing the last responsible moment and harvesting idiomatic patterns) and how to de-brittlize your architecture, so that you can play nicely with others. This talk includes both proactive (test-driven development) and reactive (refactoring, metrics, visualizations, tests) approaches to discovering design, and discusses the use of custom attributes, DSLs, and other techniques for utilizing them. The goal of this talk is to provide nomenclature, strategies, and techniques for allowing design to emerge from projects as they proceed, keeping your code in sync with the problem domain.</p>","video_url":"https://www.youtube.com/watch?v=fFs5RoqEh8Q","speakers":"Red Hat Developers","views":"3736","likes":"25","video_thumb":"https://i.ytimg.com/vi/fFs5RoqEh8Q/mqdefault.jpg","hours":"1","minutes":"13","seconds":"55","tags":["903"],"publish_date":"2014-05-20T02:25:45","path":"/video/youtube/fFs5RoqEh8Q/"},{"title":"DevNation 2014 - Gene Kim - Afternoon Keynote: Why Everyone Needs DevOps Now","description":"<p>Afternoon keynote at DevNation 2014.\n\nGene is a multiple award winning CTO, researcher and author. He was founder and CTO of Tripwire for 13 years. He has written three books, including \"The Visible Ops Handbook\" and \"The Phoenix Project: A Novel About IT, DevOps, and Helping Your Business Win.\" Gene is a huge fan of IT operations, and how it can enable developers to maximize throughput of features from \"code complete\" to \"in production,\" without causing chaos and disruption to the IT environment. He has worked with some of the top Internet companies on improving deployment flow and increasing the rigor around IT operational processes. In 2007, ComputerWorld added Gene to the \"40 Innovative IT People Under The Age Of 40\" list, and was given the Outstanding Alumnus Award by the Department of Computer Sciences at Purdue University for achievement and leadership in the profession.</p>","video_url":"https://www.youtube.com/watch?v=vTxAR8EOc8A","speakers":"Red Hat Developers","views":"2968","likes":"17","video_thumb":"https://i.ytimg.com/vi/vTxAR8EOc8A/mqdefault.jpg","hours":"0","minutes":"54","seconds":"13","tags":["49","903"],"publish_date":"2014-05-20T02:37:25","path":"/video/youtube/vTxAR8EOc8A/"},{"title":"DevNation 2014 - Pete Muir - Building an Enterprise App from Scratch","description":"<p>Good applications are a mix of powerful technologies and a productive approach to development. In this session, Pete Muir will discuss how both aspects blend together in the context of a working application.\n\nThrough a detailed walkthrough, you'll learn how to build a Java EE 6 application with a mobile-friendly HTML5 front end, built using industry-standard JavaScript frameworks such as AngularJS. We'll build the application using the Red Hat JBoss Middleware stack, with Java EE at the core. You'll see how to deploy the application to OpenShift Enterprise by Red Hat—the company's on-premise PaaS—and learn how to add some continuous integration and testing.\n\nWe'll also discuss the requirements for the application, why the technologies were chosen, and how the application is architected.\n\nThis talk will assume a basic understanding of Java web applications, and Java EE.</p>","video_url":"https://www.youtube.com/watch?v=8pOsVrGVfvw","speakers":"Red Hat Developers","views":"524","likes":"5","video_thumb":"https://i.ytimg.com/vi/8pOsVrGVfvw/mqdefault.jpg","hours":"0","minutes":"48","seconds":"11","tags":["903","89","59"],"publish_date":"2014-05-20T03:07:05","path":"/video/youtube/8pOsVrGVfvw/"},{"title":"DevNation 2014 - Jeremy Edberg - How Netflix Uses DevOps for Reliability and Developer Velocity","description":"<p>Netflix designs our systems and deployment processes to help the service survive both catastrophic events like zone and regional outages and less catastrophic events like network latency and random instance death. This system has previously been described as \"dream devops\". In our data centers we had monolithic systems and centralized operations. When we moved to the cloud we fully embraced the distributed services and the devops model. Now, with experience, we've uncovered real-world challenges with the devops model and, as a result, have embraced more effective hybrid approaches. More specifically, how do we reconcile local agility and ownership with the achievement of system-wide objectives, such as the overall quality and reliability of large scale distributed environment? Topics will include our software lifecycle from code checkin to automated machine image baking to deployment, monitoring and alerting, and how Netflix uses self service tools to enable our developers to maintain maximum code velocity.</p>","video_url":"https://www.youtube.com/watch?v=WvpmiGURFYQ","speakers":"Red Hat Developers","views":"2822","likes":"23","video_thumb":"https://i.ytimg.com/vi/WvpmiGURFYQ/mqdefault.jpg","hours":"0","minutes":"55","seconds":"26","tags":["903","49"],"publish_date":"2014-05-20T02:41:26","path":"/video/youtube/WvpmiGURFYQ/"},{"title":"DevNation 2014 - Brian Gollaher - Developing Applications for Red Hat Enterprise Linux","description":"<p>In this session, we'll cover when developers should use Red Hat Enterprise Linux system tools, when they should use the Red Hat Developer Toolset, and when they should use Red Hat Software Collections. We'll describe the developer tools for Red Hat Enterprise Linux and make recommendations in context, based on the type of application and the application life cycle. Well also explain the targeted audience for the native system tools and why they are not appropriate for all applications. Finally, we'll explain and provide examples of the target audience for the Red Hat Developer Toolset and Red Hat Software Collections tools.</p>","video_url":"https://www.youtube.com/watch?v=c3yjeaCdJ2s","speakers":"Red Hat Developers","views":"237","likes":"0","video_thumb":"https://i.ytimg.com/vi/c3yjeaCdJ2s/mqdefault.jpg","hours":"0","minutes":"34","seconds":"39","tags":["903","635"],"publish_date":"2014-05-20T03:11:37","path":"/video/youtube/c3yjeaCdJ2s/"},{"title":"DevNation 2014 - Arun Gupta - 50 New Features of Java EE 7 in 50 Minutes","description":"<p>The Java EE 7 platform has four new components (WebSocket, JSON-P, batch, and concurrency), three that are significantly updated (JAX-RS 2, JMS, and EL), and several others that bring significant changes to the platform. As you can imagine, a lot of new functionality has been introduced in the platform. In this fast-paced session, you will learn about 50 new features introduced in the Java EE 7 platform. @ClientEndpoint, chunk-style batch processing, @FlowScoped, @AroundConstruct, @JMSDestinationDefinition, and @Transactional are some of features the presentation covers. It explains each feature with a code snippet and provides details on where and how you can use it in your applications.</p>","video_url":"https://www.youtube.com/watch?v=wZZbCurzuE0","speakers":"Red Hat Developers","views":"1541","likes":"10","video_thumb":"https://i.ytimg.com/vi/wZZbCurzuE0/mqdefault.jpg","hours":"1","minutes":"1","seconds":"45","tags":["903"],"publish_date":"2014-05-20T03:15:32","path":"/video/youtube/wZZbCurzuE0/"},{"title":"DevNation 2014 - Louis Zuckerman  - GlusterFS & Java","description":"<p>Recent developments in Java and Gluster have given us a new way to connect these two technologies: Java 7 paved the way for file system provider plug-ins, while GlusterFS 3.4 provides a new client software interface.\n\nThis session introduces glusterfs-java-filesystem, a new open source project that connects applications running on the Java platform to GlusterFS storage. Join Louis Zuckerman, founder of the glusterfs-java-filesystem project, for a deep dive into:\n\n* What it means to access GlusterFS directly from Java, and why it matters.\n* Writing and testing a Java file system provider.\n* Using file system provider plug-ins in Java applications.\n* Accessing GlusterFS from other languages on the Java platform (jython, jruby, scala, clojure, groovy, etc.).\n\nThe presentation includes slides, a live demonstration, and Q and A. After attending the session, you'll be able to use GlusterFS in your own Java platform applications.</p>","video_url":"https://www.youtube.com/watch?v=ig3F1YLpc3U","speakers":"Red Hat Developers","views":"381","likes":"1","video_thumb":"https://i.ytimg.com/vi/ig3F1YLpc3U/mqdefault.jpg","hours":"0","minutes":"57","seconds":"14","tags":["903"],"publish_date":"2014-05-20T03:26:25","path":"/video/youtube/ig3F1YLpc3U/"},{"title":"DevNation 2014 - Scott McClellan - Hadoop and Beyond","description":"<p>Historically, the term \"Hadoop\" has been considered synonymous with its core technologies: MapReduce and the Hadoop Distributed File System (HDFS). But today the definition of Hadoop is rapidly evolving.\n\nThe Hadoop community is generalizing the application runtime model beyond MapReduce. On the storage front, we're seeing the emergence of many alternative Hadoop-compatible file systems. Red Hat has built an interface layer for its Red Hat Storage Server product. This complete implementation of the Hadoop file system interface lets Hadoop-related projects run transparently, directly on a Red Hat Storage Server cluster.\n\nThis talk will concentrate on contrasting the architectures of the HDFS against alternate Hadoop file systems—focused primarily on GlusterFS (the underlying technology for Red Hat Storage Server), but also examining implementations done on top of NoSQL and object storage. We'll talk about:\n\n* The current implementation.\n* What we've learned about compatibility, performance, and scalability.\n* The roadmap for next-generation implementations.</p>","video_url":"https://www.youtube.com/watch?v=dhtYasPmpGM","speakers":"Red Hat Developers","views":"215","likes":"0","video_thumb":"https://i.ytimg.com/vi/dhtYasPmpGM/mqdefault.jpg","hours":"0","minutes":"51","seconds":"24","tags":["903"],"publish_date":"2014-05-20T03:58:00","path":"/video/youtube/dhtYasPmpGM/"},{"title":"DevNation 2014 - Jason Greene - JVM Finalize Pitfalls: How to Avoid the Danger","description":"<p>Properly freeing external resources such as files and connections in a garbage collected environment requires care. The JVM's finalize() and PhantomReference features provide APIs and JVM targetted languages a way to handle the common case of a forgotten close. Unfortunately these capabilities are deeply flawed, and require specialized techniques to use correctly. This session will dive deeply into the problem, showing how the JVM can get it wrong. It will offer useful tips on how developers can safely manage their resources, and never forgot to close. In addition, API and language designers will gain more insight into the inner-workings of the JVM, and how they can safely avoid the peril of JVM finalization.</p>","video_url":"https://www.youtube.com/watch?v=UrGP6pfb0H8","speakers":"Red Hat Developers","views":"349","likes":"4","video_thumb":"https://i.ytimg.com/vi/UrGP6pfb0H8/mqdefault.jpg","hours":"0","minutes":"39","seconds":"58","tags":["903","1161"],"publish_date":"2014-05-20T03:37:09","path":"/video/youtube/UrGP6pfb0H8/"},{"title":"DevNation 2014 - Scott Cranton & Scott McCarty - Resilient Enterprise Messaging with JBoss A-MQ","description":"<p>Messaging has become a critical infrastructure component for both developers and systems administrators. Scaling infrastructure in an efficient and manageable way is critical in modern physical, virtual and cloud infrastructures. To provide value to the business, developers and systems administrators must understand technical and business advantages of current and future architectures.\n\nJoin Scott McCarty and Scott Cranton as they bring years of experience in building scalable, fault tolerant, distributed systems to the architectural challenges of building durable messaging platforms. Attendees will receive guidance on emerging technologies as well as an understanding of the strengths of current solutions like Red Hat JBoss A-MQ.\n\nThis discussion will include enterprise requirements such as fault tolerance, high performance, durability, fault detection, return to service, auto-scaling, cloud readiness, and governance. You'll also will explore several open source, high availability architectures spanning multiple Red Hat technologies, including Red Hat Enterprise Linux, the High Availability and Resilient Storage Add-Ons, and OpenShift by Red Hat.</p>","video_url":"https://www.youtube.com/watch?v=g5xeKuPo8Uw","speakers":"Red Hat Developers","views":"447","likes":"1","video_thumb":"https://i.ytimg.com/vi/g5xeKuPo8Uw/mqdefault.jpg","hours":"1","minutes":"0","seconds":"23","tags":["903","515"],"publish_date":"2014-05-20T03:24:14","path":"/video/youtube/g5xeKuPo8Uw/"},{"title":"DevNation 2014 - James Strachan - Apache Camel in the Clouds","description":"<p>In this talk James Strachan will give an overview of the the two new open source (Apache Licensed) community projects which are core pieces of JBoss Fuse 6.1 and xPaaS.\n\nfabric8 provides the universal integration platform for provisioning, configuration and managing hybrid clouds of integration solutions; whether via JVMs on local machines, with docker, EC2, OpenShift Online or OpenShift Enterprise.\n\nhawtio provides the universal console for JBoss Fuse / fabric8 and for working with Apache Camel, Apache ActiveMQ, Apache CXF, JMX, OSGi, containers and provides a sophisticated wiki and dashboard; all developed as a lightweight HTML5 application using AngularJS and TypeScript.</p>","video_url":"https://www.youtube.com/watch?v=G8Tnn-WE9eM","speakers":"Red Hat Developers","views":"7","likes":"0","video_thumb":"https://i.ytimg.com/vi/G8Tnn-WE9eM/mqdefault.jpg","hours":"1","minutes":"44","seconds":"4","tags":["903"],"publish_date":"2014-05-03T21:36:08","path":"/video/youtube/G8Tnn-WE9eM/"},{"title":"DevNation 2014 - Paul Robinson - Bringing Transactional Guarantees to MongoDB","description":"<p>MongoDB and similar document-based NoSQL datastores tend to offer limited transaction support. And with good reason, as using an ACID (Atomicity, Consistency, Isolation, Durability) transaction to make updates to multiple documents (potentially over multiple resources) can limit scalability.\n\nBut there are alternative transaction models that can be used in favor of removing transactions altogether. In this presentation, you'll see:\n\n* How to use a compensating-transaction approach to provide many of the ACID guarantees without the scalability limitations that an ACID approach could bring.\n* Cases in which ACID transactions might not be appropriate—in particular, why ACID transaction support for multiple document updates is rarely offered in a NoSQL datastore.\n* How to use a compensating transaction as an alternative.\n* How to develop applications that make transactional updates to multiple documents in a MongoDB datastore.\n* How reliability can be built upon the primitives provided by MongoDB and how the middleware can abstract this from the developer.\n\nThe majority of this talk will include a code example that uses the Narayana compensating-transactions API, which greatly simplifies the development of applications that need this transaction model.</p>","video_url":"https://www.youtube.com/watch?v=uOJU5V4N_Ok","speakers":"Red Hat Developers","views":"13","likes":"0","video_thumb":"https://i.ytimg.com/vi/uOJU5V4N_Ok/mqdefault.jpg","hours":"0","minutes":"54","seconds":"7","tags":["903","1223"],"publish_date":"2014-05-04T07:41:56","path":"/video/youtube/uOJU5V4N_Ok/"},{"title":"DevNation 2014 - Slavek Kabrda - DevAssistant: What's in it for You?","description":"<p>DevAssistant is a new project that aims to make developers' lives easier by automating repetitive and time-consuming tasks. It uses assistants—Yaml \"recipe files\"—that contain information on how to create new projects, modify existing projects, and how to set up environments for developing upstream projects.\n\nCome learn more about how DevAssistant can make your job easier, with features such as:\n\n* Dependency installation.\n* Scaffolding source code for new projects or checking out source code from SCM.\n* Setting up environments on a developer's machine.\n\nDevAssistant is written in Python and it features a command line interface and gtk+ GUI.</p>","video_url":"https://www.youtube.com/watch?v=TjqhgI2idNQ","speakers":"Red Hat Developers","views":"35","likes":"0","video_thumb":"https://i.ytimg.com/vi/TjqhgI2idNQ/mqdefault.jpg","hours":"0","minutes":"47","seconds":"31","tags":["903"],"publish_date":"2014-05-04T08:33:26","path":"/video/youtube/TjqhgI2idNQ/"},{"title":"DevNation 2014 - Catherine Robson - User Experience Bootcamp","description":"<p>Do you have to design websites or applications for your company? Do you feel like they just don't compare to apps and websites you regularly use?\n\nLearn how to apply user-centric design principles and visual design basics to bring your applications from bland to beautiful. From mobile to web to applications, these practices will bring your design skills to the next level. We'll cover some guerrilla usability tactics that anyone can do, visual design principles that make any design look cleaner, and how to focus your application around user tasks over system design.</p>","video_url":"https://www.youtube.com/watch?v=E-FK4JHrkZc","speakers":"Red Hat Developers","views":"1","likes":"0","video_thumb":"https://i.ytimg.com/vi/E-FK4JHrkZc/mqdefault.jpg","hours":"1","minutes":"5","seconds":"47","tags":["903"],"publish_date":"2014-05-05T04:46:59","path":"/video/youtube/E-FK4JHrkZc/"},{"title":"DevNation 2014 - Dan Walsh - Secure Linux Containers or 'Dockah Dockah Dockah'","description":"<p>The talk will be covering the basics of containers and explain what is exciting about Docker.\n\nI will explain the underlying technology in Linux Containers used by products like systemd, SELinux Sandbox, and docker. I will also cover new features of cgroups and SELinux as well as explain the process isolation tools provided by Kernel Namespaces.\n\nDocker is not just about containers, but is potentially a new format with which you can distribute your content. Developers in the past have had to either ship their content in RPM or use a home grown install system. Docker is different in that you ship the entire user space with your application.\n\nThe talk will also cover how you can build docker images and how you may distribute them.</p>","video_url":"https://www.youtube.com/watch?v=I0p8FmXpIO8","speakers":"Red Hat Developers","views":"6","likes":"0","video_thumb":"https://i.ytimg.com/vi/I0p8FmXpIO8/mqdefault.jpg","hours":"1","minutes":"1","seconds":"38","tags":["903","105","1335"],"publish_date":"2014-05-05T05:11:03","path":"/video/youtube/I0p8FmXpIO8/"},{"title":"DevNation 2014 - Solomon Hykes et al. - Q&A with the Docker Team","description":"<p>Meet the Docker Team as they hold Q&A with the audience as a panel.</p>","video_url":"https://www.youtube.com/watch?v=7AfGnQ-u2po","speakers":"Red Hat Developers","views":"2","likes":"0","video_thumb":"https://i.ytimg.com/vi/7AfGnQ-u2po/mqdefault.jpg","hours":"1","minutes":"0","seconds":"30","tags":["903","105"],"publish_date":"2014-05-05T05:49:06","path":"/video/youtube/7AfGnQ-u2po/"},{"title":"DevNation 2014 - Pat McDonough - Interactive Big Data Applications with Apache Spark","description":"<p>Hadoop has brought distributed data platforms to the masses, disrupting decades of data storage and processing practices with scalable platforms built on commodity components, conquering the problem of large scale batch processing such as ETL. But solving problems beyond batch on Hadoop has been a challenge from the beginning, and nobody has ever accused Hadoop of being all that easy to use, leading to a plethora of bolt-on tools. Whether trying to write applications using an API that's easy to reason, constructing multi-stage data processing pipelines, processing high throughput streams, delivering interactive experiences to users, processing SQL, or simply trying to take advantage of all the memory on the cluster, the typical Hadoop deployment has become a complex array of somewhat interoperable moving parts.\n\nApache Spark is rapidly becoming the tool of choice to solve a number of these problems with a single framework for fast in-memory computing, and with the second largest community of active developers in Big Data (trailing only Apache Hadoop MapReduce), you can expect it to continue to thrive. Spark has an easy to use API (available in several different languages), shells for interactive analysis, a broad range of libraries from graph processing to machine learning, is compatible with Hadoop-stored data, and can run on Hadoop 2's YARN resource manager or in stand-alone environments. Come learn how you can get started writing Spark applications in just a few easy steps, and bring the power of Spark to your big data platform.</p>","video_url":"https://www.youtube.com/watch?v=i0psWsvCACQ","speakers":"Red Hat Developers","views":"8","likes":"0","video_thumb":"https://i.ytimg.com/vi/i0psWsvCACQ/mqdefault.jpg","hours":"1","minutes":"1","seconds":"57","tags":["903","742","777"],"publish_date":"2014-05-05T14:47:32","path":"/video/youtube/i0psWsvCACQ/"},{"title":"DevNation 2014 - Tim Fox - High-Performance Reactive Applications with Vert.x","description":"<p>Vert.x is a lightweight, high performance, reactive application platform for the JVM that's designed for modern mobile, web, and enterprise applications.\n\nIn this talk you will learn about the design principles and motivation behind Vert.x and why we are heading for a reactive future.\n\nYou will also hear an overview including demonstrations of some of the key features of Vert.x including the distributed event bus which extends right into the browser, high availability, and the module system. Demonstrations will involve examples in Java, JavaScript, Scala, Groovy and Python.\n\nYou'll also learn about how improved build tool and IDE integration simplify the process of developing applications with Vert.x - including short demonstrations of module auto-redeploy from the IDE and executable \"fat jars\".</p>","video_url":"https://www.youtube.com/watch?v=Rdu-NWCuCAY","speakers":"Red Hat Developers","views":"13","likes":"0","video_thumb":"https://i.ytimg.com/vi/Rdu-NWCuCAY/mqdefault.jpg","hours":"0","minutes":"58","seconds":"4","tags":["903","225"],"publish_date":"2014-05-05T15:20:39","path":"/video/youtube/Rdu-NWCuCAY/"},{"title":"DevNation 2014 - Paul Morie - Writing OpenShift Cartridges: The Basics","description":"<p>Cartridges allow developers to provide services running on top of the Red Hat OpenShift Platform-as-a-Service (PaaS). OpenShift already provides cartridges for numerous web application frameworks and databases. Writing your own cartridges allows you to customize or enhance an existing service, or provide new services. Paul Morie is a senior software engineer on the OpenShift core team. In this session, he will discuss best practices for cartridge development and the latest changes in the OpenShift cartridge support.\n\n* Cartridge dependencies and platform expectations\n* Cartridge dependencies and platform expectations\n* Cartridge scripts: stop/start/etc\n* Cartridge tips/hacks\n* Downloadable cartridges\nTools</p>","video_url":"https://www.youtube.com/watch?v=U-0wwrH9ISU","speakers":"Red Hat Developers","views":"3","likes":"0","video_thumb":"https://i.ytimg.com/vi/U-0wwrH9ISU/mqdefault.jpg","hours":"0","minutes":"44","seconds":"12","tags":["903","59"],"publish_date":"2014-05-05T15:37:45","path":"/video/youtube/U-0wwrH9ISU/"},{"title":"DevNation 2014 - Jeff Markham - YARN: Connecting Hadoop and Red Hat JBoss EAP","description":"<p>Come learn how to merge the world's best open source data platform with the world's best open source application server. Until the release of Hadoop 2, traditional application developers have accessed Hadoop as a separate system for external resources and data services. With YARN, you can have much better integration and even add functionality to the application server.\n\nIn this session, you'll learn how YARN brings the power of Hadoop closer to the application developer. It's more than simple deployment to the same hardware; YARN enables an elastic architecture for JBoss Enterprise Application Platform, along with integration with critical Hadoop services and apps like Knox and Storm. Come check out examples of how to build your applications for these apps and services as well as integrate with data services such as Hive on Tez.</p>","video_url":"https://www.youtube.com/watch?v=g9fsCQTKN0M","speakers":"Red Hat Developers","views":"3","likes":"0","video_thumb":"https://i.ytimg.com/vi/g9fsCQTKN0M/mqdefault.jpg","hours":"1","minutes":"1","seconds":"27","tags":["903","1460","738","89","1077"],"publish_date":"2014-05-05T16:05:34","path":"/video/youtube/g9fsCQTKN0M/"},{"title":"DevNation 2014 - Mike Milinkovich - Browser-Based Development and the Internet of Things","description":"<p>The Internet of Things is coming, and open source developer tools and frameworks are starting to take shape to support it. At Eclipse there is a vibrant community working on the protocols, runtimes, frameworks and tools for building IoT applications in languages such as Lua, JavaScript and Java. In this talk, I will be discussing some of these projects such as Paho (MQTT client), Mosquitto (MQTT broker), Kura (Java+OSGi device gateway framework), Mihini (Lua device gateway framework), and others. In addition, I will be using the Orion web-based development tool to demonstrate how you can use your browser to develop IoT applications right on your favorite open hardware device, whether it be a Raspberry Pi, Beagle Bone, or Arduino.</p>","video_url":"https://www.youtube.com/watch?v=QEHZEDLUd9s","speakers":"Red Hat Developers","views":"2","likes":"0","video_thumb":"https://i.ytimg.com/vi/QEHZEDLUd9s/mqdefault.jpg","hours":"0","minutes":"52","seconds":"39","tags":["903","455","1044"],"publish_date":"2014-05-06T05:27:41","path":"/video/youtube/QEHZEDLUd9s/"}]