[{"title":"Get Your Mobile Enterprise Apps to Market Faster","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=a0TmKKakbVo","speakers":"Red Hat Developers","views":"299","likes":"0","video_thumb":"https://i.ytimg.com/vi/a0TmKKakbVo/mqdefault.jpg","hours":"0","minutes":"53","seconds":"35","tags":["1295","838","69"],"publish_date":"2013-10-18T20:31:03","path":"/video/youtube/a0TmKKakbVo/"},{"title":"Webinar: Yankee Research on How New Mobile Platform Approaches Deliver Better Return on Mobility","description":"<p>Watch this ondemand webinar, presented by Steve Drake, VP Business Development and Conor O'Neill, Director of Product Management at FeedHenry as they outline a blueprint for future Mobile Application Platform success that delivers better ROM - based on Yankee Group Research.\n\nHighlights include:\n\n-Mobile shifts from measuring cost to measuring Return on Mobility\n-Why new platform approaches replace legacy MEAP approaches\n-The Blueprint for future Mobile Application Platform Success\n-How new platform architecture & approaches can drive better ROM</p>","video_url":"https://www.youtube.com/watch?v=QkgZcSOq1BA","speakers":"Red Hat Developers","views":"207","likes":"2","video_thumb":"https://i.ytimg.com/vi/QkgZcSOq1BA/mqdefault.jpg","hours":"0","minutes":"58","seconds":"15","tags":["1207","1215","1219","957"],"publish_date":"2014-01-30T18:10:17","path":"/video/youtube/QkgZcSOq1BA/"},{"title":"FeedHenry Mobile App Platform Integration with Airwatch MDM","description":"<p>See first-hand how FeedHenry's integration of the AirWatch's EMM solution gives enterprises secure device management along with the ability to develop, host and manage native, hybrid and HTML5 applications. \n\nAirwatch customers can accelerate development cycles and go to market by deploying apps to the device and server-side code to the cloud -- public, private or hybrid, all in a single push.\n</p>","video_url":"https://www.youtube.com/watch?v=ART7B793YKA","speakers":"Red Hat Developers","views":"562","likes":"1","video_thumb":"https://i.ytimg.com/vi/ART7B793YKA/mqdefault.jpg","hours":"0","minutes":"5","seconds":"22","tags":["1215","1217","957"],"publish_date":"2014-05-23T20:48:48","path":"/video/youtube/ART7B793YKA/"},{"title":"Continuous Integration with Puppet and OpenShift","description":"<p></p>","video_url":"https://www.youtube.com/watch?v=nfxG92HsLTI","speakers":"Red Hat Developers","views":"2398","likes":"14","video_thumb":"https://i.ytimg.com/vi/nfxG92HsLTI/mqdefault.jpg","hours":"0","minutes":"2","seconds":"0","tags":[],"publish_date":"2013-08-22T17:59:02","path":"/video/youtube/nfxG92HsLTI/"},{"title":"The OpenShift Ecosystem: Red Hat Customer Success Stories","description":"<p>Hear directly from Red Hat(R) OpenShift customers and users--CEOs from BitRock, eXo, and Contendo, the EVP of products and technologies at 10gen, the director of Mayflower GmBH, and an information manager at FARO, as well as the CTO and co-founder of Appcelerator. They've all chosen Red Hat OpenShift to simply, easily, and affordably develop, deploy, and manage their enterprise PaaS architecture. The flexibility and open APIs of the Red Hat stack make moving into the cloud simple and sustainable--no matter your line of business or level of expertise.\n\nLearn more about Red Hat OpenShift:\nhttp://openshift.redhat.com/app/\n\nLearn more about Red Hat cloud technology:\nhttp://www.redhat.com/cloud/build/</p>","video_url":"https://www.youtube.com/watch?v=SI30vK-D6L4","speakers":"Red Hat Developers","views":"1657","likes":"6","video_thumb":"https://i.ytimg.com/vi/SI30vK-D6L4/mqdefault.jpg","hours":"0","minutes":"3","seconds":"2","tags":["425","425","59","699","705","876","838","155","59","808","9","825","704","946","69","1027"],"publish_date":"2011-05-05T14:49:24","path":"/video/youtube/SI30vK-D6L4/"},{"title":"FICO builds for the future with Red Hat OpenShift on OpenStack","description":"<p>FICO knows big data analytics, knows that OpenStack® is the future for elastic infrastructure, and knows how to pick an OpenStack partner for its next-generation FICO Analytic Cloud.\n\nClick here to watch the full success story: https://www.youtube.com/watch?v=8TX1OGHd1M0</p>","video_url":"https://www.youtube.com/watch?v=NZPCPSxngyE","speakers":"Red Hat Developers","views":"1125","likes":"3","video_thumb":"https://i.ytimg.com/vi/NZPCPSxngyE/mqdefault.jpg","hours":"0","minutes":"0","seconds":"29","tags":["425","59","838"],"publish_date":"2014-11-04T14:28:08","path":"/video/youtube/NZPCPSxngyE/"},{"title":"Effectively scale by maximizing efficiency through the cloud","description":"<p>Red Hat Consulting helps customers build highly scalable, flexible platforms that enable growth. Watch this video to see how customers grow without time- and resource-intensive IT buildouts or learn more at http://www.redhat.com/consulting.</p>","video_url":"https://www.youtube.com/watch?v=hftmA3CcsU0","speakers":"Red Hat Developers","views":"1086","likes":"6","video_thumb":"https://i.ytimg.com/vi/hftmA3CcsU0/mqdefault.jpg","hours":"0","minutes":"3","seconds":"0","tags":["765","1327","932","863","405"],"publish_date":"2013-11-15T14:00:04","path":"/video/youtube/hftmA3CcsU0/"},{"title":"Appcelerator relies on Red Hat","description":"<p>A private company with approximately 140 employees, Appcelerator worked closely with Red Hat on their flagship platform, Titanium. One of the leading enterprise-grade, cross-platform development solutions on the market, Titanium counts more than 300,000 mobile developers in its worldwide ecosystem. Appcelerator integrated Red Hat's OpenShift PaaS into its Titanium platform, enabling developers to push and auto-scale the backend of their mobile development processes. This integration gives Titanium developers the ability to create, deploy, and manage their mobile applications, and then push these applications to Red Hat's OpenShift PaaS with just a single click.</p>","video_url":"https://www.youtube.com/watch?v=3dCEze_kThY","speakers":"Red Hat Developers","views":"743","likes":"4","video_thumb":"https://i.ytimg.com/vi/3dCEze_kThY/mqdefault.jpg","hours":"0","minutes":"1","seconds":"18","tags":["425","699","706","155"],"publish_date":"2012-07-20T20:43:41","path":"/video/youtube/3dCEze_kThY/"},{"title":"JBoss EAP 7 Management Console Overview","description":"<p>A quick tour of what's new with the JBoss EAP 7 Management Console. New features, how to's, and a recap of advanced operations.</p>","video_url":"https://www.youtube.com/watch?v=K7IRYgzCyjc","speakers":"Red Hat Developers","views":"780","likes":"3","video_thumb":"https://i.ytimg.com/vi/K7IRYgzCyjc/mqdefault.jpg","hours":"0","minutes":"6","seconds":"44","tags":["89","1075","285","425"],"publish_date":"2016-05-02T13:30:35","path":"/video/youtube/K7IRYgzCyjc/"},{"title":"MongoDB and modern agile development","description":"<p>Dwight Merriman, CEO and co-founder of 10gen, discusses the continuing growth of platform-as-a-service (PaaS) and cloud technologies that led to the creation of MongoDB.\n\nMongoDB is an open source SQL database (non-relational)--a resource that scales horizontally on clusters of commodity hardware. MongoDB makes writing software apps easier and faster through cloud computing and resultant changes in database technologies.\n\nMongoDB is a better fit for open source (iterative) software development.  It lends scalability and agility to the development process. OpenShift and PaaS give developers a full stack that can be used to develop and deploy apps without hardware or IT overhead. 10gen's MongoDB is a layer in that stack.\n\nThis short video supports a talk that Red Hat CTO Brian Stevens gave at the 2012 Red Hat Summit. You can view this talk in full:\nhttp://www.youtube.com/watch?v=DDdiS6pvYJg&list=PL995CD1141C3330D5&index=17&feature=plpp_video\n\nWatch more 2012 Red Hat Summit videos:\nhttp://www.youtube.com/playlist?list=PL995CD1141C3330D5</p>","video_url":"https://www.youtube.com/watch?v=g9AYieJp_Vo","speakers":"Red Hat Developers","views":"389","likes":"6","video_thumb":"https://i.ytimg.com/vi/g9AYieJp_Vo/mqdefault.jpg","hours":"0","minutes":"2","seconds":"38","tags":["825","704","425","1297","1223","1014","59","69"],"publish_date":"2012-08-28T20:28:15","path":"/video/youtube/g9AYieJp_Vo/"},{"title":"Red Hat OpenShift Enterprise Use Case Animation","description":"<p>Public Platform-as-a-Service (PaaS) solutions lack the privacy and compliance features needed by enterprises. Learn how OpenShift Enterprise by Red Hat, Red Hat CloudForms, and Red Hat Enterprise Virtulization provide an enterprise PaaS solution and a strategic choice for an open, hybrid cloud. \n\nLearn more about OpenShift Enterprise:\nhttps://www.openshift.com/products/enterprise</p>","video_url":"https://www.youtube.com/watch?v=HB1w6xDyLRs","speakers":"Red Hat Developers","views":"12301","likes":"63","video_thumb":"https://i.ytimg.com/vi/HB1w6xDyLRs/mqdefault.jpg","hours":"0","minutes":"2","seconds":"54","tags":["425","1251"],"publish_date":"2012-12-20T22:30:07","path":"/video/youtube/HB1w6xDyLRs/"},{"title":"2012 Red Hat Summit: Clustered Applications with Red Hat Enterprise Linux 6","description":"<p>In this session, Red Hat's Thomas Cameron and Lon Hohberger will expand upon their 2011 Red Hat Summit presentation, \"Clustering Applications with Red Hat Enterprise Linux.\" Thomas and Lon will discuss the theory and best practice of clustering applications with technologies available in Red Hat Enterprise Linux 6.</p>","video_url":"https://www.youtube.com/watch?v=os9RvkntV10","speakers":"Red Hat Developers","views":"7322","likes":"27","video_thumb":"https://i.ytimg.com/vi/os9RvkntV10/mqdefault.jpg","hours":"0","minutes":"54","seconds":"12","tags":["706","699","1418","706","711"],"publish_date":"2012-07-06T19:06:49","path":"/video/youtube/os9RvkntV10/"},{"title":"Open Sourcing The Enterprise: Ten Years Of Red Hat Enterprise Linux","description":"<p>Red Hat Enterprise Linux transformed enterprise IT, and dramatically changed the software industry forever. By combining the open source development model with a customer-centric subscription based business model, Red Hat gave enterprise customers a way to leverage the value of open source in a way that made sense for them, and that spurred the adoption of Linux across the enterprise. \n\nBut it wasn't  easy. There were doubts and obstacles to overcome, customers and partners to convince, and millions of developers to collaborate with. But with commitment and vision, it all just worked.</p>","video_url":"https://www.youtube.com/watch?v=JiFPH8DBB20","speakers":"Red Hat Developers","views":"10040","likes":"115","video_thumb":"https://i.ytimg.com/vi/JiFPH8DBB20/mqdefault.jpg","hours":"0","minutes":"14","seconds":"36","tags":["575","9"],"publish_date":"2012-05-16T19:27:59","path":"/video/youtube/JiFPH8DBB20/"},{"title":"IT Professionals worldwide are getting certified on Red Hat OpenStack Platform","description":"<p>IT professionals around the world are getting trained and certified by Red Hat on Red Hat Enterprise Linux OpenStack Platform. We met with a few of the Red Hat Certified Professionals to see how they are leveraging the knowledge and skills from the rigorous, hands-on training and exam. An IT professional who has earned the Red Hat Certified System Administrator in Red Hat OpenStack has demonstrated the skills, knowledge, and abilities needed to create, configure, and manage private clouds using Red Hat Enterprise Linux® OpenStack® Platform.\n\nTo learn more about Red Hat Enterprise Linux OpenStack Platform Training and Certification, visit us at www.redhat.com/training/paths/openstack</p>","video_url":"https://www.youtube.com/watch?v=XiiOStU_VAg","speakers":"Red Hat Developers","views":"67543","likes":"28","video_thumb":"https://i.ytimg.com/vi/XiiOStU_VAg/mqdefault.jpg","hours":"0","minutes":"1","seconds":"49","tags":["425","1299"],"publish_date":"2014-04-11T22:50:28","path":"/video/youtube/XiiOStU_VAg/"},{"title":"Red Hat OpenShift flex demo","description":"<p>Isaac Roth from Red Hat discusses the way developers can use OpenShift flex to self-service deploy applications in minutes, choose and manage operating environments, and share and monitor information and functionality.\n\nWatch as Roth demonstrates OpenShift actions, deployments, and measures through the management interface. \n\nLearn more about Red Hat OpenShift:\nhttp://openshift.redhat.com/app/\n\nLearn more about Red Hat cloud technology:\nhttp://www.redhat.com/cloud/build/</p>","video_url":"https://www.youtube.com/watch?v=QRwtcfaQnBM","speakers":"Red Hat Developers","views":"3625","likes":"10","video_thumb":"https://i.ytimg.com/vi/QRwtcfaQnBM/mqdefault.jpg","hours":"0","minutes":"3","seconds":"36","tags":["59","964","425","425","155","89","69","838","876","59","808","850","1027","1117","890","1329"],"publish_date":"2011-05-05T17:39:41","path":"/video/youtube/QRwtcfaQnBM/"},{"title":"Red Hat Taste of Training: Managing SELinux modes on your system","description":"<p>Using content from our Red Hat® System Administration II (RH134) course, this Taste of Red Hat Training video will show you how to manage SELinux modes on your system.\n\nIn the complete, 4-day course, Red Hat System Administration II focuses on the key tasks needed to become a full time Linux® administrator. It is part II of the core system administration tasks needed for Red Hat Enterprise Linux 7 and is the follow-on to Red Hat System Administration I (RH124). This course goes deeper into enterprise Linux administration including file systems and partitioning, logical volumes, SELinux, firewalling, and troubleshooting. Attending both Red Hat System Administration I and Red Hat System Administration II can help you in your preparation for the Red Hat Certified System Administrator Exam (EX200).</p>","video_url":"https://www.youtube.com/watch?v=glMCvo_V25E","speakers":"Red Hat Developers","views":"32346","likes":"23","video_thumb":"https://i.ytimg.com/vi/glMCvo_V25E/mqdefault.jpg","hours":"0","minutes":"6","seconds":"3","tags":["425"],"publish_date":"2014-07-22T17:19:45","path":"/video/youtube/glMCvo_V25E/"},{"title":"How to Build Drag and Drop App Forms in Minutes on FeedHenry3","description":"<p>Create a mobile forms app in minutes, no coding skills required. Forms-based apps are easily created and highly effective effective means of replacing paper or electronic- forms allowing businesses of all types to capture data via smartphones.</p>","video_url":"https://www.youtube.com/watch?v=j3mVttn1zEs","speakers":"Red Hat Developers","views":"1685","likes":"3","video_thumb":"https://i.ytimg.com/vi/j3mVttn1zEs/mqdefault.jpg","hours":"0","minutes":"5","seconds":"56","tags":["1217","957"],"publish_date":"2014-05-23T20:53:42","path":"/video/youtube/j3mVttn1zEs/"},{"title":"2012 Red Hat Summit: How Red Hat OpenShift Achieves Multi-Tenancy in the Cloud","description":"<p>Come learn about what goes on behind the scenes with Red Hat OpenShift and the implications of having all of a project's operations running entirely in the public cloud.\n\nBrett Lentz, senior software engineer at Red Hat, will cover the tools, design patterns, and security considerations that are critical to make operating in the public cloud a success. He will also spend a significant part of the session discussing configuration management and automation techniques as they are key factors for success in the OpenShift environment.\n\nLiving in the public cloud has significant security implications that will be discussed in depth. Tools and concepts such as SELinux, update lifecycle management, and \"SSL/TLS Everywhere\" are not just good ideas, but crucial to succeeding in the public cloud. Brett will cover tools and techniques for easing the integration of these and other security tools.\n\nBrett will also discuss how identifying powerful, reusable design patterns has allowed the OpenShift team to find efficiencies, enabling it to move at a rapid pace and not just put out fires, but to continually roll out new features and incremental functionality improvements.</p>","video_url":"https://www.youtube.com/watch?v=XApQFrSmkJ4","speakers":"Red Hat Developers","views":"525","likes":"1","video_thumb":"https://i.ytimg.com/vi/XApQFrSmkJ4/mqdefault.jpg","hours":"0","minutes":"44","seconds":"9","tags":["706","699","1418","711"],"publish_date":"2012-07-06T16:11:10","path":"/video/youtube/XApQFrSmkJ4/"},{"title":"2012 Red Hat Summit: Red Hat Enterprise Linux 6 AD Integration/Samba Clusters Overview","description":"<p>In this two-part session, Mark Heslin will review the various concepts, components, and configuration options available for integrating the mission-critical readiness of Red Hat Enterprise Linux 6 into Active Directory domain environments. Emphasis will be placed on understanding the pros and cons of each approach, best practices, and guidelines for selecting the best configuration.</p>","video_url":"https://www.youtube.com/watch?v=iCXVqvcxa84","speakers":"Red Hat Developers","views":"3779","likes":"11","video_thumb":"https://i.ytimg.com/vi/iCXVqvcxa84/mqdefault.jpg","hours":"1","minutes":"0","seconds":"40","tags":["706","699","1418","703","711"],"publish_date":"2012-07-06T16:44:33","path":"/video/youtube/iCXVqvcxa84/"},{"title":"FeedHenry and Telefonica Digital: Where Mobile Meets Cloud","description":"<p>Telefónica offers FeedHenry's cloud-based mobile application platform alongside its Instant Servers enterprise-grade Infrastructure-as--a-Service solution, which is optimized for mobile and M2M applications.</p>","video_url":"https://www.youtube.com/watch?v=a-Il6SXduzk","speakers":"Red Hat Developers","views":"116","likes":"2","video_thumb":"https://i.ytimg.com/vi/a-Il6SXduzk/mqdefault.jpg","hours":"0","minutes":"2","seconds":"57","tags":["1217","957"],"publish_date":"2014-05-27T13:19:10","path":"/video/youtube/a-Il6SXduzk/"},{"title":"How code makes it into Red Hat Enterprise Linux","description":"<p>Ever wonder how great features make it from the community into enterprise-ready technology like Red Hat(R) Enterprise Linu(R)?\n\nFedora Project Leader Paul Friends explains how projects started upstream gain in popularity and maturity, are hardened and tested, and eventually make their way to enterprise solutions.\n\nLearn more about the Fedora Project:\nhttp://fedoraproject.org/</p>","video_url":"https://www.youtube.com/watch?v=xu81frqUtlc","speakers":"Red Hat Developers","views":"17332","likes":"56","video_thumb":"https://i.ytimg.com/vi/xu81frqUtlc/mqdefault.jpg","hours":"0","minutes":"1","seconds":"56","tags":["425","425","575","155","59","808","850","955","843","425","575","9","1344","435"],"publish_date":"2009-10-12T20:56:44","path":"/video/youtube/xu81frqUtlc/"},{"title":"2012 Red Hat Summit: Red Hat Enterprise Virtualization overview","description":"<p>In this session from the 2012 Red Hat Summit, Andrew Cathrow, product manager, and Chuck Dubuque, product marketing manager for Red Hat Enterprise Virtualization. They discuss Red Hat virtualization, including Red Hat Enterprise Virtualization 3, and the past, present, and future of virtualization technology.\n\nDubuque discusses the current environment, including virtualization competitor VMware, and the opportunity that a second source for virtualization--a open standards source--offers.\n\nHe then offers details about Red Hat Enterprise Virtualization, including information about management features, hypervisor technology, specVIRT success, and opportunities for cost savings.\n\nCathow then joins in to talk about development of Red Hat Enterprise Virtualization 3 and 3.1, and the growth of the communities surrounding it, including Fedora and oVirt.\n\nCathow highlights features and changes in Red Hat Enteprise Virtualization, including:\n \n- OpenJDK requirement for proprietary Oracle JRE is eliminated.\n\n-  Support for Jasper 4.7 and two new directory servers\n\n- Scalability to 160 Virtual CPUs per VM and 2T virtual RAM per VM\n\n- enhanced physical to virtual migration (P2V)\n\n- Live snapshots\n\n- Shared disks\n\n- SDK availability\n\n- new top-level manager for managing disks\n\n- direct LUN access \n\nCathow details many other system and version features, including a overview of key technologies for future versions of Red Hat Enterprise Virtualization and Red Hat Enterprise Linux. He also intermittantly takes questions from the audience.\n\nWatch more 2012 Red Hat Summit and JBoss World videos from Red Hat:\nhttp://www.youtube.com/playlist?list=PL995CD1141C3330D5&feature=plcp</p>","video_url":"https://www.youtube.com/watch?v=Zdlyhhm-DdE","speakers":"Red Hat Developers","views":"7263","likes":"17","video_thumb":"https://i.ytimg.com/vi/Zdlyhhm-DdE/mqdefault.jpg","hours":"0","minutes":"52","seconds":"22","tags":["706","425","425","699","575","876","1027","59","1314","726","836","585","1149","1071"],"publish_date":"2012-06-28T17:48:11","path":"/video/youtube/Zdlyhhm-DdE/"},{"title":"FICO Analytic Cloud brings analytics to the masses with OpenShift Enterprise by Red Hat","description":"<p>FICO, a data analytics software company, wanted to diversify into new markets its core offering of providing on-premise software to major corporations. To do this, the company launched the FICO Analytic Cloud, a cloud delivery channel that enables FICO to serve organizations of all sizes. The FICO Analytic Cloud was first launched in 2013 and provides Platform-as-a-Service (PaaS) access to the FICO Decision Management Platform, which allows customers to use FICO tools and technology to create, customize, and deploy applications and services. The Decision Management Platform is built on OpenShift Enterprise by Red Hat, which provides the PaaS tools and support FICO needed to rapidly scale the platform and Analytic Cloud.</p>","video_url":"https://www.youtube.com/watch?v=8TX1OGHd1M0","speakers":"Red Hat Developers","views":"17077","likes":"19","video_thumb":"https://i.ytimg.com/vi/8TX1OGHd1M0/mqdefault.jpg","hours":"0","minutes":"2","seconds":"52","tags":["69"],"publish_date":"2014-10-20T14:45:33","path":"/video/youtube/8TX1OGHd1M0/"},{"title":"Red Hat gives Adobe a flexible IT canvas","description":"<p>Adobe Systems, a long-time user of Red Hat® Enterprise Linux®, wanted to offer its enterprise customers easy access to sandbox resources to evaluate and prototype solutions using Adobe products.\n\nTurning to the cloud, Adobe used Red Hat Enterprise Linux and Amazon Web Services (AWS) to not only deliver a sandbox solution, but also to offer customers a Software- as-a-Service (SaaS) option for deploying Adobe-based solutions.\n\nToday, Adobe is using the Red Hat platform and Amazon Web Services to help customers simplify deployment, lower cost of ownership, and accelerate time to value.</p>","video_url":"https://www.youtube.com/watch?v=T34zjdniO_8","speakers":"Red Hat Developers","views":"19240","likes":"36","video_thumb":"https://i.ytimg.com/vi/T34zjdniO_8/mqdefault.jpg","hours":"0","minutes":"3","seconds":"18","tags":["838","425","155","876","724","1319","9","1202"],"publish_date":"2013-07-05T16:28:18","path":"/video/youtube/T34zjdniO_8/"},{"title":"Red Hat and Cisco: The future is open","description":"<p>Companies around the world are turning to the Cisco Unified Computing System (Cisco UCS) and Red Hat Enterprise Linux OpenStack Platform to simplify the process of building cloud infrastructure. Learn how these two leading companies are paving way to an open cloud.\n\nLearn more about Red Hat Enterprise Linux OpenStack Platform: www.redhat.com/openstack</p>","video_url":"https://www.youtube.com/watch?v=By7q5fZ6XW8","speakers":"Red Hat Developers","views":"1852","likes":"19","video_thumb":"https://i.ytimg.com/vi/By7q5fZ6XW8/mqdefault.jpg","hours":"0","minutes":"1","seconds":"47","tags":["425","837","155","838"],"publish_date":"2013-10-16T13:46:02","path":"/video/youtube/By7q5fZ6XW8/"},{"title":"Coming May 15, 2012: Celebrate 10 years of Red Hat Enterprise Linux","description":"<p>Join Red Hat on May 15, 2012 to celebrate 10 years of Red Hat Enterprise Linux</p>","video_url":"https://www.youtube.com/watch?v=zr6ygypaRCg","speakers":"Red Hat Developers","views":"1334","likes":"17","video_thumb":"https://i.ytimg.com/vi/zr6ygypaRCg/mqdefault.jpg","hours":"0","minutes":"1","seconds":"18","tags":["425","575"],"publish_date":"2012-05-04T13:38:59","path":"/video/youtube/zr6ygypaRCg/"},{"title":"Product Overviews: Using Systemtap","description":"<p>Principal Software Engineer Will Cohen gives an overview of SystemTap, including how it works, setting up SystemTap, common techniques, and some example scripts including IO statistics, process polling, page faults and user space probing.\n\nsourceware.org/systemtap\n\nSystemTap Beginner's Guide - http://red.ht/J5I8g7\n\nSee our Groups if you want to post a SystemTap question (requires subscription) - http://red.ht/K0kCA7\n\nInstrumenting the Linux kernel with SystemTap (requires subscription) - http://red.ht/HYFfz8</p>","video_url":"https://www.youtube.com/watch?v=nRehkd22j78","speakers":"Red Hat Developers","views":"4170","likes":"20","video_thumb":"https://i.ytimg.com/vi/nRehkd22j78/mqdefault.jpg","hours":"0","minutes":"36","seconds":"34","tags":["1241","1336","625","435","890"],"publish_date":"2012-05-10T20:16:05","path":"/video/youtube/nRehkd22j78/"},{"title":"Secure-24 partners with Red Hat to support billion-dollar entities","description":"<p>Secure-24, a Red Hat Certified Cloud Provider, partners with Red Hat to ensure stability, scalability and security with Red Hat Enterprise Linux, Red Hat JBoss Middleware, and Red Hat Satellite.</p>","video_url":"https://www.youtube.com/watch?v=wfoXPiU_sn0","speakers":"Red Hat Developers","views":"762","likes":"7","video_thumb":"https://i.ytimg.com/vi/wfoXPiU_sn0/mqdefault.jpg","hours":"0","minutes":"2","seconds":"25","tags":["9","1075","425","1292"],"publish_date":"2014-04-29T19:32:40","path":"/video/youtube/wfoXPiU_sn0/"},{"title":"JBoss Platform-as-a-Service (PaaS)","description":"<p>jboss.org/​webinars\n\nJBoss AS7 is fast, lean, flexible and the ideal engine to run in cloud deployments, especially when combined with the Red Hat PaaS offering - OpenShift.\n\nIn this deep dive presentation, Scott and Tobias will guide you through a number of scenarios from the initial cloud experience to more involved deployment and scaling strategies. We'll demonstrate how OpenShift's Express and Flex differ, how quickly and easily applications are deployed, how and when visibility into the application's performance matter, and finally how PaaS can scale and right-size your application dynamically.\n\nPresenter Bios:\nScott Stark - As one of the original JBoss founding fathers and current VP of Architecture, Scott has been instrumental in leading overall R&D efforts. Most recently, Scott has been the key architect to bring JBoss AS7 to OpenShift Express and Flex.\n\nTobias Kunze - As co-founder and former CTO of Makara, Tobias is now driving the technical vision behind Red Hat's PaaS strategy with his continuing passion for cloud, web development, and high-performance computing. Prior to co-founding Makara, Tobias ran development and operations for Lycos' price comparison franchise, serving many tier-1 clients such as AOL, Yahoo!, and T-Online. Before that, he served in lead technical roles at many innovative web and media companies.</p>","video_url":"https://www.youtube.com/watch?v=lH0zBruo0os","speakers":"Red Hat Developers","views":"897","likes":"1","video_thumb":"https://i.ytimg.com/vi/lH0zBruo0os/mqdefault.jpg","hours":"1","minutes":"10","seconds":"53","tags":["89","1092","838","925","69","59"],"publish_date":"2011-10-21T14:41:55","path":"/video/youtube/lH0zBruo0os/"},{"title":"2012 Red Hat Summit: Part 2; Performance Analysis & Tuning of Red Hat Enterprise Linux","description":"<p>In this two-hour session, Douglas Shakshober (Shak) and Larry Woodman will explore the system performance analysis and tuning necessary to maximize the performance of systems running Red Hat Enterprise Linux 5 and 6. They will focus on large systems that run the most common applications such as database servers, Internet servers, and various financial applications on a variety of the common hardware platforms.</p>","video_url":"https://www.youtube.com/watch?v=km-vLELmWLs","speakers":"Red Hat Developers","views":"3690","likes":"10","video_thumb":"https://i.ytimg.com/vi/km-vLELmWLs/mqdefault.jpg","hours":"1","minutes":"0","seconds":"9","tags":["706","699","773","711"],"publish_date":"2012-07-06T18:35:59","path":"/video/youtube/km-vLELmWLs/"},{"title":"Red Hat OpenShift express demo","description":"<p>Mike McGrath, a cloud architect at Red Hat, speaks about the OpenShift project, including express--a way to easily on-board PHP, Ruby, and Python applications via standard, open interfaces.\n\nMcGrath demonstrates the process of uploading and updating the applications in the cloud using express, as well as ways to snapshot, clean up, and remove applications that are being migrated or eliminated. \n\nLearn more about Red Hat OpenShift:\nhttp://openshift.redhat.com/app/\n\nLearn more about Red Hat cloud technology:\nhttp://www.redhat.com/cloud/build/</p>","video_url":"https://www.youtube.com/watch?v=4B_V_St4fAc","speakers":"Red Hat Developers","views":"3881","likes":"15","video_thumb":"https://i.ytimg.com/vi/4B_V_St4fAc/mqdefault.jpg","hours":"0","minutes":"2","seconds":"58","tags":["59","948","838","752","425","425","89","59","808","155","1079","635","745","876","891","685","465","485","475","990","749"],"publish_date":"2011-05-05T17:51:47","path":"/video/youtube/4B_V_St4fAc/"},{"title":"RHEL6: Performance highlights","description":"<p>Mission-critical RAS capabilities on Intel hardware. Applications that run best on Red Hat Enterprise Linux. Scalability, flexibility, reliability. All these factors contribute to the highest levels of performance made possible with Red Hat Enterprise Linux 6. Hear our partners--IBM, HP, Dell, BMC, and more--explain why.</p>","video_url":"https://www.youtube.com/watch?v=WNPNJE5dxU0","speakers":"Red Hat Developers","views":"2853","likes":"4","video_thumb":"https://i.ytimg.com/vi/WNPNJE5dxU0/mqdefault.jpg","hours":"0","minutes":"2","seconds":"36","tags":["876","838","1307","425","575","155","837","1028","465","1321","792"],"publish_date":"2010-12-01T19:02:19","path":"/video/youtube/WNPNJE5dxU0/"},{"title":"Manage IT resources with cgroups (demo)","description":"<p>Senior Software Maintenance Engineer Neil Horman from Red Hat demonstrates cgroups, a generic mechanism the kernel provides for grouping of processes and applying controls to those groups. The grouping is done via a virtual filesystem called 'cgroup.' Within this filesytem, each directory defines a new group. \n\nTunables within a cgroup are provided by what the kernel calls 'controllers.' Each controller is able to expose one or more tunable or control. When mounting the cgroups filesystem, it is possible to mount the filesystem several times, with each mount point having a different set of (non-overlapping) controllers. The key idea is that this allows the administrator to construct differing group hierarchies for different sets of controllers/tunables, which offers new ways to control and manage cloud resources.\n\nSee what else is new in Red Hat Enterprise Linux 6:\nhttp://www.redhat.com/rhel/server/details/</p>","video_url":"https://www.youtube.com/watch?v=KX5QV4LId_c","speakers":"Red Hat Developers","views":"3496","likes":"28","video_thumb":"https://i.ytimg.com/vi/KX5QV4LId_c/mqdefault.jpg","hours":"0","minutes":"3","seconds":"5","tags":["155","425","425","425","745","1304","749","932","718","747","1084","733","9","838","876"],"publish_date":"2010-07-01T19:02:47","path":"/video/youtube/KX5QV4LId_c/"},{"title":"NUMA Programming on Red Hat Enterprise Linux 6, Pt 1 - Introduction to NUMA","description":"<p>In part one of this five part series on NUMA programming, Curriculum Manager George Hacker discusses NUMA concepts and terms, CLI support for NUMA, and systems calls that support NUMA.\n\nAdditional videos in the NUMA series are available to subscribers here: http://red.ht/O9bkS1.\n\nPlan | Deploy | Connect - http://red.ht/I0Ravb\n\nAlready a subscriber? Join the Red Hat Developer's Program discussion here: http://red.ht/K0kCA7</p>","video_url":"https://www.youtube.com/watch?v=YXYw8I8ZVYw","speakers":"Red Hat Developers","views":"2238","likes":"18","video_thumb":"https://i.ytimg.com/vi/YXYw8I8ZVYw/mqdefault.jpg","hours":"0","minutes":"6","seconds":"41","tags":["435","425"],"publish_date":"2012-09-12T13:22:23","path":"/video/youtube/YXYw8I8ZVYw/"},{"title":"Red Hat Enterprise Linux stability and reliability","description":"<p>How do you modernize your datacenter while maintaining the integrity of your current system? Red Hat Enterprise Linux offers stability and reliability on a single, open platform, so you can focus on the projects that add value to your business.</p>","video_url":"https://www.youtube.com/watch?v=NT9vNXOuPDo","speakers":"Red Hat Developers","views":"1627","likes":"6","video_thumb":"https://i.ytimg.com/vi/NT9vNXOuPDo/mqdefault.jpg","hours":"0","minutes":"2","seconds":"44","tags":["9"],"publish_date":"2014-04-14T19:32:13","path":"/video/youtube/NT9vNXOuPDo/"},{"title":"Red Hat Enterprise Linux 7 - Docker Overview","description":"<p>In this demo, Scott Collier shows how to use Docker containers (the contents of an image and its features) to cat out contents of /etc/host, launch a web server, and bindmounting log files to see activity on host machines.</p>","video_url":"https://www.youtube.com/watch?v=3-i4zOAhBCo","speakers":"Red Hat Developers","views":"4078","likes":"22","video_thumb":"https://i.ytimg.com/vi/3-i4zOAhBCo/mqdefault.jpg","hours":"0","minutes":"5","seconds":"16","tags":["425","575","1308","105","39"],"publish_date":"2014-06-10T14:30:02","path":"/video/youtube/3-i4zOAhBCo/"},{"title":"Red Hat Enterprise Linux installer -- Active Directory domain","description":"<p>The installer for Red Hat Enterprise Linux is changing to dramatically improve the installation experience. \n\nSee a demo of a few installation scenarios to learn about the more streamlined and responsive installer, which guides new users quickly through typical set-up steps.</p>","video_url":"https://www.youtube.com/watch?v=hzppdVKckPQ","speakers":"Red Hat Developers","views":"8088","likes":"6","video_thumb":"https://i.ytimg.com/vi/hzppdVKckPQ/mqdefault.jpg","hours":"0","minutes":"3","seconds":"13","tags":["425","890"],"publish_date":"2014-06-10T14:50:22","path":"/video/youtube/hzppdVKckPQ/"},{"title":"DAA Mobile App","description":"<p>Dublin Airport Authority mobile app demonstrates the power of an app to help airport visitors navigate though the airport and receive important status updates on flight arrivals/departures, security queue and baggage wait times as well as car park booking and tagging, retail offers at airport stores and more.</p>","video_url":"https://www.youtube.com/watch?v=MP0Tqf-cA9o","speakers":"Red Hat Developers","views":"894","likes":"5","video_thumb":"https://i.ytimg.com/vi/MP0Tqf-cA9o/mqdefault.jpg","hours":"0","minutes":"2","seconds":"23","tags":["1215"],"publish_date":"2015-04-13T13:29:40","path":"/video/youtube/MP0Tqf-cA9o/"},{"title":"API Mapper & Forms Data Sources","description":"<p>In this video we use two new Red Hat Mobile Application Platform features—the API Mapper and Data Sources—to retrieve valid form options from the response of an API without writing any code. \n\nLearn more: redhat.com/en/technologies/mobile</p>","video_url":"https://www.youtube.com/watch?v=i5V5kRFUyxI","speakers":"Red Hat Developers","views":"280","likes":"3","video_thumb":"https://i.ytimg.com/vi/i5V5kRFUyxI/mqdefault.jpg","hours":"0","minutes":"6","seconds":"29","tags":["1148","1295","425"],"publish_date":"2016-05-05T14:28:21","path":"/video/youtube/i5V5kRFUyxI/"},{"title":"2012 Red Hat Summit: Build a PaaS using Open Source Software","description":"<p>Join Red Hat OpenShift developers Krishna Raman and Dan McPherson for an interactive whiteboard, slide, and demo session where they will dive into OpenShift's architecture, internal components, APIs, and security model. If you are a systems architect interested in learning what it takes to build a Platform-as-a-Service (PaaS), this talk is for you. Curious about the code that powers OpenShift and what it takes to run a scalable and secure PaaS? This is the talk for you!</p>","video_url":"https://www.youtube.com/watch?v=ex1I3_VUjDE","speakers":"Red Hat Developers","views":"798","likes":"5","video_thumb":"https://i.ytimg.com/vi/ex1I3_VUjDE/mqdefault.jpg","hours":"0","minutes":"53","seconds":"11","tags":["706","699","773","705","711"],"publish_date":"2012-07-06T17:56:21","path":"/video/youtube/ex1I3_VUjDE/"},{"title":"Systemd Service & Resource Management in Red Hat Enterprise Linux","description":"<p>A new system management featured called systemd can help you better manage your servers with improved boot times, simplified syntax, and backwards compatibility with existing initialization scripts. \n\nSee a demo of custom script migration to help you get familiar with new systemd utilities and commands.</p>","video_url":"https://www.youtube.com/watch?v=-25oWssr9WI","speakers":"Red Hat Developers","views":"4007","likes":"21","video_thumb":"https://i.ytimg.com/vi/-25oWssr9WI/mqdefault.jpg","hours":"0","minutes":"3","seconds":"25","tags":["425"],"publish_date":"2014-06-10T14:30:01","path":"/video/youtube/-25oWssr9WI/"},{"title":"Deploying Oracle databases in Linux containers","description":"<p>This is a demonstration of Oracle databases being deployed with Red Hat Enterprise Linux using Linux containers. The demo also goes into comparing container deployments to more traditional bare-metal and virtual machine deployment scenario and discusses the benefits. See how Red Hat Enterprise Linux enables your database environments to stay both flexible and current by utilizing Linux container technologies for deploying Oracle 11gR2 on RHEL 6, Oracle 12c on RHEL 6, and Oracle 12c on RHEL 7.</p>","video_url":"https://www.youtube.com/watch?v=yCzNCYQvEtI","speakers":"Red Hat Developers","views":"2758","likes":"10","video_thumb":"https://i.ytimg.com/vi/yCzNCYQvEtI/mqdefault.jpg","hours":"0","minutes":"3","seconds":"4","tags":["155","1227"],"publish_date":"2014-10-22T20:22:01","path":"/video/youtube/yCzNCYQvEtI/"},{"title":"Fedora 14: Fedora to Red Hat Enterprise Linux","description":"<p>Putting technology in front of a wide audience quickly is part of the open source model, as seen in the 'release early, release often' mantra popular among open source developers. This community collaboration results in more feedback about feature functionality, and more opportunities for developers to continually improve code.\n\nRed Hat participates in this process as part of the Fedora community, and its contributions to Fedora help enhance the technology selected by Fedora's substantial user and contributor base. Fedora and Red Hat create a more scalable, extensible, and interoperable Red Hat Enterprise Linux.\n\nRead more: http://press.redhat.com/2010/10/21/fedora-14-reflects-evolution-of-leading-edge-open-source/</p>","video_url":"https://www.youtube.com/watch?v=F06oSxyy1v4","speakers":"Red Hat Developers","views":"1666","likes":"7","video_thumb":"https://i.ytimg.com/vi/F06oSxyy1v4/mqdefault.jpg","hours":"0","minutes":"3","seconds":"20","tags":["955","425","9","155","59","808","932","1344"],"publish_date":"2010-11-09T15:29:55","path":"/video/youtube/F06oSxyy1v4/"},{"title":"2014 Red Hat Summit: Introduction to Red Hat Enterprise Linux OpenStack Platform","description":"<p>In this session, Rhys Oxenham talks about Red Hat Enterprise Linux OpenStack Platform, a highly scalable Infrastructure-as-a-Service (IaaS) solution, from the ground up. We'll start from the traditional datacenter virtualization perspective and move through to the platform that enables scale-out, fault-tolerant workloads.\n\nYou'll also learn about the major components in the OpenStack Havana release cycle, how they fit together, and how they can be used to create an IaaS cloud platform. You'll see a basic demonstration of the key workflows that an end user would experience and learn how they can administer OpenStack environments.\n\nThis session was part of the Cloud Readiness track.\n\nhttp://www.redhat.com/summit</p>","video_url":"https://www.youtube.com/watch?v=Yjgyk0yGyrs","speakers":"Red Hat Developers","views":"10869","likes":"64","video_thumb":"https://i.ytimg.com/vi/Yjgyk0yGyrs/mqdefault.jpg","hours":"0","minutes":"45","seconds":"36","tags":["425","699"],"publish_date":"2014-04-16T06:03:24","path":"/video/youtube/Yjgyk0yGyrs/"},{"title":"Managing Red Hat Enterprise Linux OpenStack Platform","description":"<p>Your business needs more than just a great cloud infrastructure built with OpenStack®. You need features like self-service provisioning with policies, chargeback/showback, quota enforcement, and capacity and utilization reporting. Red Hat® CloudForms delivers the cloud management capabilities needed to effectively manage workloads throughout their life cycle, including retirement and reclamation. In addition to OpenStack, CloudForms unifies the management of multiple other infrastructure platforms, such as VMware vSphere, Red Hat Enterprise Virtualization, and Amazon AWS, through a \"single pane of glass\" interface.\n\nTo learn more about Red Hat CloudForms, please visit \nwww.redhat.com/cloudforms</p>","video_url":"https://www.youtube.com/watch?v=c7XBlgeTOVE","speakers":"Red Hat Developers","views":"17768","likes":"19","video_thumb":"https://i.ytimg.com/vi/c7XBlgeTOVE/mqdefault.jpg","hours":"0","minutes":"2","seconds":"20","tags":["425","838"],"publish_date":"2013-11-05T14:00:04","path":"/video/youtube/c7XBlgeTOVE/"},{"title":"Standardize on Red Hat Enterprise Linux","description":"<p>When is free Linux more expensive?  When you have an enterprise to run.\n\nEvery IT organization is looking for ways to be more efficient.  What you may not realize is that pieces of your infrastructure like community Linux are actually making your job more difficult.  Red Hat can help.\n\nThis video demonstrates how standardizing on Red Hat Enterprise Linux can save your organization money and make you more productive and more efficient.</p>","video_url":"https://www.youtube.com/watch?v=gN9IIsDWIkY","speakers":"Red Hat Developers","views":"83694","likes":"77","video_thumb":"https://i.ytimg.com/vi/gN9IIsDWIkY/mqdefault.jpg","hours":"0","minutes":"2","seconds":"48","tags":["9","575"],"publish_date":"2012-07-20T14:17:00","path":"/video/youtube/gN9IIsDWIkY/"},{"title":"Deploying Red Hat Enterprise Linux OpenStack Platform with Packstack and Foreman","description":"<p>In this hands-on taste of training from Red Hat's premiere OpenStack course: Red Hat Enterprise Linux OpenStack Platform Administration featuring Rob Locke and Forrest Taylor, you'll:\n\nDeploy Red Hat Enterprise Linux OpenStack Platform using 2 automated tools: Packstack and Foreman. \nDiscover the command-line tool Packstack as you deploy Red Hat Enterprise Linux OpenStack Platform in an all-in-one scenario.\nExplore the web interface Foreman as you deploy a controller node and a compute node.</p>","video_url":"https://www.youtube.com/watch?v=D2exHEGdcEA","speakers":"Red Hat Developers","views":"6271","likes":"17","video_thumb":"https://i.ytimg.com/vi/D2exHEGdcEA/mqdefault.jpg","hours":"1","minutes":"20","seconds":"0","tags":[],"publish_date":"2014-05-16T21:03:59","path":"/video/youtube/D2exHEGdcEA/"},{"title":"Deploy applications in a Linux container with Red Hat JBoss EAP","description":"<p>Red Hat® JBoss® Enterprise Application Platform (EAP) allows you to quickly deploy JavaEE-compliant applications on top of Red Hat Enterprise Linux. By utilizing Linux containers you can create a consistent environment for running EAP that will include all necessary application dependencies, like OpenJDK and any Java applications that you need to deploy or distribute. This demonstration provides step-by-step instructions on how to set up such configurations.</p>","video_url":"https://www.youtube.com/watch?v=CoTz7dRoldk","speakers":"Red Hat Developers","views":"2631","likes":"10","video_thumb":"https://i.ytimg.com/vi/CoTz7dRoldk/mqdefault.jpg","hours":"0","minutes":"3","seconds":"31","tags":["575","155","1077","285"],"publish_date":"2015-01-13T19:32:21","path":"/video/youtube/CoTz7dRoldk/"},{"title":"Conquer IT Costs","description":"<p>Learn how a transition to Red Hat Enterprise Linux can reduce costly downtime, migration time, and total cost of ownership in your organization.</p>","video_url":"https://www.youtube.com/watch?v=ocHfRfsRiRY","speakers":"Red Hat Developers","views":"2020","likes":"10","video_thumb":"https://i.ytimg.com/vi/ocHfRfsRiRY/mqdefault.jpg","hours":"0","minutes":"3","seconds":"37","tags":[],"publish_date":"2014-04-14T19:32:40","path":"/video/youtube/ocHfRfsRiRY/"},{"title":"Linux containers and application isolation - Using Cockpit with Docker","description":"<p>The Linux container technology in Red Hat Enterprise Linux now combines resource management, process isolation, and file system separation. Docker uses the Linux container capabilities to provide standardization, ease of use, and portability.\n\nSee a demo of how to set up multiple containers, deploying an assortment of workloads, and measuring the performance impact of running them at the same time using prototype user interface.</p>","video_url":"https://www.youtube.com/watch?v=XAvothXoGRs","speakers":"Red Hat Developers","views":"999","likes":"6","video_thumb":"https://i.ytimg.com/vi/XAvothXoGRs/mqdefault.jpg","hours":"0","minutes":"3","seconds":"20","tags":["105","155"],"publish_date":"2014-06-10T14:30:02","path":"/video/youtube/XAvothXoGRs/"}]