[
  {
    "title": "Red Hat Mobile Application Platform + OpenShift Online",
    "description": "<p>For this session we have John Frizelle presenting Red Hat's Mobile platform. \n\n\n== Abstract == \n\nA walk-through of the features of the Red Hat Mobile Application Platform (RHMAP) and how to use the OpenShift Online PaaS as a Mobile Backend as a Service (MBaaS) for RHMAP. During the walkthrough, we will look at creating mobile applications, deploying Node.js microservices as well as local development, testing and deployment.\n\nThe majority of the session will be a live demo of the platform & will include live coding. \n\nOpen registration for the stack we will be using is available at https://openshift.feedhenry.com</p>",
    "video_url": "https://www.youtube.com/watch?v=URRayzLArEc",
    "speakers": "Red Hat Developers",
    "views": "249",
    "likes": "5",
    "video_thumb": "https://i.ytimg.com/vi/URRayzLArEc/mqdefault.jpg",
    "hours": "0",
    "minutes": "57",
    "seconds": "11",
    "tags": [
      "425",
      "956",
      "1148",
      "1207",
      "59",
      "1437"
    ],
    "publish_date": "2016-03-22T19:41:39",
    "path": "/video/youtube/URRayzLArEc/"
  },
  {
    "title": "Java EE Microservices with WildFly Swarm",
    "description": "<p>For this session we have Bob McWhirter talking about WildFly Swarm, which is a project he founded to bring microservices to the Java EE world.\n\n== Abstract ==\n\nWildFly Swarm makes it possible to wade into the great ocean of microservices without abandoning your JavaEE knowledge and experience.  In this talk, we’ll introduce you to what makes WildFly Swarm similar to and distinct from proper WildFly.  We will explore how WildFly Swarm can enable a microservices architecture.  We’ll also demonstrate how to weave together multiple services to have a non-trivial application composed of multiple, independently-deployable services.</p>",
    "video_url": "https://www.youtube.com/watch?v=klK2JoCwl_0",
    "speakers": "Red Hat Developers",
    "views": "1123",
    "likes": "11",
    "video_thumb": "https://i.ytimg.com/vi/klK2JoCwl_0/mqdefault.jpg",
    "hours": "0",
    "minutes": "55",
    "seconds": "29",
    "tags": [
      "1437",
      "185",
      "205",
      "79",
      "1075"
    ],
    "publish_date": "2016-02-09T19:35:39",
    "path": "/video/youtube/klK2JoCwl_0/"
  },
  {
    "title": "An Enterprise Developer’s Journey to the IoT",
    "description": "<p>The current hype around the Internet of Things (IoT) has led to a substantial amount of innovation thanks to open source software, open hardware, open standards, and community inspiration.\n\nIn this session, we will explore how you can use open source software to incorporate the physical world (the “Things”) into your traditional enterprise IT infrastructure. We will walk the path from a typical enterprise developer’s current focus on web desktop applications to mobile and devices, specifically developer prototyping platforms like Raspberry Pi, Intel Edison, Arduino, Particle.io, and several others.\n\nLearn how to connect the physical world to your enterprise middleware backbone via sensors and actuators.\n\n\n== Speaker ==\n\nBurr Sutter: Technologist, innovator, creator, catalyst—an evangelist, product manager, teacher, and 'internal start-up' leader with the vision to see tomorrow's technology and the ability to focus and energize the engineers who build it and the communities who use it. Areas of expertise include Java EE, SOA, Business Rules, BPM, PaaS, Mobile and IoT.\n\n== Resources ==\nSlides:  http://www.slideshare.net/vjbug/an-enterprise-developers-joerney-to-the-iot\n\nDemo code:\n\nhttps://github.com/2015-Middleware-Keynote/\nhttps://github.com/burrsutter/ti_sensortag_node\nhttps://github.com/burrsutter/ti_sensortag_mqtt\nhttps://github.com/burrsutter/lightbluebean_node\nhttps://github.com/RHioTResearch/VertxBeaconScanner</p>",
    "video_url": "https://www.youtube.com/watch?v=YoC0vDIWpC8",
    "speakers": "Red Hat Developers",
    "views": "388",
    "likes": "3",
    "video_thumb": "https://i.ytimg.com/vi/YoC0vDIWpC8/mqdefault.jpg",
    "hours": "1",
    "minutes": "17",
    "seconds": "16",
    "tags": [
      "455",
      "425",
      "1044"
    ],
    "publish_date": "2015-12-17T19:37:46",
    "path": "/video/youtube/YoC0vDIWpC8/"
  },
  {
    "title": "Messaging for IoT",
    "description": "<p>== Abstract ==\nScale changes everything. What once was quite adequate for enterprise messaging can't scale to support \"Internet of Things\". We need new protocols, patterns and architectures to support this new world. This session will start with basic introduction to the concept of Internet of Things. Next it will discuss general technical challenges involved with the concept and explain why it is becoming mainstream now. Now we're ready to start talking about solutions. We will introduce some messaging patterns (like telemetry and command/control) and protocols (such as MQTT and AMQP) used in these scenarios. Finally we will see how Apache ActiveMQ is gearing up for this race. We will show tips for horizontal and vertical scaling of the broker, related projects that can help with deployments and what the future development road map looks like.\n\n== Speaker ==\nMartyn Taylor is a senior software engineer at Red Hat, with over 7 years' experience working on cloud, middleware and messaging software. Martyn currently works on the Apache ActiveMQ suite of projects.</p>",
    "video_url": "https://www.youtube.com/watch?v=E68L26GmQNs",
    "speakers": "Red Hat Developers",
    "views": "753",
    "likes": "8",
    "video_thumb": "https://i.ytimg.com/vi/E68L26GmQNs/mqdefault.jpg",
    "hours": "1",
    "minutes": "3",
    "seconds": "31",
    "tags": [
      "455",
      "89",
      "425",
      "515",
      "255",
      "1136"
    ],
    "publish_date": "2015-11-10T19:12:38",
    "path": "/video/youtube/E68L26GmQNs/"
  },
  {
    "title": "JGroups - An effective framework for cluster communication",
    "description": "<p>Today, when microservices are widely used we often need a tool for sending messages throughout the cluster. During the presentation we will learn how to send information between nodes, invoke RPCs or even coordinate distributed task execution. Clustering might be fun!</p>",
    "video_url": "https://www.youtube.com/watch?v=GhGqkH7YRFk",
    "speakers": "Red Hat Developers",
    "views": "1672",
    "likes": "17",
    "video_thumb": "https://i.ytimg.com/vi/GhGqkH7YRFk/mqdefault.jpg",
    "hours": "1",
    "minutes": "15",
    "seconds": "16",
    "tags": [
      "1127",
      "841",
      "425",
      "89",
      "879",
      "936"
    ],
    "publish_date": "2015-10-06T19:06:11",
    "path": "/video/youtube/GhGqkH7YRFk/"
  },
  {
    "title": "The cold hard truth about microservices and how open source can help",
    "description": "<p>Microservice architectures have become popular, but we have to balance hype with reality. Microservices make it harder to manage deployments and create complex inter-service communications patterns. Learn how Open Source software built by open communities like Apache Camel, Docker, Kubernetes, OpenShift and Fabric8 can help achieve organizational goals to integrate services and establish effective continuous integration and continuous delivery pipelines.\nWith Christian Posta -  Principal Middleware Specialist</p>",
    "video_url": "https://www.youtube.com/watch?v=Df2byI5qrYE",
    "speakers": "Red Hat Developers",
    "views": "678",
    "likes": "3",
    "video_thumb": "https://i.ytimg.com/vi/Df2byI5qrYE/mqdefault.jpg",
    "hours": "1",
    "minutes": "7",
    "seconds": "58",
    "tags": [
      "952",
      "79",
      "89",
      "425",
      "1291",
      "295",
      "1081"
    ],
    "publish_date": "2015-09-08T18:29:37",
    "path": "/video/youtube/Df2byI5qrYE/"
  },
  {
    "title": "Apache Lucene for Java EE developers",
    "description": "<p>Apache Lucene is the de-facto standard open source library for Java developers to implement full-text-search capabilities.\n\nWhile it’s thriving in its field, it is rarely mentioned in the scope of Java EE development.\n\nIn this talk we will see for which features many developers love Lucene, make some concrete examples of common problems it elegantly solves, and see some best practices about using it in a Java EE stack.\n\nFinally we'll see how some popular OSS projects such as Hibernate ORM (JPA provider), WildFly (Java EE runtime) and Infinispan (in-memory datagrid, JCache implementor) actually provide great Lucene integration capabilities.</p>",
    "video_url": "https://www.youtube.com/watch?v=-QNHMZmVehE",
    "speakers": "Red Hat Developers",
    "views": "2407",
    "likes": "12",
    "video_thumb": "https://i.ytimg.com/vi/-QNHMZmVehE/mqdefault.jpg",
    "hours": "1",
    "minutes": "25",
    "seconds": "21",
    "tags": [
      "1011",
      "1012",
      "1190",
      "1012",
      "205",
      "1056",
      "1075",
      "425",
      "1437",
      "1125"
    ],
    "publish_date": "2015-07-14T18:33:52",
    "path": "/video/youtube/-QNHMZmVehE/"
  },
  {
    "title": "What's New in WildFly 9",
    "description": "<p>This session covers new improvements that will be introduced in WildFly 9:\n\n* Wildfly-core will be extracted from the codebase and the ability to assemble a server on top of it will be introduced. WildFly 9 will be provided in two versions: Wildfly Web and Wildfly Full but users will be able to create their custom packaging of WildFly.\n\n* Users will be able to shutdown the application server in a graceful manner - after the shutdown command is executed server will reject new requests and allow existing requests to finish before it shuts down.\n\n* Support for HTTP/2, a new version of HTTP protocol based on SPDY, will be introduced.\n\n* Users will be able to use WildFly as a load balancer. Consequently, it will be possible to manage the balancer with the same tools that are used to manage the rest of the domain. What is more, users will be able to use more efficient protocols, such as HTTP/2, for communication between the balancer and backend servers.\nAn OpenShift cartdridge, which will enable users to use WildFly 9 in cloud environment, will be provided.\nWildFly 9 will use OpenJDK ORB library instead of JacORB.</p>",
    "video_url": "https://www.youtube.com/watch?v=mJjZ661h-As",
    "speakers": "Red Hat Developers",
    "views": "4261",
    "likes": "13",
    "video_thumb": "https://i.ytimg.com/vi/mJjZ661h-As/mqdefault.jpg",
    "hours": "1",
    "minutes": "14",
    "seconds": "2",
    "tags": [
      "185",
      "205",
      "89",
      "1075",
      "205",
      "1437",
      "1125"
    ],
    "publish_date": "2015-06-16T18:22:00",
    "path": "/video/youtube/mJjZ661h-As/"
  },
  {
    "title": "Narayana 5: The premier open source transaction manager",
    "description": "<p>In this JBug, Tom will use an example driven format to illustrate some of the new features that have been added into Narayana recently. We will look at:\n1. Why you need a transaction manager - a brief revision course\n2. Using Narayana inside none-EE containers, mainly focussing on Tomcat\n3. The Narayana STM library\n4. Narayana and NoSQL</p>",
    "video_url": "https://www.youtube.com/watch?v=Rwat1AKHkXE",
    "speakers": "Red Hat Developers",
    "views": "418",
    "likes": "4",
    "video_thumb": "https://i.ytimg.com/vi/Rwat1AKHkXE/mqdefault.jpg",
    "hours": "1",
    "minutes": "12",
    "seconds": "45",
    "tags": [
      "89",
      "185",
      "853",
      "1417",
      "753",
      "1155",
      "1156",
      "1454",
      "1455",
      "853",
      "854"
    ],
    "publish_date": "2015-05-12T18:27:03",
    "path": "/video/youtube/Rwat1AKHkXE/"
  },
  {
    "title": "Hacking on WildFly 9",
    "description": "<p>Join us for this interactive event and get your hands dirty with some WildFly 9 hacking!\n\nOur host Kabir Khan will explain how you can contribute to the WildFly project at many different levels, from properly reporting bugs in the forums and issue tracker, to actually being able to submit a pull request.\n\nDuring this interactive event you will have a chance to play with WildFly 9 and try some of the following:\n\n• Find a JIRA you want to work on.\n\n• See how to check-out the code and setup your IDE.\n\n• Build WildFly\n\n• Code walkthrough - code organisation, jboss-modules etc.\n\n• Debug something from a stack trace in a JIRA issue to nail down the\n\n• problem.\n\n• Try the testsuite\n\n• And more!</p>",
    "video_url": "https://www.youtube.com/watch?v=Uxqq6NFdvTo",
    "speakers": "Red Hat Developers",
    "views": "1860",
    "likes": "8",
    "video_thumb": "https://i.ytimg.com/vi/Uxqq6NFdvTo/mqdefault.jpg",
    "hours": "1",
    "minutes": "6",
    "seconds": "16",
    "tags": [
      "89",
      "185",
      "425",
      "1437",
      "1125"
    ],
    "publish_date": "2015-04-21T18:13:11",
    "path": "/video/youtube/Uxqq6NFdvTo/"
  },
  {
    "title": "Building Cross Platform Applications with Cordova and AeroGear",
    "description": "<p>Mobile devices are increasingly important as a platform. The number of different devices on the market increases every day. This posses a challenge, how do we support all of them. Every new device comes with it's own paradigms and programming language. Wouldn't it be great if we could create one application that could support all platforms. With Cordova and AeroGear you can.\n\nCordova is a platform that allows you to access native device functions from JavaScript enabling you to create mobile applications with just CSS, HTML and JavaScript, for all platforms. You can use your existing skill sets to create native applications.\n\nIn this talk we'll show how you can create an application with Cordova and even how to create your own plugins. What features the AeroGear Plugins have and how you can use these to build mobile applications rapidly. How to create test and run these on simulators and integrate them into your own build environment.</p>",
    "video_url": "https://www.youtube.com/watch?v=jle2H7RzvFA",
    "speakers": "Red Hat Developers",
    "views": "419",
    "likes": "3",
    "video_thumb": "https://i.ytimg.com/vi/jle2H7RzvFA/mqdefault.jpg",
    "hours": "0",
    "minutes": "36",
    "seconds": "6",
    "tags": [
      "696",
      "1000",
      "698"
    ],
    "publish_date": "2015-04-20T17:45:33",
    "path": "/video/youtube/jle2H7RzvFA/"
  },
  {
    "title": "Implementing your own Google App Engine",
    "description": "<p>Google App Engine (GAE) is a popular PaaS offering. Where its scalable and reliable environment is hidden behind a custom API. This makes GAE apps hard to port over to other non-GAE environments.\n\nBut what if one could implement such similar environment? And you could simply move your GAE application’s .war file to this new environment and it would just work?\n\nAfter all, at the end it’s all about the API, plus scalable and reliable services.\n\nJBoss CapeDwarf project aims at making this a reality. This presentation will provide a glimpse into what it takes to implement something as GAE, ranging from runtime integration with JBoss Application Server, actual services implementation to last but not least, automated heavy testing.</p>",
    "video_url": "https://www.youtube.com/watch?v=epYpOWyf7uM",
    "speakers": "Red Hat Developers",
    "views": "373",
    "likes": "2",
    "video_thumb": "https://i.ytimg.com/vi/epYpOWyf7uM/mqdefault.jpg",
    "hours": "1",
    "minutes": "6",
    "seconds": "16",
    "tags": [
      "89",
      "971",
      "818",
      "838",
      "69"
    ],
    "publish_date": "2015-03-10T19:15:33",
    "path": "/video/youtube/epYpOWyf7uM/"
  },
  {
    "title": "Hit the ground running with BPM — a starters kit",
    "description": "<p>Looking to design business processes but not sure how to get started? If this is the first you’ve heard of Red Hat JBoss BPM Suite, or you’re anxious to get started with your freshly downloaded JBoss BPM Suite, this webinar’s for you.\n\nHave no fear, the JBoss BPM Suite starter kit will:\n• Provide you with the details, help, and path to rules, events, and process freedom.\n• Show you a quick and easy entry into the world of process design.\n• Walk you through the contents, and what you can achieve, with the JBoss BPM Suite.\n• Start you off with an easy installation.\n• Use a pre-installed project and workshop to take you step-by-step through constructing the project from scratch.\n\nJoin us for a grand tour of the JBoss BPM Suite starter kit, and learn how you can hit the ground running as the BPM expert you always wanted to be.</p>",
    "video_url": "https://www.youtube.com/watch?v=WMuRfiifXzA",
    "speakers": "Red Hat Developers",
    "views": "519",
    "likes": "1",
    "video_thumb": "https://i.ytimg.com/vi/WMuRfiifXzA/mqdefault.jpg",
    "hours": "0",
    "minutes": "40",
    "seconds": "21",
    "tags": [
      "315",
      "788",
      "89",
      "1452",
      "205",
      "1437",
      "1434"
    ],
    "publish_date": "2015-02-17T18:45:59",
    "path": "/video/youtube/WMuRfiifXzA/"
  },
  {
    "title": "Ceylon From Here to Infinity: The Big Picture and What's Coming",
    "description": "<p>Ceylon is a new modern, elegant programming language for the JVM and JavaScript VM, designed for team work. But it's more than that, it is a full platform with modularity, an SDK, tools and IDEs.\n\nWe will present Ceylon the language, the platform, and its ecosystem. You will see everything from starting a new project in the IDE to publishing it on Herd, our module repository, including using the SDK. We will also discuss the ongoing Ceylon projects such as the build system, Vert.x integration or Cayla, the new web framework.\n\nFinally we will discuss the plans for Ceylon 1.2 and further.</p>",
    "video_url": "https://www.youtube.com/watch?v=bHFkj38VbUU",
    "speakers": "Red Hat Developers",
    "views": "1115",
    "likes": "10",
    "video_thumb": "https://i.ytimg.com/vi/bHFkj38VbUU/mqdefault.jpg",
    "hours": "1",
    "minutes": "11",
    "seconds": "46",
    "tags": [
      "829",
      "828",
      "89",
      "205",
      "1161"
    ],
    "publish_date": "2015-02-12T19:19:18",
    "path": "/video/youtube/bHFkj38VbUU/"
  },
  {
    "title": "Apache DeltaSpike: The CDI toolbox",
    "description": "<p>CDI portable extensions are one of greatest features of Java EE allowing the platform to be extended in a clean and portable way. But allowing extension is just part of the story. CDI opens the door to a whole new eco-system for Java EE, but it’s not the role of the specification to create these extensions. \n\n\nApache DeltaSpike is the project that leads this brand new eco-system by providing useful extension modules for CDI applications as well as tools to ease the creation of new ones.\n\n\nIn this session, we’ll start by presenting the DeltaSpike toolbox and show how it helps you to develop for CDI. Then we’ll describe the major extensions included in Deltaspike, including  'configuration', 'scheduling' and 'data'.\n\n\nSpeaker\n\nAntoine Sabot-Durand is the CDI co-spec lead. He is also the tech lead of the Agorava project.</p>",
    "video_url": "https://www.youtube.com/watch?v=QbNdFvNPvVU",
    "speakers": "Red Hat Developers",
    "views": "1858",
    "likes": "10",
    "video_thumb": "https://i.ytimg.com/vi/QbNdFvNPvVU/mqdefault.jpg",
    "hours": "0",
    "minutes": "47",
    "seconds": "16",
    "tags": [
      "821",
      "865",
      "205",
      "1056",
      "205",
      "89",
      "185",
      "1075",
      "285",
      "737",
      "888"
    ],
    "publish_date": "2015-01-20T18:52:24",
    "path": "/video/youtube/QbNdFvNPvVU/"
  },
  {
    "title": "CDI (Part 2): The Advanced Features",
    "description": "<p>This presentation introduces the advanced features of CDI (Contexts and Dependency Injection). It was presented by Antoine Sabot-Durand, the co-spec lead for CDI. \n\nIn less than five years of existence, Contexts and Dependency Injection (CDI) has become one of the major specifications in Java EE. However, its advanced features are still not well known among the majority of the developers, who see it as a simple Dependency Injection solution. In this session, we’ll deep dive into advanced features like the CDI SPI and portable extensions. Then we'll view some examples of how CDI can be used to extend, in a portable way, the Java EE stack.</p>",
    "video_url": "https://www.youtube.com/watch?v=LFDSPWI9zV4",
    "speakers": "Red Hat Developers",
    "views": "966",
    "likes": "4",
    "video_thumb": "https://i.ytimg.com/vi/LFDSPWI9zV4/mqdefault.jpg",
    "hours": "0",
    "minutes": "38",
    "seconds": "32",
    "tags": [
      "821",
      "865",
      "205",
      "205",
      "185",
      "1075",
      "285",
      "822"
    ],
    "publish_date": "2014-12-08T10:02:39",
    "path": "/video/youtube/LFDSPWI9zV4/"
  },
  {
    "title": "CDI (Part 1): Introduction to CDI",
    "description": "<p>This presentation provides an introduction to CDI (Contexts and Dependency Injection), covering the basic and intermediate features. It was presented by Antoine Sabot-Durand, the co-spec lead for CDI.</p>",
    "video_url": "https://www.youtube.com/watch?v=E0lhfKIHclc",
    "speakers": "Red Hat Developers",
    "views": "2879",
    "likes": "14",
    "video_thumb": "https://i.ytimg.com/vi/E0lhfKIHclc/mqdefault.jpg",
    "hours": "0",
    "minutes": "56",
    "seconds": "45",
    "tags": [
      "821",
      "865",
      "205",
      "1056",
      "205",
      "1075",
      "89",
      "285",
      "185"
    ],
    "publish_date": "2014-12-02T19:46:44",
    "path": "/video/youtube/E0lhfKIHclc/"
  },
  {
    "title": "Case Studies in Testable Java EE Development",
    "description": "<p>For this session we have Andrew Rubinger presenting examples from his O’Reilly book, \"Continuous Enterprise Development in Java\". Andrew has strong roots in testing and enterprise middleware, having implement the JBoss' EJB container and also co-founding the Arquillian project.\n\n\n\nAbstract\n\nThis session pulls a variety of examples in testable development from O’Reilly's Continuous Enterprise Development in Java, including a review of the sections on:\n• RESTful services\n\n• UI verification\n\n• Transactions\n\n• Security\n\n...and covers other areas of the Java EE platform that have historically been branded as “difficult to test.” The session spends a lot of time in the IDE, with examples that are freely available to fork and run.\n\n\nPresenter: Andrew Lee Rubinger (Open Source Software Engineer and Author)\n\nOpen-source engineer; Developer Advocate and Program Manager at JBoss by Red Hat, author of the upcoming \"Continuous Enterprise Development in Java\" from O'Reilly Media. Founder of the ShrinkWrap project and recovering member of the JBoss Core Development Team.</p>",
    "video_url": "https://www.youtube.com/watch?v=WOFUH_R0sAg",
    "speakers": "Red Hat Developers",
    "views": "670",
    "likes": "3",
    "video_thumb": "https://i.ytimg.com/vi/WOFUH_R0sAg/mqdefault.jpg",
    "hours": "1",
    "minutes": "3",
    "seconds": "26",
    "tags": [
      "755",
      "205",
      "205",
      "185",
      "1075",
      "89",
      "285",
      "866",
      "764",
      "1160"
    ],
    "publish_date": "2014-11-25T19:11:45",
    "path": "/video/youtube/WOFUH_R0sAg/"
  },
  {
    "title": "Testing the Enterprise layers, with Arquillian",
    "description": "<p>Arquillian is an innovative and highly extensible testing platform for the JVM that enables developers to easily create automated integration, functional and acceptance tests for Java middleware, from Java EE and beyond.\n\nFor years we've been exploring how to layer and separate our code to test in isolation on the unit level. We've kept integration and functional testing as a big ball of mud; jumping straight from unit to full system testing. But can we apply some of the same lessons learned from unit to integration testing?\n\nSpeaker Bio: \nArquillian project lead, Aslak Knutsen, is a Senior Software Engineer at Red Hat where he is working on projects such as Arquillian and ShrinkWrap, one of the founders of the JBoss Testing initiative and a speaker at major industry conferences including JavaOne, Devoxx, Jazoon, JFokus, Geecon, JUDCon and JBoss World.</p>",
    "video_url": "https://www.youtube.com/watch?v=YKZU9XNRRNY",
    "speakers": "Red Hat Developers",
    "views": "2933",
    "likes": "23",
    "video_thumb": "https://i.ytimg.com/vi/YKZU9XNRRNY/mqdefault.jpg",
    "hours": "0",
    "minutes": "58",
    "seconds": "41",
    "tags": [
      "696",
      "1000",
      "698"
    ],
    "publish_date": "2014-10-21T19:24:46",
    "path": "/video/youtube/YKZU9XNRRNY/"
  },
  {
    "title": "Docker and JBoss - the perfect combination",
    "description": "<p>For this session we have Marek Goldmann who leads Docker related initiatives at Red Hat. \n\nAbstract\n\nDocker is a tool for building portable Linux containers around an application. If you are unfamiliar with Docker, or have heard of it but never used it, then you should definitely come to this session because containers are the new virtualization.\n\nDocker is a revolution in thinking about software distribution. It makes the process of creating images with the whole application stack (OS + application server + application itself) easy and extremely fast. You can share them easily too, and images behave the same way on different machines. Differences between development and production environments are a thing of the past. But that's not everything - Docker helps you run images too by providing an easy to use interface. Sounds like magic, huh?\n\nIn this session, right after introduction to Docker, Marek will dive into examples showing how you can leverage this tool to create a deployment environment for your applications. You will see how to cluster JBoss EAP and deploy an application to it. Marek will share some tips and tricks too: for example how to manage logs or customize the configuration of JBoss EAP to be able to deploy your applications.\n\n\n\nAbout Marek\n\nMarek joined Red Hat in January 2009 and started hacking on Cloud-related JBoss projects. Currently Marek leads the WildFly integration effort with the Fedora operating system, and makes sure that JBoss' projects run well on Docker.</p>",
    "video_url": "https://www.youtube.com/watch?v=4uQ6gR_xZhE",
    "speakers": "Red Hat Developers",
    "views": "8288",
    "likes": "34",
    "video_thumb": "https://i.ytimg.com/vi/4uQ6gR_xZhE/mqdefault.jpg",
    "hours": "1",
    "minutes": "19",
    "seconds": "56",
    "tags": [
      "696",
      "1000",
      "698"
    ],
    "publish_date": "2014-09-09T18:31:44",
    "path": "/video/youtube/4uQ6gR_xZhE/"
  },
  {
    "title": "Boston Java Meetup - Rapid Enterprise Development w/ EAP, JRebel, and XRebel",
    "description": "<p>Part II of the Boston Java Meetup on 12 August 2014, in which Andrew Lee Rubinger introduces the GeekSeek example application from the http://continuousdev.org book, and further inspects it with XRebel at runtime.\n\nAdam Koblentz follows with a deeper tour of using XRebel and JRebel atop the Spring Pet Store Demo application to show how realtime inspection and profiling coupled with hot-reloading of code without deployment saves time and effort.</p>",
    "video_url": "https://www.youtube.com/watch?v=RcWykg-l27k",
    "speakers": "Red Hat Developers",
    "views": "529",
    "likes": "5",
    "video_thumb": "https://i.ytimg.com/vi/RcWykg-l27k/mqdefault.jpg",
    "hours": "0",
    "minutes": "37",
    "seconds": "49",
    "tags": [
      "1149",
      "1458",
      "89",
      "1075"
    ],
    "publish_date": "2014-08-13T21:21:40",
    "path": "/video/youtube/RcWykg-l27k/"
  },
  {
    "title": "Transactions in the Cloud",
    "description": "<p>For this meetup we have two short talks, both with a \"Transactions in the Cloud\" theme. The talks cover some novel research undertaken by this summer's intern students.\n\n\nTransactions and NoSQL Review\n\nIt is a common to forgo the use of transactions in an application due to untested performance or scalability concerns. While it is true that transactions do come at a cost, they also bring a lot of strong guarantees essential to a correctly running application. There are many differing transaction options available, each with varying costs and guarantees. Rather than dismiss transactions altogether, it would be more prudent to consider how your application would perform under a number of different transaction models and select the option that hits the right balance of performance and guarantees. \n\nThis presentation provides a useful reference for developers and architects who need the guarantees that transactions can bring, but don't know which model is right for them. In particular the presentation will:\n\n\n1) Review each of the transaction options available in NoSQL today.\n\n2) Compare ACID and Extended (relaxed ACID) transaction models and understand how these models relate to NoSQL and scalability.\n\n3) Present performance results for a selection of transaction options under different classes of workload. Covering a single node, as well as cluster of sharded nodes.\n\n\nScaling a transaction manager in the Cloud\n\nTransaction coordination systems such as Narayana rely upon storage facilities to recreate transaction state during recovery from a system crash. These logs are usually stored on RAID hard drives to maximize reliability. However, any disk I/O is relatively slow and writing the logs can become a bottleneck in high performance transaction systems. Using the fastest available disk subsystems is thus an expensive necessity for many enterprise applications.\n\nThe use of a cluster of inexpensive, unreliable hardware nodes in conjunction with data replication for redundancy is an increasingly popular and cost effective architecture for many highly scalable, high reliability applications. Data grids such as Infinispan provides distributed in-memory replication of Java objects, making programming for this kind of cluster relatively simple.\n\nThis presentation will cover a new transaction logging plugin for Narayana that uses a data grid to replicate the logs to main memory on other nodes in a cluster, in preference to writing them to disk. In addition, the presentation will also cover performance benchmarks and reliability trade-offs.</p>",
    "video_url": "https://www.youtube.com/watch?v=zPCnEKr8vKM",
    "speakers": "Red Hat Developers",
    "views": "180",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/zPCnEKr8vKM/mqdefault.jpg",
    "hours": "1",
    "minutes": "22",
    "seconds": "41",
    "tags": [
      "696",
      "1000",
      "698"
    ],
    "publish_date": "2014-08-12T18:55:35",
    "path": "/video/youtube/zPCnEKr8vKM/"
  },
  {
    "title": "What's new in WildFly 8?",
    "description": "<p>For this session we have the WildFly project lead, Jason Greene. \n\nWildFly 8 (née JBoss Application Server) is Red Hat's open source Java EE 7 compliant application server. It contains robust implementations of WebSocket, Batch, JSON, Concurrency, JMS2, JAX-RS 2, CDI 1.1, and all Java EE 7 technologies. Undertow is the new cutting-edge web server in WildFly 8 and is designed for maximum throughput and scalability, including environments with over a million connections. The number of ports is reduced used by multiplexing protocols over HTTP using HTTP Upgrade.\n \nRole Based Access Control support organizations with separated management responsibilities and restrictions. Roles represent different sets of permissions such as runtime operation execution, configuration areas that can read or written, and the ability to audit changes and manage users. In addition a new restricted audit log can be enabled including the ability to offload to a secure syslog server.\n \nWildFly also provides a \"core\" distribution that is ideal for framework authors that want to build their own application runtime using the powerful WildFly 8 architecture.\n \nNetBeans, IntelliJ, and Eclipse allow WildFly to be used for development, deployment, and debugging.\n\nThis session will provide an overview of all these features using several live demos.\n \nFormat: 30 mins overview of WildFly 8 + 30 mins deep dive on some specific topic(s)</p>",
    "video_url": "https://www.youtube.com/watch?v=MhfnW9nX5lY",
    "speakers": "Red Hat Developers",
    "views": "2337",
    "likes": "7",
    "video_thumb": "https://i.ytimg.com/vi/MhfnW9nX5lY/mqdefault.jpg",
    "hours": "1",
    "minutes": "13",
    "seconds": "49",
    "tags": [
      "696",
      "1000",
      "698"
    ],
    "publish_date": "2014-07-08T18:37:38",
    "path": "/video/youtube/MhfnW9nX5lY/"
  },
  {
    "title": "JUDCon:Boston 2014",
    "description": "<p>WATCHING LIVE? Join the chat here: https://webchat.freenode.net/?channels=jbugworldwide\n\nFor this meetup we are broadcasting live from JUDCon Boston 2014 on Saturday, June 28th. The broadcast will start shortly after 9am EDT (13:00 UTC).\n\nhttp://jboss.org/events/JUDCon/2014/boston\n\nThe event comprises of a morning of presentations followed by an afternoon of hacking. This time, we'll only be broadcasting the morning sessions. Maybe in future we'll think of a way to do the hackfest too!\n\nHere is the agenda: \n13:15 UTC - 13:55 UTC Quickstart Introduction: Mobile with AeroGear  \n﻿14:00 UTC - 14:40 UTC﻿ ﻿Quickstart Introduction: Security﻿  \n﻿14:45 UTC - 15:25 UTC Project ﻿Introduction: OpenShift ﻿  \n﻿15:30 UTC - 17:15 UTC﻿ Project ﻿Introduction: KeyCloak﻿  \n\nTechnologies we'll be covering include:\n\n* Aerogear Unified Push Server  \n* Keycloak - Security  \n* Apache Cordova\n\nFor more details:\n\nhttp://jboss.org/events/JUDCon/2014/boston</p>",
    "video_url": "https://www.youtube.com/watch?v=yHU781JR2hk",
    "speakers": "Red Hat Developers",
    "views": "249",
    "likes": "1",
    "video_thumb": "https://i.ytimg.com/vi/yHU781JR2hk/mqdefault.jpg",
    "hours": "3",
    "minutes": "26",
    "seconds": "18",
    "tags": [
      "1125",
      "205",
      "89",
      "719",
      "1170",
      "1061",
      "59",
      "1148",
      "1157",
      "784"
    ],
    "publish_date": "2014-06-28T18:20:19",
    "path": "/video/youtube/yHU781JR2hk/"
  },
  {
    "title": "Code-driven introduction to Java EE 7",
    "description": "<p>We are lucky to have Arun Gupta presenting on the new features in Java EE 7. Arun is well known in the Java EE community and was heavily involved with the Java EE 7 specification when he worked at Oracle. Arun now works for Red Hat as Director of Developer Advocacy.\n\n\nAbstract\n\nJava EE 7 platform is the latest release of the Java EE platform. WebSocket attempts to solve the issues and limitations of HTTP for real-time communication. A new API is added to the platform build WebSocket driven applications. Processing JSON structures is inherent in any HTML5 applications and a new API to parse and generate JSON is being added to the platform. Longawaited Batch Processing API and Concurrency are now added to build applications using capabilities of the platform itself. In addition, JAX-RS 2 adds a new Client API to invoke the RESTful endpoints, allows asynchronous client/server, and server-sidecontent negotiation. JMS 2 is undergoing a complete overhaul to align with improvements in the Java language. This code-driven talk will provide an introduction to the Java EE 7 platform. Don't miss out on this session to learn all about how to leverage the new and exciting standards in building your next enterprise application.</p>",
    "video_url": "https://www.youtube.com/watch?v=abVywnRpgog",
    "speakers": "Red Hat Developers",
    "views": "934",
    "likes": "10",
    "video_thumb": "https://i.ytimg.com/vi/abVywnRpgog/mqdefault.jpg",
    "hours": "1",
    "minutes": "20",
    "seconds": "57",
    "tags": [
      "696",
      "1000",
      "698"
    ],
    "publish_date": "2014-06-17T18:59:52",
    "path": "/video/youtube/abVywnRpgog/"
  },
  {
    "title": "LiveOak: Is that a mobile backend as a service in your pocket?",
    "description": "<p>LiveOak is a new JBoss Middleware project built from the ground up to be mobile friendly and cater to the needs of mobile application developers. Being lightweight and entirely RESTful allows you to hit the ground running in developing your mobile applications with LiveOak.\n\nWe will provide an overview of LiveOaks' stack, what we provide OOTB to enable speedy mobile app dev, how the configuration can be modified, and our RESTful guiding principles. Then move onto an application showing how easily and quickly LiveOak can be integrated to provide the required back end. Lastly we touch on how the platform can be extended with your own services to provide additional RESTful resources.</p>",
    "video_url": "https://www.youtube.com/watch?v=NO-2S5p_1mk",
    "speakers": "Red Hat Developers",
    "views": "438",
    "likes": "3",
    "video_thumb": "https://i.ytimg.com/vi/NO-2S5p_1mk/mqdefault.jpg",
    "hours": "1",
    "minutes": "11",
    "seconds": "30",
    "tags": [
      "696",
      "1000",
      "698"
    ],
    "publish_date": "2014-05-13T19:39:53",
    "path": "/video/youtube/NO-2S5p_1mk/"
  },
  {
    "title": "Openshift: The Polyglot Platform as a Service - Max Andersen",
    "description": "<p>OpenShift is Red Hat's polyglot Platform as a service which allow you to run a large range of services in the cloud. In this talk I will give an introduction to OpenShift, what it offers and how it works. The talk will be in two parts. The first is about OpenShift in general and how to use it from the command line and the web console. The Second part is about how JBoss Developer Studio works with OpenShift and how it both coexist and extend the experience you get with \"plain\" OpenShift. This part will focus especially on how well the JavaEE and mobile parts of Developer Studio works with OpenShift. The talk is intended to be practical and guided by attendees question. \n\n\nMax Rydahl Andersen was born and raised in Denmark, worked on health care software systems for some time. \nIn that work I bumped into this small project called Hibernate and had to fix a couple of things in it to make it useful. \nSince then I've been working at Red Hat on Hibernate Core, Hibernate Tools, Seam and now lately JBoss Tools and Developer Studio.</p>",
    "video_url": "https://www.youtube.com/watch?v=6_X68PnBDfg",
    "speakers": "Red Hat Developers",
    "views": "357",
    "likes": "2",
    "video_thumb": "https://i.ytimg.com/vi/6_X68PnBDfg/mqdefault.jpg",
    "hours": "1",
    "minutes": "37",
    "seconds": "18",
    "tags": [
      "59",
      "69",
      "1300",
      "89",
      "205",
      "838",
      "896",
      "1085"
    ],
    "publish_date": "2014-03-11T22:37:19",
    "path": "/video/youtube/6_X68PnBDfg/"
  },
  {
    "title": "Keycloak: A New Open Source Authentication Server",
    "description": "<p>Keycloak is a new open source authentication server for cloud, mobile and html5. With loads of features, including single-sign on, social login, account management console, account workflows, fully featured admin console, OAuth2 and OpenShift cartridge to name a few. The first alpha has recently been released, with loads more features planned for the future. Keycloak also provides support for role based authorization and supports granting access to third party applications. \nThis talk gives a comprehensive introduction to Keycloak and its features, as well as discuss how easily you can add authentication to your applications. There will also be an extensive live demo.\n\nStian Thorgersen is a Senior Software Engineer at Red Hat. He co-leads the Keycloak project together with Bill Burke, and is also the security lead on another new open source project. Stian also has many years of experience in cloud solutions.</p>",
    "video_url": "https://www.youtube.com/watch?v=lUO4hjA6bME",
    "speakers": "Red Hat Developers",
    "views": "9611",
    "likes": "33",
    "video_thumb": "https://i.ytimg.com/vi/lUO4hjA6bME/mqdefault.jpg",
    "hours": "1",
    "minutes": "0",
    "seconds": "49",
    "tags": [
      "89",
      "185",
      "1170",
      "445",
      "59"
    ],
    "publish_date": "2014-02-13T03:22:46",
    "path": "/video/youtube/lUO4hjA6bME/"
  },
  {
    "title": "Improving Infinispan's Scalability: A new approach to group communication",
    "description": "<p>Infinispan is a distributed in memory key/value store that aims to be highly available and scalable. Its ability to scale is tightly linked to the underlying order protocol, aka atomic broadcast, used for enforcing serializability. \nIn this talk I will explore the scaling limits of Infinispan's existing protocol and then propose an alternative approach to designing broadcast systems, that decouples  ordering and broadcast.  \n\nThis talk contrasts our approach with Infinispan's, exploring the design features of our new approach and how they will improve Infinispan's scalability.\n\nThis talk was be given by Ryan Emerson at the Newcastle JBoss User Group.</p>",
    "video_url": "https://www.youtube.com/watch?v=04qNcovQKLA",
    "speakers": "Red Hat Developers",
    "views": "568",
    "likes": "3",
    "video_thumb": "https://i.ytimg.com/vi/04qNcovQKLA/mqdefault.jpg",
    "hours": "1",
    "minutes": "5",
    "seconds": "29",
    "tags": [
      "936",
      "1125"
    ],
    "publish_date": "2013-11-15T11:09:55",
    "path": "/video/youtube/04qNcovQKLA/"
  },
  {
    "title": "ThreadSafe",
    "description": "<p>ThreadSafe is a static analysis product for finding concurrency bugs in multi-threaded Java programs.  Such bugs can be difficult to find using conventional testing methods.  They may occur randomly due to non-deterministic scheduling behaviour, and can be hard to replicate. ThreadSafe analyses can be from within the Eclipse IDE, and/or in conjunction with the Sonar quality dashboard.\n \nThreadSafe is developed by Contemplate, a spin-out company from the University of Edinburgh.  Following its commercial release, it has been installed by an investment bank that participated in Contemplate's Early Adopter Program, and is under evaluation in others. The design intent is not only to identify the subtle issues which can arise in multi-threaded software development, but also to provide an easy to use user experience which allows the developer to quickly understand the analysis and to take remedial action, where required, with confidence and understanding.\n \nContemplate will talk about its focus on concurrency, and demonstrate ThreadSafe's analysis of some Open Source examples.</p>",
    "video_url": "https://www.youtube.com/watch?v=601HvXyLXqk",
    "speakers": "Red Hat Developers",
    "views": "157",
    "likes": "1",
    "video_thumb": "https://i.ytimg.com/vi/601HvXyLXqk/mqdefault.jpg",
    "hours": "1",
    "minutes": "7",
    "seconds": "46",
    "tags": [
      "1125",
      "1403",
      "864"
    ],
    "publish_date": "2013-09-10T19:02:51",
    "path": "/video/youtube/601HvXyLXqk/"
  },
  {
    "title": "Transaction Monitoring and Visualisation",
    "description": "<p>ACID Transactions are routinely used when applications require strong guarantees as to how atomic operations, involving multiple resources, will perform in the presence of failures, such as system crashes and network disruption. Transactional middleware such as JBoss, combined with application frameworks like Java EE provide the developer with a simple means to add transactional semantics to their applications. Problems can still arise, however, for example poor transactional throughput may manifest when a high volume of transactions rollback, which can have a myriad of non obvious causes.\n\nThis talk will explore the current methods of troubleshooting some common transactional issues using JBoss and introduce TxVis: a prototype transaction profiling and visualisation tool. We will discuss the challenges of its development and how it will aid the user in profiling the performance of transactions in their software and quickly isolate some commonly occurring problems.</p>",
    "video_url": "https://www.youtube.com/watch?v=s9qvxgfcon4",
    "speakers": "Red Hat Developers",
    "views": "453",
    "likes": "1",
    "video_thumb": "https://i.ytimg.com/vi/s9qvxgfcon4/mqdefault.jpg",
    "hours": "0",
    "minutes": "49",
    "seconds": "9",
    "tags": [
      "89",
      "185",
      "1121",
      "1155",
      "1156",
      "39",
      "1417"
    ],
    "publish_date": "2013-08-25T16:54:40",
    "path": "/video/youtube/s9qvxgfcon4/"
  },
  {
    "title": "Efficient top-k query processing on distributed column family databases: by Rui Vieira",
    "description": "<p>Ranking queries are one of the central topics in the field of Information Retrieval with considerable applications in fields such as analytics.\nOne of the challenges is to provide solutions which can be adapted to distributed data sources, specifically NoSQL distributed column-oriented databases, and comply to \"user\" real-time constraints, especially when dealing with massive amounts of data.\nIn this talk, we discuss the implementation and challenges for some of the most promising algorithms to address these challenges.\nWe also analyse their scalability and substantial gains in terms of bandwidth and execution time, as indicated by the experimental results.\"</p>",
    "video_url": "https://www.youtube.com/watch?v=3qPrR7zinlk",
    "speakers": "Red Hat Developers",
    "views": "391",
    "likes": "2",
    "video_thumb": "https://i.ytimg.com/vi/3qPrR7zinlk/mqdefault.jpg",
    "hours": "0",
    "minutes": "48",
    "seconds": "6",
    "tags": [],
    "publish_date": "2013-08-16T17:18:39",
    "path": "/video/youtube/3qPrR7zinlk/"
  },
  {
    "title": "DevNation 2015 Keynote - Matt Hicks - The future of development with Kubernetes and Docker",
    "description": "<p>You've probably heard a lot about Linux containers and the exciting potential they hold.  In this presentation, Matt Hicks will cover how Docker and Kubernetes have evolved to fundamentally change how you will approach development and operations.  If you are looking for an understanding of the technology and how it relates to the common roles in IT today, this is the talk to watch.</p>",
    "video_url": "https://www.youtube.com/watch?v=Bi2sAvhaGno",
    "speakers": "Red Hat Developers",
    "views": "1249",
    "likes": "10",
    "video_thumb": "https://i.ytimg.com/vi/Bi2sAvhaGno/mqdefault.jpg",
    "hours": "0",
    "minutes": "48",
    "seconds": "18",
    "tags": [
      "903",
      "125"
    ],
    "publish_date": "2015-06-22T18:26:36",
    "path": "/video/youtube/Bi2sAvhaGno/"
  },
  {
    "title": "DevNation 2015 Keynote - Venkat Subramaniam - The joy of functional programming",
    "description": "<p>It's been around for a long time, but everyone's talking about it all of a sudden. But why and why now? We've been programming in languages like Java for a while, quite well. Now we're asked to change and the languages themselves are changing towards this style of programming. In this keynote, a passionate polyglot programmer and author of \"Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions\" will share the reasons we need to make the paradigm shift and the pure joy—the benefits—we will reap from it.</p>",
    "video_url": "https://www.youtube.com/watch?v=L2GUFoIjBpg",
    "speakers": "Red Hat Developers",
    "views": "1985",
    "likes": "14",
    "video_thumb": "https://i.ytimg.com/vi/L2GUFoIjBpg/mqdefault.jpg",
    "hours": "1",
    "minutes": "15",
    "seconds": "21",
    "tags": [
      "903"
    ],
    "publish_date": "2015-06-22T15:27:53",
    "path": "/video/youtube/L2GUFoIjBpg/"
  },
  {
    "title": "DevNation 2015 Keynote - Brianna Wu - 9 ways to stop hurting and start helping women in tech",
    "description": "<p></p>",
    "video_url": "https://www.youtube.com/watch?v=24DbODbYQ70",
    "speakers": "Red Hat Developers",
    "views": "909",
    "likes": "10",
    "video_thumb": "https://i.ytimg.com/vi/24DbODbYQ70/mqdefault.jpg",
    "hours": "0",
    "minutes": "55",
    "seconds": "54",
    "tags": [
      "903",
      "797",
      "976"
    ],
    "publish_date": "2015-06-23T19:11:34",
    "path": "/video/youtube/24DbODbYQ70/"
  },
  {
    "title": "DevNation 2015 - Felix Ehm - Running CERN's Accelerator Control System using open source software",
    "description": "<p>A new era for physics is about to begin in 2015 when the recently upgraded particle accelerator infrastructure at CERN will start up again tocontinue the search for new particles.\n\nThe Accelerator Controls System behind the scene enables operators to monitor and control critical (real-time) equipment and services 24x7x365. In many ways it is realized by using open source software and even open hardware. This talk gives an insight into where and how this is done and highlights concrete scenarios like ActiveMQ for fast and reliable messaging, Camel and Elasticsearch for diagnostics and White Rabbit for central timing. It also covers the experiences made by using open source software solutions during development and maintenance of in-house services in the recent years.</p>",
    "video_url": "https://www.youtube.com/watch?v=Yq_YuxfXalc",
    "speakers": "Red Hat Developers",
    "views": "640",
    "likes": "5",
    "video_thumb": "https://i.ytimg.com/vi/Yq_YuxfXalc/mqdefault.jpg",
    "hours": "0",
    "minutes": "57",
    "seconds": "4",
    "tags": [
      "903"
    ],
    "publish_date": "2015-06-23T14:14:16",
    "path": "/video/youtube/Yq_YuxfXalc/"
  },
  {
    "title": "DevNation 2015 - Kris Borchers - Making jQuery Widgets Famous, as well as Famo.us",
    "description": "<p>The jQuery Foundation recently announced its partnership with Famo.us to bring some amazing things to the world of JavaScript and jQuery. Without giving away too many surprises, just picture some of your favorite jQuery widgets like lightboxes and carousels and then picture them with beautiful 3D rendering and animations all done with JavaScript.</p>",
    "video_url": "https://www.youtube.com/watch?v=ovrVfMX9pRQ",
    "speakers": "Red Hat Developers",
    "views": "41",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/ovrVfMX9pRQ/mqdefault.jpg",
    "hours": "0",
    "minutes": "47",
    "seconds": "13",
    "tags": [
      "903"
    ],
    "publish_date": "2015-08-04T14:27:15",
    "path": "/video/youtube/ovrVfMX9pRQ/"
  },
  {
    "title": "DevNation 2015 - Tyler Jewell - Contribute to any open source project with Eclipse Che & Codenvy",
    "description": "<p>The biggest inhibitor to open source contributions is developer environment configuration. Developers want prepackaged environments ready to code, with nothing to install. Some estimates indicate that nearly 100 billion gigabyte hours are lost due to configuration problems each year.\n\nWhat if any project could be built or debugged without installing software? We'll explore the emerging market around cloud development and how developer work spaces can be provisioned, shared, and scaled.\n\nIn this session, you will:\n\nLearn about Eclipse Che and Eclipse Cloud Development, a technology stack for eliminating configuration from the lives of development teams.\nHear about an opinionated git and gerrit flow that enables tested pull-and-change requests to be submitted without the overhead of project configuration.\nSee a demo of how popular open source projects like Spring, Apache TomEE, Orbeon, and WSO2 have written their own provisioning capabilities.\nWe'll also demo an integration with WildFly that shows you how to quickly make a contribution without installing any software.</p>",
    "video_url": "https://www.youtube.com/watch?v=K5cP1t2cqfk",
    "speakers": "Red Hat Developers",
    "views": "84",
    "likes": "2",
    "video_thumb": "https://i.ytimg.com/vi/K5cP1t2cqfk/mqdefault.jpg",
    "hours": "0",
    "minutes": "51",
    "seconds": "6",
    "tags": [
      "903",
      "843"
    ],
    "publish_date": "2015-08-04T14:50:12",
    "path": "/video/youtube/K5cP1t2cqfk/"
  },
  {
    "title": "DevNation 2015 - Emmanuel Bernard - Mythbusters: ORMs & NoSQL",
    "description": "<p>Java is an object-oriented kingdom where object relational mapping (ORMs) have flourished. But do ORMs still provide benefits in a NoSQL and polyglot era? We'll discuss this and address other common misconceptions about NoSQL and ORMs. We'll also discuss the why and how of data design in NoSQL.\n\nWe'll explore the following list of myths and preconceptions about NoSQL:\n\nOnce you have chosen a NoSQL product, you don't need any other.\nNoSQL is a data duplication nightmare.\nJPA is not suited to non-relational databases.\nObjects don't fit in the data structures of NoSQL solutions.\nORMs cannot abstract the underlying NoSQL models.\nORMs speeds things up at runtime.\nThe query language of NoSQL cannot be abstracted.\nYou need access to the native API to make real use of NoSQL.\nORMs don't bring much value in an NoSQL world.\nWhile we can't do explosions experiments due to fire safety regulations, your vocal contribution is encouraged. Come and debate!</p>",
    "video_url": "https://www.youtube.com/watch?v=w1QXchXTihI",
    "speakers": "Red Hat Developers",
    "views": "67",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/w1QXchXTihI/mqdefault.jpg",
    "hours": "0",
    "minutes": "47",
    "seconds": "6",
    "tags": [
      "903",
      "1014",
      "205"
    ],
    "publish_date": "2015-08-06T16:59:58",
    "path": "/video/youtube/w1QXchXTihI/"
  },
  {
    "title": "DevNation 2015 - Dave Lester - Build distributed, fault-tolerant infrastructure with Apache Mesos",
    "description": "<p>Apache Mesos is a resource manager for datacenter infrastructure that uses a 2-level scheduling model to provide hardware resources to various application frameworks. \n\nSimilar to Infrastructure-as-a-Service (IaaS), Mesos manages hardware and the execution of applications, while delegating the responsibility of deployment to other platforms. In the Mesos’ model, application frameworks are responsible for scheduling and deployment logic. Multiple frameworks can be run on bare metal at the same time, using a single pool of resources, including use cases for long-running services (including Marathon, Aurora, Singularity) and batch or streaming (Hadoop, Storm, Jenkins).\n\nSeveral IaaS projects, including OpenStack and CloudStack, are interested in the abstraction Mesos provides for running and writing distributed applications. While IaaS typically addresses a larger set of concerns, the narrow focus of Mesos on resource management provides opportunities for integration between traditional IaaS and Mesos in the future.\n\nIn this session, you’ll get you an overview of the Mesos compute model, see how it relates to Infrastructure-as-a-Service, and walk through writing an application for Mesos using the framework API.</p>",
    "video_url": "https://www.youtube.com/watch?v=sP98rPhrQ1Y",
    "speakers": "Red Hat Developers",
    "views": "107",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/sP98rPhrQ1Y/mqdefault.jpg",
    "hours": "1",
    "minutes": "2",
    "seconds": "1",
    "tags": [
      "903",
      "740"
    ],
    "publish_date": "2015-08-06T17:07:11",
    "path": "/video/youtube/sP98rPhrQ1Y/"
  },
  {
    "title": "DevNation 2015 - Catherine Robson - Building your Internet of Things (IoT) user experience",
    "description": "<p>As enterprises look at ways they can transform their business with the Internet of Things (IoT), IT and development teams are left to figure out how each of these devices work together to create an experience that both delights users and meets company goals.\n\nLearn how to shape an ideal user experience using the IoT. We’ll show you how to create and extend possibilities for users to holistically connect with your brand and offerings.</p>",
    "video_url": "https://www.youtube.com/watch?v=A8_01VYOJXE",
    "speakers": "Red Hat Developers",
    "views": "97",
    "likes": "1",
    "video_thumb": "https://i.ytimg.com/vi/A8_01VYOJXE/mqdefault.jpg",
    "hours": "0",
    "minutes": "31",
    "seconds": "52",
    "tags": [
      "903",
      "1429",
      "1428",
      "1202"
    ],
    "publish_date": "2015-08-06T17:12:20",
    "path": "/video/youtube/A8_01VYOJXE/"
  },
  {
    "title": "DevNation 2015 - Sarah Novotny - Making the case for microservices",
    "description": "<p>The Internet has evolved from a monolithic application stack to a loosely coupled collection of microservices delivering specialized features. The benefits? Faster development and faster repair.\n\nIn this session, we’ll share strategies to help you move from a monolithic architecture to one that allows you to innovate, respond faster, and give your users the best possible experience. We'll discuss ways to give your users a better experience when failure does happen.</p>",
    "video_url": "https://www.youtube.com/watch?v=BmITUKkLnwg",
    "speakers": "Red Hat Developers",
    "views": "114",
    "likes": "1",
    "video_thumb": "https://i.ytimg.com/vi/BmITUKkLnwg/mqdefault.jpg",
    "hours": "0",
    "minutes": "57",
    "seconds": "52",
    "tags": [
      "903",
      "79"
    ],
    "publish_date": "2015-08-06T17:51:55",
    "path": "/video/youtube/BmITUKkLnwg/"
  },
  {
    "title": "DevNation 2015- Michael Hrivnak - Docker for developers",
    "description": "<p>Docker is not just for deployment. As a developer, there are many ways Docker can make you more productive, regardless of how your app gets deployed.\n\nIn this session, you'll learn practical strategies for using Docker, including how to:\n\nRun unit tests locally in multiple environments with almost no overhead.\nMake your integration tests easy for anyone to run by distributing them in a Docker image.\nSimulate advanced network topologies, especially for a service-oriented architecture.\nMake a Docker image in 5 minutes or less that produces builds from a consistent environment.\nIsolate database state changes in your test suite by using a pool of disposable containers.</p>",
    "video_url": "https://www.youtube.com/watch?v=czH9qZUusLs",
    "speakers": "Red Hat Developers",
    "views": "1368",
    "likes": "9",
    "video_thumb": "https://i.ytimg.com/vi/czH9qZUusLs/mqdefault.jpg",
    "hours": "0",
    "minutes": "44",
    "seconds": "56",
    "tags": [
      "903",
      "105",
      "1425"
    ],
    "publish_date": "2015-08-06T17:55:44",
    "path": "/video/youtube/czH9qZUusLs/"
  },
  {
    "title": "DevNation 2015 - Sander Mak - Typescript: Coding javascript without the pain",
    "description": "<p>Is your JavaScript growing out of control? Would you like to add some class to your client-side development? With TypeScript you can.\n\nTypeScript is an optionally typed superset of JavaScript. It adds classes, interfaces, and other object-oriented constructs familiar to Java developers. And it all compiles down to regular JavaScript for consumption by any JS runtime.\n\nIn this session, we’ll introduce TypeScript from the perspective of Java developers who also write JavaScript on the client-side. We’ll use examples and live coding to show you the power of this upcoming language. You’ll see that it's more modular, less error-prone, and more fun to code in TypeScript.</p>",
    "video_url": "https://www.youtube.com/watch?v=sNot2qxYujU",
    "speakers": "Red Hat Developers",
    "views": "770",
    "likes": "7",
    "video_thumb": "https://i.ytimg.com/vi/sNot2qxYujU/mqdefault.jpg",
    "hours": "1",
    "minutes": "1",
    "seconds": "57",
    "tags": [
      "903",
      "1424"
    ],
    "publish_date": "2015-08-06T18:16:10",
    "path": "/video/youtube/sNot2qxYujU/"
  },
  {
    "title": "DevNation 2015 - Brian Ashburn - The Internet of Things Protocol Roundup",
    "description": "<p>The Internet of Things (IoT) is made up of many interconnected devices that need to be able to talk to each other. Because these devices are developed by different organizations and have different requirements, they speak many different languages and protocols. There are standard protocols used by these devices, as well as industry-specific protocols.\n\nJoin us as we discuss the benefits, drawbacks, and applicable use cases for certain protocols, including MQTT, AMQP, STOMP, and others.\n\nWe will look at how Red Hat JBoss A-MQ and Red Hat JBoss Fuse can assist with implementing and managing these protocols. In addition, we’ll discuss how the transformation and routing capabilities of JBoss A-MQ and JBoss Fuse can be applied to IoT use cases and can be used to create and implement new protocols.</p>",
    "video_url": "https://www.youtube.com/watch?v=21N4zeHnEjI",
    "speakers": "Red Hat Developers",
    "views": "149",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/21N4zeHnEjI/mqdefault.jpg",
    "hours": "0",
    "minutes": "28",
    "seconds": "25",
    "tags": [
      "903",
      "1266"
    ],
    "publish_date": "2015-08-06T18:19:45",
    "path": "/video/youtube/21N4zeHnEjI/"
  },
  {
    "title": "DevNation 2015 - Javier Perez, Cian Clarke & John Frizelle - Feedhenry's Node.js capabilities",
    "description": "<p>Learn how to use Node.js to integrate with existing enterprise middleware systems. In this session, we will walk through a live demo of creating a Node.js microservice to integrate with Red Hat JBoss Fuse.</p>",
    "video_url": "https://www.youtube.com/watch?v=ftwQTbPr9VI",
    "speakers": "Red Hat Developers",
    "views": "340",
    "likes": "2",
    "video_thumb": "https://i.ytimg.com/vi/ftwQTbPr9VI/mqdefault.jpg",
    "hours": "0",
    "minutes": "58",
    "seconds": "49",
    "tags": [
      "903",
      "957"
    ],
    "publish_date": "2015-08-06T20:46:41",
    "path": "/video/youtube/ftwQTbPr9VI/"
  },
  {
    "title": "DevNation 2015 - Andrea Ceiner - Is your MQTT broker IoT-Ready",
    "description": "<p>IoT cloud platforms connect the physical world with the digital world: the former, made by billions of sensors, actuators, HMIs, devices and gateways; the latter, made by an unpredictable number of internet applications and apps. Existing OT (operational technologies) and IT (information technologies) were not made for this massive and intensive data communication scenario. There are specific functionality and performance requirements for deploying Red Hat JBoss A-MQ as a message broker for IoT deployments. This talk will illustrate the best practices that Eurotech and RedHat followed to deploy JBoss A-MQ in real world IoT-ready MQTT deployments.</p>",
    "video_url": "https://www.youtube.com/watch?v=b8HCyjiTfX4",
    "speakers": "Red Hat Developers",
    "views": "111",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/b8HCyjiTfX4/mqdefault.jpg",
    "hours": "0",
    "minutes": "43",
    "seconds": "38",
    "tags": [
      "903",
      "275"
    ],
    "publish_date": "2015-08-06T21:02:01",
    "path": "/video/youtube/b8HCyjiTfX4/"
  },
  {
    "title": "DevNation 2015 - Paul Bakker - Kubernetes: Beyond the basics",
    "description": "<p>Kubernetes has answers to many questions related to clustering and the required low-level networking. When using Kubernetes for real live deployments we need more than those lower-level solutions however. We need things like automated deployments, load balancing for web applications, blue/green deployments and monitoring.\n\nThis is all possible with Kubernetes when we start to look at Kubernetes as an API. In this talk you will learn to embrace the Kuberentes API and some of the patterns, tools and mechanisms we developed and use around Kubernetes to prepare for production grade deployments.</p>",
    "video_url": "https://www.youtube.com/watch?v=MuazGHiiGmA",
    "speakers": "Red Hat Developers",
    "views": "1385",
    "likes": "18",
    "video_thumb": "https://i.ytimg.com/vi/MuazGHiiGmA/mqdefault.jpg",
    "hours": "0",
    "minutes": "54",
    "seconds": "7",
    "tags": [
      "903",
      "125",
      "105"
    ],
    "publish_date": "2015-08-06T21:09:18",
    "path": "/video/youtube/MuazGHiiGmA/"
  },
  {
    "title": "DevNation 2015 - DeKoenigsberg & Christoffersen - Seamlessly integrating cloud technologies",
    "description": "<p>With Ansible Tower and OpenShift Enterprise, you can leverage new cloud technologies while still reusing your existing IT infrastructure to include enterprise database resources, mainframe systems, and your existing application farm.\n\nIn this talk, we'll show Ansible can seamlessly connect to your existing server infrastructure and provide the ability to roll-out standard configurations.  We'll also show how to create a new web application into OpenShift that leverages the new existing infrastructure as well as how to deploy an OpenShift application via Ansible Tower.</p>",
    "video_url": "https://www.youtube.com/watch?v=Ewpb5H9-3LA",
    "speakers": "Red Hat Developers",
    "views": "39",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/Ewpb5H9-3LA/mqdefault.jpg",
    "hours": "0",
    "minutes": "25",
    "seconds": "32",
    "tags": [
      "903",
      "731",
      "59"
    ],
    "publish_date": "2015-08-06T21:17:06",
    "path": "/video/youtube/Ewpb5H9-3LA/"
  },
  {
    "title": "DevNation 2015 - Gil Tene & John Kaczala - Duct-tape-free reactive java application",
    "description": "<p>What new big data cloud solutions, communications, or reactive applications could you bring to market if Java had the deterministic latency of compiled languages and the ability to handle massive heaps effectively without having to patch your architecture? Are usage scenarios involving enormous, data-generating, remote devices and event streams with low latency in your future? Would you like to continue using your experience with Java without compromising your loosely coupled architecture?\n\nHow can you achieve software maintainability and architectural purity with applications that are analytics-driven, use massive data sets, require event stream data analytics and correlation and counting on server-side Java heaps to manage your in-memory cache?         \nIn this session, we’ll explore ways to use JBoss Data Grid and JBoss Data Virtualization to incorporate persistence with NOSQL technology along with bounded latency Java technology. We’ll show how these technologies allow us to address a new range of applications that were previously out of bounds due to the non-deterministic nature of Java garbage collection.</p>",
    "video_url": "https://www.youtube.com/watch?v=h9NmB8JtB3I",
    "speakers": "Red Hat Developers",
    "views": "203",
    "likes": "2",
    "video_thumb": "https://i.ytimg.com/vi/h9NmB8JtB3I/mqdefault.jpg",
    "hours": "0",
    "minutes": "56",
    "seconds": "41",
    "tags": [
      "903",
      "983",
      "205",
      "1279"
    ],
    "publish_date": "2015-08-06T21:25:26",
    "path": "/video/youtube/h9NmB8JtB3I/"
  },
  {
    "title": "DevNation 2015 - Paulus Bakker & Sander Mak - Provisioning the Internet of Things",
    "description": "<p>How do we get our software out on the Internet of Things (IoT)? Many current deployment practices won’t work. Devices can be occasionally connected, through low-bandwidth networks, but are generally outside of direct control. Manually shuffling around binaries is not an option.\n\nApache ACE is an open source Java provisioning tool that tackles such challenges. This software distribution framework allows you to centrally manage and distribute software components, configuration data, and other artifacts to target systems.\n\nIn this session, learn how Apache ACE enables you to push out incremental updates and manage numerous devices. We’ll show how to update and extend a fictional car entertainment system using Apache ACE.</p>",
    "video_url": "https://www.youtube.com/watch?v=EgXrTFF9iLg",
    "speakers": "Red Hat Developers",
    "views": "51",
    "likes": "0",
    "video_thumb": "https://i.ytimg.com/vi/EgXrTFF9iLg/mqdefault.jpg",
    "hours": "0",
    "minutes": "54",
    "seconds": "38",
    "tags": [
      "903",
      "734",
      "1044"
    ],
    "publish_date": "2015-08-06T21:30:17",
    "path": "/video/youtube/EgXrTFF9iLg/"
  }
]