{
    "sessions": [
        {
            "title": "Going Reactive with Java",
            "date": "07/20/2017 12:00 PM EDT",
            "confirmed": true,
            "youtube_id": "mhwvDeDzSSA",
            "register": true,
            "abstract": "In this fast-paced, demo-focused session, we will show you how a reactive toolkit for Java known as Eclipse Vert.x can fundamentally change the way you build applications.  If you have grown weary of your old CRUD with GET&POST development model then this fun session is exactly what you need.",
            "speakers": ["burrsutter"]
        },
        {
            "title": "Kubernetes for Java developers",
            "date": "08/03/2017 12:00 PM EDT",
            "confirmed": true,
            "youtube_id": "_vM3ORa9_JE",
            "register": true,
            "abstract": "Developers are becoming more familiar with Linux containers each day, but have you really ever thought about how to manage a fleet of containers? Hundreds or thousands of containers? Kubernetes from Google has become the 'de facto' standard for container orchestration. This brief session will provide your with a basic understanding of what  Kubernetes is and how it can help you to run your Linux containers at scale. After this session, you will only want to deploy your Java applications and microservices on Kubernetes!",
            "speakers": ["rafabene"]
        },
        {
            "title": "Sidecars and a Microservices Mesh",
            "date": "08/17/2017 12:00 PM EDT",
            "confirmed": true,
            "youtube_id": "ZR2GGoT_GTg",
            "register": true,
            "abstract": "The first generation of microservices was primarily shaped by NetflixOSS and leveraged by numerous Spring Cloud annotations all throughout your business logic. The next generation of microservices will leverage sidecars and a service mesh.  In this session, we will give you a taste of Envoy and Istio, two open source projects that will change the way you write distributed, cloud native, Java applications on Kubernetes.",
            "speakers": ["christianposta"]
        },
        {
            "title": "Big Data In Action with Infinispan",
            "date": "09/07/2017 12:00 PM EDT",
            "confirmed": true,
            "youtube_id": "ZUZeAfdmeX0",
            "register": true,
            "abstract": "Dealing with real-time, in-memory, streaming data is a unique challenge and with the advent of the smartphone and IoT (trillions of internet connected devices), we are witnessing an exponential growth in data at scale.<br/><br/>Building data layers that can satisfy these requirements can be challenging, but with the help of Infinispan, an in-memory data grid, you can take advantage of state of the art distributed data processing capabilities to tackle these challenges. From classic or full-text queries, to Spark/Hadoop integrations via distributed Java Streams, these wide ranging data processing capabilities make Infinispan the perfect choice for the Big Data era.<br/><br/>In this session, we will identify critical patterns and principles that will help you achieve greater scale and response speed. On top of that, you will witness how Infinispan follows these patterns and principles to tackle a big data situation via a live coding demonstration.",
            "speakers": ["galder"]
        },
        {
            "title": "Reactive Landscape",
            "date": "09/21/2017 12:00 PM EDT",
            "confirmed": true,
            "youtube_id": "Y-7LnLl8160",
            "register": true,
            "abstract": "Reactive Programming, Reactive eXtensions, Reactive Streams, Reactive Systems, Reactive Manifesto, that's a lot of 'reactive' thingies. Just to make it even more confusing, 'reactive' is often associated with asynchronous, scalability, RX libraries (RX Java, RX JS), back pressure, streams, observables, futures, promises, spreadsheets and so on…. That's a lot to digest… This session helps you understanding what's behind the 'reactive' word. It explores the reactive landscape and explains what all these 'things' are and how they are related. Attendees don't only learn what does 'reactive' mean, but also how it is related to their projects and applications. By providing a global overview of the reactive landscape, this session also provides to the attendees a general understanding of the 'reactive' trend, and why it matters. The presentation uses several live coding demos to explain the different concepts. It uses Eclipse Vert.x as a playground to explain how all these concepts work together. Eclipse Vert.x is a toolkit to build reactive and distributed systems on the JVM. It supports a set of languages such as Java, JavaScript, Ceylon, Scala and Kotlin… but also a set of programming styles (callbacks, futures, streams, RX...). It covers a large part of the reactive spectrum making it a great choice to implement reactive applications and systems.",
            "speakers": ["clement"]
        },
        {
            "title": "Domain Driven Design for Mere Mortals",
            "date": "10/19/2017 12:00 PM EDT",
            "confirmed": true,
            "youtube_id": "8k2yNRHdG2U",
            "register": true,
            "abstract": "Domain-driven design (DDD) is a proven approach to building software that people love, and that delivers lasting business value. Unfortunately, the way we commonly present DDD in the community has made the subject feel academic and complex. <p>Join this webinar, where we'll:<ul><li>Strip away the confusing jargon and focus on the surprisingly simple core principles that make DDD so powerful.</li><li>Learn from some actual, exemplar software projects using techniques for establishing, and maintaining, domain-driven design on teams composed of mere mortals.</li></ul></p>",
            "speakers": ["justinholmes"]
        },
        {
            "title": "Why you're going to fail running Java on Docker",
            "date": "11/2/2017 12:00 PM EDT",
            "confirmed": true,
            "youtube_id": "tI2l8yThKK4",
            "register": true,
            "abstract": "<p>Running Java&trade; on Docker is easy, right? Just create a Dockerfile, run a Docker build and then you&rsquo;re ready to go. This way of thinking is the easiest path to complete failure when running Docker containers in production.</p><p>The JVM knows how to auto-tune itself to achieve the best possible performance in the environment in which it&rsquo;s running. So far, that environment has been a single physical or virtual machine. But containers change everything&mdash;you need to know how containers manages their own resources, and you need to apply this knowledge when running and optimizing your JVM running in a container.</p><p>In this session, you&rsquo;ll learn:</p><ul><li>The best way to run Java on Docker in production.</li><li>A lot about JVM and containers to avoid the highway to debugging hell.</li><li>Simple tips &amp; tricks to save you many hours logging and debugging container problems.</li></ul>",
            "speakers": ["rafabene"]
        },
        {
            "title": "Update your Database Schema with Zero Downtime Migrations",
            "date": "11/16/2017 12:00 PM EST",
            "confirmed": true,
            "youtube_id": "3mj6Ni7sRN4",
            "register": true,
            "abstract": "You joined the DevOps movement and want to release software even faster and safer. And how do you achieve this multiple times per day without disrupting your users in production? With Zero Downtime! But what about my data? What about my relational database schema? Join us on this session and we'll show that with code might be 'easy', and data may be 'hard', but it's definitely possible and practical.",
            "speakers": ["yanaga"]
        },
        {
            "title": "Fat Jar Smackdown",
            "date": "12/7/2017 12:00 PM EST",
            "confirmed": true,
            "youtube_id": "5dqgGj_uuIo",
            "register": true,
            "abstract": "You've heard of Fat/Uber JARs and are probably building them today. But every time you build one, a tree is chopped down in the forest to power the compute, disk and networking resources needed to deploy it to your production systems. In this session, we'll explore the benefits and costs of Fat JAR packaging and demonstrate various options for slimming your apps and saving those trees using popular frameworks like Wildfly Swarm, Dropwizard, Spring Boot and Eclipse Vert.x.",
            "speakers": ["jamesfalkner"]
        },
        {
            "title": "MicroProfile - Microservices with Java EE",
            "date": "1/18/2018 12:00 PM EST",
            "confirmed": true,
            "youtube_id": "fbVYQENPa4s",
            "register": true,
            "abstract": "Developers have a tremendous amount of Java&trade; EE and general Enterprise Java knowledge and skill that they want to use as they evaluate the adoption of a cloud-native architecture. MicroProfile is a baseline platform definition that optimizes Enterprise Java for a microservices architecture and delivers application portability across multiple MicroProfile runtimes. This encompasses a growing collection of specifications that address microservice patterns like fault tolerance, configuration, metrics, health check, security, and more. Learn more at:<a href='https://microprofile.io'>https://microprofile.io</a>. Join this webinar to learn the current state of progress within the MicroProfile community.",
            "speakers": ["yanaga","jclingan"]
        },
        {
            "title": "Istio: Canaries and Kubernetes",
            "date": "2/1/2018 12:00 PM EST",
            "confirmed": true,
            "youtube_id": "YQLOcjvbo9s",
            "register": true,
            "abstract": "Being a cloud native developer requires learning some new language and new skills like circuit-breakers, canaries, service mesh, linux containers, dark launches, tracers, pods and sidecars.  In this session, we will introduce you to cloud native architecture by demonstrating numerous principles and techniques for building and deploying Java microservices via Spring Boot, Wildfly Swarm and Vert.x, while leveraging Istio on Kubernetes with OpenShift.",
            "speakers": ["burrsutter"]
        },
        {
            "title": "KubeBoot - Spring Boot deployment on Kubernetes has never been so easy",
            "date": "2/15/2018 12:00 PM EST",
            "confirmed": true,
            "youtube_id": "Cv8_EHQgUZ4",
            "register": true,
            "inxpo": "https://onlinexperiences.com/Launch/QReg/ShowKey=47991&AffiliateData=RHDP",
            "abstract": "Have you ever thought how to deploy Cloud Native Java Applications (Spring Boot) on Kubernetes? Kubernetes has now become a de-facto standard for deploying Cloud Native Applications, but still there is myth that they are not ready for Java workloads. The aim of this session is to break that myth to show Kubernetes is well suited for Cloud Native Java applications. The session starts with a brief history of Microservices; the framework, the libraries, the platform and the tools that have been part of every cloud native applications and how they become deprecated with Cloud Native Java applications deployed to Kubernetes. The session explores the cloud native characteristics such as Discovery, Blue/Green Deployments, Elasticity, Canary Deployments, Resiliency, Pipeline(CI/CD), Authentication etc., becomes implicit characteristics to your Spring Boot Java applications that are deployed on Kubernetes/OpenShift. In this session, we will see how to build, debug, deploy and discover Spring Boot applications on Kubernetes, covering in depth details of the tools, libraries and platform that could be used to make your spring boot deployment smooth and easy.",
            "speakers": ["kamesh"]
        },
        {
            "title": "Secure Spring Boot Microservices with Keycloak",
            "date": "3/1/2018 12:00 PM EST",
            "confirmed": true,
            "youtube_id": "Bdg_DjuoX0A",
            "register": true,
            "inxpo": "https://onlinexperiences.com/Launch/QReg/ShowKey=48840&AffiliateData=RHDP",
            "abstract": "<p>Although security and identity management is a crucial aspect for any application, its implementation can be difficult. Worse, it’s often neglected, poorly implemented, and intrusive in the code. Recently, identity management servers have appeared that allow you to outsource and delegate all aspects of authentication and authorization, such as <a href='https://auth0.com/'>https://auth0.com/</a>. Of these servers, one of the most promising is Keycloak—open source, flexible, agnostic of any technology and is easily deployable and adaptable in its own infrastructure.<br/><br/>In this session, we’ll discover KeyCloak progressively and in an interactive way:<br/>No slides, just 100% live coding<br/>Focused on the Spring Boot adapter provided by Keycloak<br/>Showing how to combine Spring Security with Keycloak</p>",
            "speakers": ["sebastienblanc"]
        },
        {
            "title": "Camel Riders in the Cloud",
            "date": "3/15/2018",
            "confirmed": true,
            "youtube_id": "zuEYtMvHN6g",
            "register": true,
            "inxpo": "https://onlinexperiences.com/Launch/Event/ShowKey=49311&AffiliateData=rhdp",
            "abstract": "Apache Camel has fundamentally changed the way enterprise Java™ developers think about system-to-system integration by making enterprise integration patterns (EIP) a simple declaration in a lightweight application wrapped and delivered as a single JAR.<br/><br/>In this session, we’ll show you how to bring the best practices from the enterprise integration world together with Linux containers, running on top of Kubernetes/OpenShift, and deployed as microservices, which are both cloud-native and cloud-portable.",
            "speakers": ["clausibsen"]
        },
        {
            "title": "Test smarter and gain some time back",
            "date": "4/5/2018",
            "confirmed": true,
            "youtube_id": "0lUwLXpID1M",
            "register": true,
            "inxpo": "https://onlinexperiences.com/Launch/QReg/ShowKey=49638&AffiliateData=rhdp",
            "abstract": "&ldquo;A programmer is an organism capable of converting coffee into code.&rdquo;</br>The best excuse for a 5-minute coffee break used to be &ldquo;my code is compiling,&rdquo; and these days we have &ldquo;my tests are running.&rdquo; It's a huge waste of developer time and continuous integration resources to have such long-running tests. But what&rsquo;s even more important, it slows down development and deployment velocity, resulting in slower time to market and greater lead times.</br>Join this session for a smart solution to this problem. We&rsquo;ll show you how a new Java&trade; tool can drastically reduce your test execution time, letting you stay in the zone and increasing your personal productivity and velocity. Caveat: You may have to find a different excuse to get coffee.",
            "speakers": ["alexsoto"]
        },
        {
            "title": "SAMPLE TITLE",
            "date": "1/1/2018 12:00 PM EST",
            "confirmed": false,
            "youtube_id": "",
            "register": true,
            "inxpo": "https://onlinexperiences.com/Launch/QReg/ShowKey=#####&AffiliateData=RHDP",
            "abstract": "SAMPLE ABSTRACT",
            "speakers": ["sample"]
        }
    ],
    "speakers": {
        "burrsutter": {
            "name": "Burr Sutter",
            "intro": "A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat's Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world's leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company's premier annual event.",
            "twitter": "burrsutter",
            "image": ""
        },
        "rafabene": {
            "name":"Rafael Benevides",
            "intro":"Rafael Benevides, Red Hat director of Developer Experience, has many years of experience in several fields of the IT industry. He helps developers and companies all over the world be more effective in software development. Rafael considers himself a problem solver who has a big love for sharing. He is a member of Apache DeltaSpike PMC—a Duke's Choice Award winner project, and he's a speaker in conferences like JavaOne, Devoxx, TDC, DevNexus, and many others.",
            "twitter":"rafabene",
            "image": ""
        },
        "christianposta": {
            "name":"Christian Posta",
            "intro":"Christian Posta (@christianposta) is a Chief Architect of cloud applications at Red Hat and well known in the community for being an author (Microservices for Java Developers, O'Reilly 2016), frequent blogger, speaker, open-source enthusiast and committer on various open-source projects. Christian has spent time at web-scale companies and now helps companies create and deploy large-scale, resilient, distributed architectures - many of what we now call Microservices. He enjoys mentoring, training and leading teams to be successful with distributed systems concepts, microservices, devops, and cloud-native application design.",
            "twitter":"christianposta",
            "image": ""
        },
        "galder": {
            "name":"Galder Zamarreno",
            "intro":"Galder Zamarreño is a core R&D engineer at JBoss, a division of Red Hat. He is one of the founding engineers of Infinispan, Red Hat's distributed, in-memory key-value store and he currently spends most of his time developing Infinispan's Javascript client as well as other data grid and caching functionality. He is very keen on functional programming and has been developing Scala since 2009. Lately he's been learning Haskell and has been presenting Elm based Infinispan demos. Prior to joining Red Hat, Galder worked in the Retail industry where he was a software developer involved in the development of an EFT software switch solution based on JBoss technologies. The love for distributed systems and open source software comes from his days at ESIDE faculty at University of Deusto (Bilbao, Spain) where he studied a master's degree in Computer Science.",
            "twitter": "",
            "image": ""
        },
        "clement": {
            "name":"Clement Escoffier",
            "intro":"Who am I? That's a good question. I had several professional lives, from academic positions to management. Currently, I'm working for Red Hat as Vert.x core developer. I have been involved in projects and products touching many domains and technologies such as OSGi, mobile app development, continuous delivery, DevOps… My main point of interest? Software engineering, so processes, methods, tools that make the development of software more efficient and also more fun. I'm also an active contributor to many open source projects such as Apache Felix, iPOJO, Wisdom Framework, and obviously, Eclipse Vert.x.",
            "twitter":"clementplop",
            "image": ""
        },
        "justinholmes": {
            "name":"Justin Holmes, senior application architect, Open Innovations Lab, Red Hat",
            "intro":"Justin Holmes is a passionate consultant who helps teams deliver better software products, faster. He is a fan of methods that lead delivery teams toward shared understanding and technologies that capture that understanding in software. Justin is active in the Behavior Driven Development, Domain Driven Design, and Lean Product Development communities. You can also find him helping customers accelerate their innovative ideas in Red Hat&reg; <a href=\"https://www.redhat.com/en/open-innovation-labs\">Open Innovation Labs</a>.",
            "twitter":"",
            "image":""
        },
        "yanaga": {
            "name":"Edson Yanaga",
            "intro":"Edson Yanaga is Red Hat's director of Developer Experience, a Java Champion, and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java™, microservices, cloud computing, DevOps, and software craftsmanship. Yanaga considers himself a software craftsman and is convinced that all of us can create a better world for people with better software. He is passionate about helping developers worldwide deliver better software more quickly and safely.",
            "twitter":"yanaga",
            "image": ""
        },
        "jclingan": {
            "name":"John Clingan, product manager, Red Hat",
            "intro":"John Clingan is a Red Hat senior principal product manager for Red Hat® OpenShift Application Runtimes, which optimizes cloud-native development with Eclipse Vert.x, WildFly Swarm, Node.js, and Spring Boot for development for OpenShift/Kubernetes. John is also an Eclipse MicroProfile co-founder.",
            "twitter":"jclingan",
            "image":""
        },
        "jamesfalkner": {
            "name":"James Falkner",
            "intro":"James Falkner is a Red Hat technology evangelist, teacher, learner, and author. Dedicated to open source and open computing he works at Red Hat as a product marketing manager for Red Hat's portfolio of open source products.",
            "twitter":"schtool",
            "image":""
        },
        "kamesh": {
            "name":"Kamesh Sampath",
            "intro":"Kamesh is currently Red Hat's Director of Developer Experience, most part of Kamesh's career was with services industry helping various customers build Java based solutions. Kamesh is the creator of vertx-maven-plugin(https://vmp.fabric8.io) and he has been an active contributor to fabric8 project. Being a OpenSource developer and contributor Kamesh's loves sharing his experience on building and deploying Java Applications on Kubernetes/OpenShift. He still loves to learn new technologies and strongly believe in 'ITS BETTER TO SHARE'.",
            "twitter":"",
            "image":""
        },
        "sebastienblanc": {
            "name":"Sebastien Blanc",
            "intro":"Sébastien Blanc is Red Hat principal software engineer with 12 years of experience focusing on the KeyCloak project. In addition to his strong JEE profile of middleware, banking, and insurance products, Sébastien shares his passion at various conferences like Devoxx, JUDCon, JavaOne, and SpringOne.",
            "twitter":"",
            "image":""
        },
        "clausibsen": {
            "name":"Claus Ibsen",
            "intro":"Claus Ibsen is co-author of the Camel in Action books. Claus is a long time Apache Camel committer, and wrote a lot of the Camel code. He is a professional open source developer, working daily on the Apache Camel and ActiveMQ projects, as well as working with other open source integration technologies such as hawtio, vert.x and fabric8. Claus spends many hours in the Camel community to help others, write blogs, tweet, and help make Apache Camel a better product.",
            "twitter":"davsclaus"
        },
        "alexsoto": {
            "name":"Alex Soto Bueno",
            "intro":"Alex Bueno is a Red Hat software engineer in the Developers group. He is a passionate about the Java world, software automation, and he believes in the open source software model. Alex is the creator of the NoSQLUnit project, member of the JSR374 (Java API for JSON Processing) Expert Group, the co-author of &ldquo;Testing Java Microservices&rdquo; (a Manning Publications book), and contributor of several open source projects such as Arquillian ecosystem or Asciidoctor. He is an international speaker presenting at software conferences like Devoxx, JavaOne, JavaZone, or JavaLand.",
            "twitter":"alexsotob"
        }
    }
}
